{
  "_STEP_9_3_3_2_NAME_": "Beschriftungen von Formularelementen vorhanden",
  "_STEP_9_3_3_2_NAME_MENU_": "9.3.3.2 Beschriftungen von Formularelementen vorhanden",
  "_STEP_9_3_3_2_WHAT_CHECKED_1_": "<p>Sichtbare Beschriftungen von Formularelementen sind vorhanden.</p>",
  "_STEP_9_3_3_2_WHAT_CHECKED_2_": "<p>Eine sichtbare Beschriftung von Formularelementen soll vor (das heißt links neben oder über) dem zugehörigen Eingabefeld vorhanden sein. Nur die Beschriftung von Checkboxes und Radiobuttons kann (und sollte normalerweise) rechts neben dem zugehörigen Eingabefeld angeordnet werden.</p>",
  "_STEP_9_3_3_2_WHAT_CHECKED_3_": "<p>Wenn für die Eingabe ein bestimmtes Format verlangt wird, so sind die Anweisungen für alle Benutzer lesbar.</p>",
  "_STEP_9_3_3_2_WHY_CHECKED_1_": "<p>Wenn sichtbare Beschriftungen zur Verfügung gestellt werden, wissen Nutzer, welche Eingaben erwartet werden. Fehler können so vermieden werden.</p>",
  "_STEP_9_3_3_2_WHY_CHECKED_2_": "<p>Die Anordnung von Beschriftungen direkt vor oder über dem Eingabefeld entspricht den üblichen Gestaltungskonventionen. Auch in ausschnitthaften Ansichten (etwa in Vergrößerungssoftware) wird schnell klar, welche Beschriftung zu welchem Feld gehört.</p>",
  "_STEP_9_3_3_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_3_3_2_HOW_CHECKED_2_": "<ul><li><p>Der Prüfschritt ist anwendbar, wenn die Seite Formularelemente enthält.</p></li></ul>",
  "_STEP_9_3_3_2_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_3_3_2_HOW_CHECKED_4_": "<p>Die Seite im Firefox oder Chrome Browser aufrufen.</p>",
  "_STEP_9_3_3_2_HOW_CHECKED_5_": "<h4 id=\"_2_1_sind_beschriftungen_vorhanden\">2.1 Sind Beschriftungen vorhanden?</h4>",
  "_STEP_9_3_3_2_HOW_CHECKED_6_": "<ul><li><p>Sind alle Formularelemente sichtbar beschriftet?</p></li><li><p>Sind Pflichtfelder über Text gekennzeichnet, etwa durch die Ergänzung (Pflichtfeld) nach der Beschriftung, oder durch die Auszeichnung aller Nicht-Pflichtfelder durch die Ergänzung (optional)? Wenn zur Anzeige der Pflichtfelder Symbole wie Sternchen (*) genutzt werden, sollte deren Bedeutung erklärt sein (am besten am Beginn des Formulars, bei einem mehrstufigen Formular beim ersten Formular).</p></li><li><p>Wenn Eingabefelder ein bestimmtes Eingabeformat vorgeben, wird dieses <strong>vor</strong> dem Eingabefeld oder auch im Placeholder-Text klar beschrieben (Beispiele wären \"Format der Datumseingabe: TT.MM.JJJJ\" oder \"Telefonnummer: Nur Zahlen ohne Leerstellen oder Bindestriche eingeben\").</p></li></ul>",
  "_STEP_9_3_3_2_HOW_CHECKED_7_": "<h4 id=\"_2_2_sind_beschriftungen_richtig_positioniert\">2.2 Sind Beschriftungen richtig positioniert?</h4>",
  "_STEP_9_3_3_2_HOW_CHECKED_8_": "<ol><li><p>Mittels <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#webdeveloper\">Web Developer Toolbar</a> die Funktion <em>Miscellaneous &gt; Linearize page</em> aufrufen und damit die Struktur der Seite linearisieren.</p></li><li><p>Prüfen, ob in der linearisierten Ansicht die Beschriftung der Eingabefelder klar den Feldern zuzuordnen ist, das heißt, die Beschriftung soll immer direkt <strong>über</strong> oder <strong>vor</strong> dem Feld stehen. Die Beschriftung von Checkboxen und Radiobuttons kann (und sollte in der Regel auch) <strong>nach</strong> dem Formularelement stehen.</p></li></ol>",
  "_STEP_9_3_3_2_HOW_CHECKED_9_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_9_3_3_2_HOW_CHECKED_10_": "<ul><li><p>Das <code>placeholder</code>-Attribut ist keine ausreichende Beschriftung im Sinne dieses Prüfschritts. Es verschwindet bei (auch versehentlichen) Nutzereingaben.</p></li><li><p>Bei kombinierten Eingabeelementen hat nicht immer jedes Element eine zugeordnete Beschriftung. In diesem Fall sollen Elemente mit einem erklärenden <code>title</code>-Attribut versehen werden. Beispiel: In einem Formular werden für die Eingabe eines Datums drei Auswahllisten angeboten (Tag, Monat und Jahr). Die drei Auswahllisten haben eine gemeinsame Beschriftung: Datum. Die Auswahllisten für Tag, Monat und Jahr sind mit einem erklärenden <code>title</code>-Attribut versehen.</p></li><li><p>Es kann sinnvoll sein, dass bei Formularen Hinweise zum Eingabeformat oder zu ausgelösten Aktionen einmal am Beginn des Formulars stehen statt vor jedem einzelnen Eingabefeld.</p></li><li><p>Wenn ein einfaches Suchformular nur aus einem Eingabefeld und einem Button besteht, ist oftmals keine sichtbare Beschriftung notwendig. Voraussetzung ist jedoch, dass sich die visuelle Gestaltung des Submit-Buttons an übliche Konventionen orientiert. Es muss visuell verständlich sein, dass es sich um eine Suche handelt (z.B. durch Verwendung eines Lupe-Icons). Die programmatische Ermittelbarkeit einer nicht visuellen Beschriftung ist Gegenstand des Prüfschritts 1.3.1h Beschriftung von Formularelementen programmatisch ermittelbar (siehe dort Abschnitt 3.3). Ein Mangel bzgl. der programmatischen Ermittelbarkeit führt in diesem Prüfschritt nicht zu einer negativen Bewertung.</p></li></ul>",
  "_STEP_9_3_3_2_HOW_CHECKED_11_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_9_3_3_2_HOW_CHECKED_12_": "<h4 id=\"_nicht_erfüllt\">Nicht erfüllt</h4>",
  "_STEP_9_3_3_2_HOW_CHECKED_13_": "<ul><li><p>Wichtige Formularelemente (z. B. die Sucheingabe) sind ohne sichtbare Beschriftung, auch angrenzende Elemente erklären nicht die Funktion.</p></li></ul>",
  "_STEP_9_3_3_2_HOW_CHECKED_14_": "<h4 id=\"_teilweise_erfüllt_oder_schlechter\">Teilweise erfüllt oder schlechter</h4>",
  "_STEP_9_3_3_2_HOW_CHECKED_15_": "<ul><li><p>Beschriftungen werden nur als Formularfeld-Vorbelegung (<code>placeholder</code>-Attribut) bereitgestellt.</p></li></ul>",
  "_STEP_9_3_3_2_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_von_anderen_prüfschritten\">Abgrenzung von anderen Prüfschritten</h3>",
  "_STEP_9_3_3_2_CLASSIFICATION_2_": "<p>In diesem Prüfschritt geht es um sichtbare Beschriftungen. Das Vorhandensein programmatisch ermittelbarer Namen von Formularelementen wird dagegen in Prüfschritt 9.1.3.1h \"Beschriftung von Formularelementen programmatisch ermittelbar\" geprüft.</p>",
  "_STEP_9_3_3_2_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_3_3_2_CLASSIFICATION_4_": "<h4 id=\"_guidelines\">Guidelines</h4>",
  "_STEP_9_3_3_2_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/quickref/?showtechniques=334#input-assistance\"> Guideline 3.3 Input Assistance: Help users avoid and correct mistakes.</a></p></li></ul>",
  "_STEP_9_3_3_2_CLASSIFICATION_6_": "<h4 id=\"_success_criteria\">Success criteria</h4>",
  "_STEP_9_3_3_2_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/quickref/?showtechniques=334#labels-or-instructions\"> 3.3.2 Labels or Instructions</a> (Level A)</p></li></ul>",
  "_STEP_9_3_3_2_CLASSIFICATION_8_": "<h4 id=\"_techniques\">Techniques</h4>",
  "_STEP_9_3_3_2_CLASSIFICATION_9_": "<h5 id=\"_general_techniques\">General Techniques</h5>",
  "_STEP_9_3_3_2_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G13.html\"> G13: Describing what will happen before a change to a form control that causes a change of context to occur is made</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G89.html\"> G89: Providing expected data format and example</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G131.html\"> G131: Providing descriptive labels</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G162.html\"> G162: Positioning labels to maximize predictability of relationships</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G184.html\"> G184: Providing text instructions at the beginning of a form or set of fields that describes the necessary input</a></p></li></ul>",
  "_STEP_9_3_3_2_CLASSIFICATION_11_": "<h5 id=\"_html_techniques\">HTML Techniques</h5>",
  "_STEP_9_3_3_2_CLASSIFICATION_12_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H44.html\"> H44: Using label elements to associate text labels with form controls</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H65.html\"> H65: Using the title attribute to identify form controls when the label element cannot be used</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H71.html\"> H71: Providing a description for groups of form controls using fieldset and legend elements</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H90.html\"> H90: Indicating required form controls using label or legend</a></p></li></ul>",
  "_STEP_9_3_3_2_CLASSIFICATION_13_": "<h5 id=\"_aria_techniques\">ARIA Techniques</h5>",
  "_STEP_9_3_3_2_CLASSIFICATION_14_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA1\"> ARIA1: Using the aria-describedby property to provide a descriptive label for user interface controls</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA9\"> ARIA9: Using aria-labelledby to concatenate a label from several text nodes</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA17.html\"> ARIA17: Using grouping roles to identify related form controls</a></p></li></ul>",
  "_STEP_9_3_3_2_CLASSIFICATION_15_": "<h5 id=\"_failures\">Failures</h5>",
  "_STEP_9_3_3_2_CLASSIFICATION_16_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F82.html\"> F82: Failure of Success Criterion 3.3.2 by visually formatting a set of phone number fields but not including a text label</a></p></li></ul>"
}