{
  "_STEP_9_1_3_1E_NAME_": "Datentabellen richtig aufgebaut",
  "_STEP_9_1_3_1E_WHAT_CHECKED_1_": "<p>Datentabellen sind strukturell richtig aufgebaut, Zeilen- und Spaltenüberschriften sind mit <code>th</code> oder den entsprechenden ARIA-Rollen ausgezeichnet.</p>",
  "_STEP_9_1_3_1E_WHY_CHECKED_1_": "<p>Visuell orientierte Personen nutzen für die Orientierung in einer Datentabelle neben den Überschriften, wenn nötig, auch den Wertebereich. Es ist für sie daher relativ leicht möglich, strukturelle Mängel, zum Beispiel Wechsel in der Bedeutung von Zeilen oder Spalten zu erkennen und mit ihnen umzugehen.</p>",
  "_STEP_9_1_3_1E_WHY_CHECKED_2_": "<p>Sehbehinderte und blinde Nutzende erschließen sich das Angebot von Datentabellen dagegen eher analytisch. Sie entwickeln ausgehend von den Überschriften und anderen im Kontext verfügbaren Informationen eine Vorstellung vom Aufbau der Tabelle. Diese Vorstellung ist die Grundlage für den Zugriff auf die angebotenen Daten.</p>",
  "_STEP_9_1_3_1E_WHY_CHECKED_3_": "<p>Damit das möglich ist und funktioniert, müssen zwei Bedingungen erfüllt sein:</p>",
  "_STEP_9_1_3_1E_WHY_CHECKED_4_": "<ul><li><p>Die Tabelle muss eine klare Struktur haben, die Bedeutung der Zeilen und Spalten muss fassbar sein und sie muss möglichst gut den Überschriften oder unterstützenden Kontextinformationen zu entnehmen sein. Die Überschriften müssen auffindbar sein und es muss klar sein, auf welche Daten sie sich beziehen, sie müssen also korrekt ausgezeichnet sein.</p></li><li><p>Die klare Struktur ist die Grundlage der Barrierefreiheit von Datentabellen. Es ist nicht möglich, eine mangelhaft strukturierte Datentabelle durch spezielle Auszeichnung barrierefrei zugänglich zu machen. Auf Grundlage einer klaren, nachvollziehbaren Struktur ist die korrekte Auszeichnung aber nützlich und wichtig.</p></li></ul>",
  "_STEP_9_1_3_1E_WHY_CHECKED_5_": "<p>Mögliche Anwendungen der Auszeichnung von Tabellenüberschriften:</p>",
  "_STEP_9_1_3_1E_WHY_CHECKED_6_": "<ul><li><p>Der Screenreader informiert über die Position und Anzahl der Überschriftenreihen.</p></li><li><p>Der Screenreader liest die (neue) Zeilen- oder Spaltenüberschrift vor, wenn Nutzende die Tabellenzeile oder die Tabellenspalte wechselt.</p></li><li><p>Überschriften werden in einer für Nutzende besser geeigneten Form hervorgehoben.</p></li></ul>",
  "_STEP_9_1_3_1E_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_1_3_1E_HOW_CHECKED_2_": "<p>Der Prüfschritt ist immer anwendbar, wenn native oder über ARIA-Rollen ausgezeichnete Datentabellen auf der Seite vorhanden sind. Er ist ebenso anwendbar, wenn Inhalte visuell als Datentabelle strukturiert sind.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_1_3_1E_HOW_CHECKED_4_": "<h4 id=\"_2_1_tabellen_für_tabellarische_daten_verwendet\">2.1 Tabellen für tabellarische Daten verwendet?</h4>",
  "_STEP_9_1_3_1E_HOW_CHECKED_5_": "<ul><li><p>Prüfen, ob für tabellarische Daten <code>table</code> oder eine korrekte und vollständige Umsetzung mittels geeigneter ARIA-Rollen wie <code>role=\"table\"</code>, <code>role=\"row\"</code>, <code>role =\"columnheader\"</code> und <code>role=\"rowheader\"</code> genutzt wird.</p></li></ul>",
  "_STEP_9_1_3_1E_HOW_CHECKED_6_": "<h4 id=\"_2_2_prüfung_des_aufbaus_von_tabellen\">2.2 Prüfung des Aufbaus von Tabellen:</h4>",
  "_STEP_9_1_3_1E_HOW_CHECKED_7_": "<p>Prüfen, ob die Tabelle bzw. das ARIA-Konstrukt strukturell sinnvoll aufgebaut ist. Schwierigkeiten entstehen oft dadurch, dass die Tabelle auch Layoutzwecken dient, das Tabellengitter also für die Anordnung von Inhalten auf dem Bildschirm genutzt wird.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_8_": "<p>Problematisch können zum Beispiel sein:</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_9_": "<ul><li><p>Eine Spalte mit Daten ist vor der Überschriftenspalte platziert</p></li><li><p>Wechsel der Bedeutung von Zeilen oder Spalten (\"ab hier …​\")</p></li><li><p>Zellen mit Erläuterungen sind in die Tabelle integriert</p></li><li><p>Leere Zeilen werden eingefügt, um die Höhe oder den Abstand von Zeilen festzulegen</p></li><li><p>Verschachtelungen (weitere Tabelle innerhalb einer Tabellenzelle)</p></li></ul>",
  "_STEP_9_1_3_1E_HOW_CHECKED_10_": "<h5 id=\"_woran_erkennt_man_dass_eine_datentabelle_sinnvoll_aufgebaut_ist\">Woran erkennt man, dass eine Datentabelle sinnvoll aufgebaut ist?</h5>",
  "_STEP_9_1_3_1E_HOW_CHECKED_11_": "<p>Bei einer sinnvoll aufgebauten Tabelle kann man sagen, welche Informationen in den einzelnen Spalten und Zeilen der Tabelle enthalten sind. Man kann diesen Inhalt allgemein fassen, nicht nur als eine Zusammenstellung der in den einzelnen Zellen abgelegten Werte.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_12_": "<p>Die Bedeutung der einzelnen Spalten und Zeilen kann in den Überschriften gefasst sein. Das ist aber nicht zwangsläufig so, auch eine Tabelle ohne Überschriften kann sinnvoll strukturiert sein.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_13_": "<p>Wenn aussagekräftige Überschriften vorhanden sind, sollte man auch prüfen, ob das, was in den zugeordneten Zellen steht, den Überschriften entspricht. Nichtssagende Überschriften können darauf hinweisen, dass die betreffende Zeile oder Spalte keine allgemein fassbare Bedeutung hat, also eher dem Layout dient.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_14_": "<p>Auch komplexe Tabellen sind aus einfachen Spalten und Zeilen zusammengesetzt, die Anforderungen sind soweit die selben. Hinzu kommt allerdings, dass benachbarte Zeilen oder Spalten durch übergreifende Überschriften zusammengefasst sind. Auch den Inhalt dieser zusammengefassten Bereiche muss man allgemein fassen können, wie den Inhalt der einzelnen Spalten und Zeilen.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_15_": "<h5 id=\"_wie_kann_man_ohne_screenreader_prüfen_ob_eine_datentabelle_richtig_aufgebaut_ist\">Wie kann man (ohne Screenreader) prüfen, ob eine Datentabelle richtig aufgebaut ist?</h5>",
  "_STEP_9_1_3_1E_HOW_CHECKED_16_": "<p>Man nimmt eine beliebige Zelle und liest sie zusammen mit den zugehörigen Spalten- und Zeilenüberschriften:</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_17_": "<p>\"[Überschrift(en) der Spalte] - [Überschrift(en) der Zeile]: [Inhalt der Zelle]\"</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_18_": "<p>Ist die Bedeutung der Zelle so verständlich?</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_19_": "<p>Gezielt untersucht werden sollen Auffälligkeiten: Ist irgendwo andersartiger Inhalt vorhanden, sind Zellen hervorgehoben?  Man prüft, ob auch in diesen Bereichen alle Zellen in gleicher Weise,  unabhängig von ihren Nachbarzellen, nur zusammen mit den beiden Überschriften benutzbar sind. Ist das der Fall, Dann ist die Tabelle richtig aufgebaut und (bei richtiger Auszeichnung) auch per Screenreader benutzbar.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_20_": "<h4 id=\"_2_3_prüfung_der_auszeichnung_von_nativen_tabellen\">2.3 Prüfung der Auszeichnung von nativen Tabellen:</h4>",
  "_STEP_9_1_3_1E_HOW_CHECKED_21_": "<ul><li><p>Seite im Chrome- oder Firefox-Browser laden.</p></li><li><p>Das <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#tablesbm\"> Tables bookmarklet</a> aufrufen. Tabellen-Auszeichnungen werden jetzt angezeigt.</p></li><li><p>Prüfen, ob alle Spalten- und Zeilenüberschriften korrekt mit <code>th</code> ausgezeichnet sind.</p></li><li><p>Das <code>summary</code>-Attribut ist in HTML5 für die Beschreibung von Tabellen nicht mehr erlaubt. Falls in HTML5-Dokumenten eine Beschreibung der Tabelle bereitgestellt wird, sollte diese auf anderem Wege umgesetzt werden, wie z. B. innerhalb von <code>caption</code>, mit Hilfe von <code>aria-describedby</code> oder <code>figure</code> und <code>figcaption</code>.</p></li></ul>",
  "_STEP_9_1_3_1E_HOW_CHECKED_22_": "<p>Die Mindestanforderung: Offenkundige, unverzichtbare und visuell hervorgehobene Überschriften müssen ausgezeichnet sein (siehe Hinweis <a href=\"#_3_2_woran_erkennt_man_zeilenüberschriften\">3.2 Woran erkennt man Zeilenüberschriften?</a>).</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_23_": "<h4 id=\"_2_4_prüfung_von_mit_aria_umgesetzten_tabellen\">2.4 Prüfung von mit ARIA umgesetzten Tabellen</h4>",
  "_STEP_9_1_3_1E_HOW_CHECKED_24_": "<ul><li><p>Prüfen, ob Inhalte, die sichtbar als Datentabelle umgesetzt sind, aber kein natives Tabellen-Markup nutzen, korrekt mit den entsprechenden ARIA-Rollen (<code>role=\"table\"</code>, <code>role=\"row\"</code>, <code>role =\"columnheader\"</code> und <code>role=\"rowheader\"</code>) ausgezeichnet sind. Vergleiche dazu das <a href=\"https://www.w3.org/WAI/ARIA/apg/patterns/table/\"> APG Table pattern</a>.</p></li></ul>",
  "_STEP_9_1_3_1E_HOW_CHECKED_25_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_9_1_3_1E_HOW_CHECKED_26_": "<h4 id=\"_3_1_auszeichnung_von_zweideutigen_zellen\">3.1 Auszeichnung von zweideutigen Zellen</h4>",
  "_STEP_9_1_3_1E_HOW_CHECKED_27_": "<p>Die Auszeichnung von Zellen, die zugleich Überschriften und Daten enthalten, mit <code>td</code> und dem <code>scope</code>-Attribut ist in HTML5 nicht mehr erlaubt.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_28_": "<h4 id=\"_3_2_woran_erkennt_man_zeilenüberschriften\">3.2 Woran erkennt man Zeilenüberschriften?</h4>",
  "_STEP_9_1_3_1E_HOW_CHECKED_29_": "<p>Die visuelle Hervorhebung ist ein Erkennungsmerkmal für Überschriften. Wenn die erste Spalte einer Datentabelle visuell hervorgehoben ist, dann kann man davon ausgehen, dass die Inhalte dieser Spalte als Überschriften dienen sollen.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_30_": "<p>Dieser Zusammenhang lässt sich aber nicht umkehren, die visuelle Hervorhebung ist als Kriterium nicht immer ausreichend. Denn auf die Hervorhebung der Zeilenüberschriften wird manchmal aus Gestaltungsgründen verzichtet. Sehende Nutzende brauchen sie nicht unbedingt. Wenn der Inhalt einer Datenzelle nicht für sich aussagekräftig ist, beziehen sie die Zellen am linken Rand der Tabelle ein, die Position reicht ihnen als Hervorhebung.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_31_": "<p>Es ist manchmal schwierig, den Fall, dass auf die visuelle Hervorhebung aus gestalterischen Gründen verzichtet worden ist, abzugrenzen von dem Fall, dass die Inhalte der ersten Spalte tatsächlich als Überschriften nicht geeignet sind. Selbst wenn in der ersten Spalte zum Beispiel Namen von Herstellern oder Produkten stehen, ist das noch kein sicherer Anhaltspunkt für die Eignung als Überschrift. Denn Überschriften sollten eindeutig und geläufig sein, Herstellernamen sind nicht immer eindeutig, Produktnamen oft nicht geläufig.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_32_": "<p>Entwicklerinnen und Entwickler sowie Teams in Web-Redaktionen sollten also überlegen, ob die Inhalte der ersten Spalte als Überschriften tauglich sind, ob es Sinn macht, dass ein Screenreader bei Zeilenwechseln immer den jeweiligen Inhalt der ersten Spalte zusammen mit der gerade angesteuerten Datenzelle vorliest. Wenn das der Fall ist, sollten die Zellen der ersten Spalte unbedingt als Überschriften ausgezeichnet werden.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_33_": "<p>Für die Prüfung gilt:</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_34_": "<p>Zellen, die keine Daten enthalten, also nur als Überschriften dienen <em>können</em>, müssen entsprechend ausgezeichnet werden (Beispiel dafür: in der Randspalte steht \"Länge\", Breite\", \"Gewicht\" und so weiter). <em>Muss</em> beim Zugriff auf Daten auf den Inhalt der Zeile oder Spalte Bezug genommen werden, ist es ohne Berücksichtigung der Randspalte nicht möglich, wenigstens einen Teil der unterschiedlichen Werte einer anderen Spalte zu interpretieren. Dann enthält die Randspalte Überschriften, sie muss entsprechend ausgezeichnet werden (Beispiel: im Wertebereich der Tabelle finden sich ausschließlich Preisangaben). Die Randspalte <em>kann</em> abweichend von der visuellen Darstellung als Überschrift ausgezeichnet werden, wenn es Sinn macht, beim Vergleich von Werten anderer Spalten auf sie Bezug zu nehmen (Beispiel: Tabelle mit Produkten, Anbieter und Modellbezeichnung sind als Überschriften ähnlich brauchbar). Ansonsten ist das Kriterium für die Auszeichnung aber <em>nur</em> die visuelle Hervorhebung. Zeilenüberschriften <em>müssen</em> ausgezeichnet sein, wenn sie visuell hervorgehoben sind. Auch wenn die Randspalte möglicherweise aus einem anderen Grund hervorgehoben ist und für die vergleichende Fassung mit den Daten in anderen Spalten eher nicht nützlich ist, soll die Auszeichnung nicht von der Darstellung auf dem Bildschirm abweichen. Gegebenenfalls muss in diesem Fall die Darstellung für den Bildschirm angepasst werden (Beispiel dafür: in der ersten Spalte einer Tabelle mit Produkten wird die Bestellnummer angezeigt).</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_35_": "<p>Auch bei Spaltenüberschriften kann auf die visuelle Hervorhebung verzichtet werden. Die vorstehenden Regeln sind dann in der gleichen Weise auf sie anzuwenden.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_36_": "<h4 id=\"_3_3_eingesparte_überschriften\">3.3 Eingesparte Überschriften</h4>",
  "_STEP_9_1_3_1E_HOW_CHECKED_37_": "<p>Überschriften sind überflüssig, wenn in den Zellen neben den Einzelwerten auch deren Bedeutung angegeben ist oder wenn die Bedeutung der Einzelwerte sich von selbst versteht. Ein typisches Beispiel dafür sind Preislisten: in der linken Spalte stehen die meist selbsterklärenden Produktbezeichnungen, in der rechten Spalte steht nicht nur der Betrag, sondern auch das Währungszeichen.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_38_": "<p>Für blinde und sehbehinderte Nutzende <em>kann</em> der Umgang mit solchen Tabellen schwierig sein. Denn mangels Überschriften müssen sie auf den Wertebereich zugreifen, um zu verstehen, was die Tabelle anbietet. Für normal sehende Nutzende ist das leicht, für Nutzende, die sich immer nur einen kleinen Ausschnitt der Tabelle vorlesen oder anzeigen lassen können, aber nicht.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_39_": "<p>Unproblematisch ist der Verzicht auf Überschriften, wenn zwei Bedingungen erfüllt sind:</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_40_": "<ul><li><p>Der Aufbau der Tabelle ist der ersten Zeile zu entnehmen.</p></li><li><p>Die Tabelle listet Daten auf, die zusammen gehören und eine feste Reihenfolge haben. Sie wird also normalerweise linear genutzt, wie ein Buch.</p></li></ul>",
  "_STEP_9_1_3_1E_HOW_CHECKED_41_": "<p>Tabellen mit eingesparten Überschriften erfüllen also den Prüfschritt, wenn sie richtig aufgebaut und linear nutzbar sind.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_42_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_9_1_3_1E_HOW_CHECKED_43_": "<h4 id=\"_nicht_voll_erfüllt\">Nicht voll erfüllt</h4>",
  "_STEP_9_1_3_1E_HOW_CHECKED_44_": "<ul><li><p>Für tabellarische Daten wird nicht <code>table</code> (oder <code>role=\"table\"</code>) verwendet, sondern lediglich positionierte <code>div</code>-, <code>span</code>- oder <code>p</code>-Elemente.</p></li><li><p>Spalten- und Zeilenüberschriften sind nicht korrekt mit <code>th</code> (oder entsprechenden ARIA-Rollen) ausgezeichnet.</p></li></ul>",
  "_STEP_9_1_3_1E_SOURCES_1_": "<ul><li><p>W3C Web Accessibility Initiative: <a href=\"https://www.w3.org/WAI/tutorials/tables/\">Tables Tutorial</a></p></li><li><p>ARIA Authoring Practices Guide (APG): <a href=\"https://www.w3.org/WAI/ARIA/apg/patterns/table/\"> Table pattern</a> (W3C)</p></li><li><p><a href=\"https://codepen.io/Wildebrew/pen/gBKdVb\">Synthetic tables built with ARIA</a> (Birkir Gunnarsson, codepen). Beispiel einer mittels ARIA semantisch korrekt umgesetzten Tabelle.</p></li><li><p><a href=\"https://adrianroselli.com/2017/11/a-responsive-accessible-table.html\">A Responsive Accessible Table</a> (Adrian Roselli, 2017)</p></li><li><p><a href=\"https://adrianroselli.com/2019/09/table-with-expando-rows.html\">Table with Expando Rows</a>. (Adrian Roselli, 2019). The article offers an implementation solution for a common pattern where rows are hidden until the user opts to show them.</p></li></ul>",
  "_STEP_9_1_3_1E_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_1_3_1E_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Guideline</h4>",
  "_STEP_9_1_3_1E_CLASSIFICATION_3_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/quickref/?showtechniques=131#adaptable\"> Guideline 1.3 Adaptable: Create content that can be presented in different ways (for example simpler layout) without losing information or structure</a></p></li></ul>",
  "_STEP_9_1_3_1E_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Success criterion</h4>",
  "_STEP_9_1_3_1E_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/quickref/?showtechniques=131#info-and-relationships\"> 1.3.1 Info and Relationships</a> (Level A)</p></li></ul>",
  "_STEP_9_1_3_1E_CLASSIFICATION_6_": "<h4 id=\"_techniques\">Techniques</h4>",
  "_STEP_9_1_3_1E_CLASSIFICATION_7_": "<h5 id=\"_general_techniques\">General Techniques</h5>",
  "_STEP_9_1_3_1E_CLASSIFICATION_8_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G115.html\"> G115: Using semantic elements to mark up structure</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G140.html\"> G140: Separating information and structure from presentation to enable different presentations</a></p></li></ul>",
  "_STEP_9_1_3_1E_CLASSIFICATION_9_": "<h5 id=\"_html_techniques\">HTML Techniques</h5>",
  "_STEP_9_1_3_1E_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H51.html\"> H51: Using table markup to present tabular information</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H73.html\"> H73: Using the summary attribute of the table element to give an overview of data tables</a></p></li></ul>",
  "_STEP_9_1_3_1E_CLASSIFICATION_11_": "<h5 id=\"_failures\">Failures</h5>",
  "_STEP_9_1_3_1E_CLASSIFICATION_12_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F33.html\"> F33: Failure of Success Criterion 1.3.1 and 1.3.2 due to using white space characters to create multiple columns in plain text content</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F34.html\"> F34: Failure of Success Criterion 1.3.1 and 1.3.2 due to using white space characters to format tables in plain text content</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F48.html\"> F48: Failure of Success Criterion 1.3.1 due to using the pre element to markup tabular information</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F91.html\"> F91: Failure of Success Criterion 1.3.1 for not correctly marking up table headers</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F92.html\"> F92: Failure of Success Criterion 1.3.1 due to the use of role presentation on content which conveys semantic information</a></p></li></ul>",
  "_STEP_9_1_3_1E_QUESTIONS_1_": "<h3 id=\"_warum_müssen_die_tabellenheader_extra_ausgezeichnet_werden\">Warum müssen die Tabellenheader extra ausgezeichnet werden?</h3>",
  "_STEP_9_1_3_1E_QUESTIONS_2_": "<p>Kann der Screenreader nicht einfach automatisch die erste Zeile und die linke Spalte als Überschriften behandeln? Wird das nicht auch faktisch so gemacht?</p>",
  "_STEP_9_1_3_1E_QUESTIONS_3_": "<p>Beides ist richtig: Screenreader <em>brauchen</em> die Auszeichnung nicht zwingend, um Spalten- und Zeilenüberschriften vorzulesen - und gängige Screenreader verhalten sich auch genau so: Wenn der Benutzer in eine andere Spalte wechselt, liest zum Beispiel der Screenreader Jaws den Text vor, der in der obersten Zelle dieser Spalte steht, auch wenn diese Zelle nicht als <code>th</code>-Element ausgezeichnet ist. Ebenso beim Wechsel in eine andere Zeile: Der Inhalt der ersten Zelle wird unabhängig von der Auszeichnung immer vorgelesen (zumindest dann, wenn Datenzellen nicht ausdrücklich via <code>&gt;headers</code> und <code>id</code> mit bestimmten Überschriftenzellen verknüpft sind).</p>",
  "_STEP_9_1_3_1E_QUESTIONS_4_": "<p>Warum ist das so?</p>",
  "_STEP_9_1_3_1E_QUESTIONS_5_": "<p>Das beschriebene Verhalten der Screenreader ist bei <em>einfachen</em> Tabellen meistens richtig. Und es gibt natürlich im Web sehr viele Tabellen, bei denen die Überschriften nicht ausgezeichnet sind. Insgesamt werden Nutzende daher am besten bedient, wenn der Screenreader die Zellen der ersten Zeile und der ersten Spalte grundsätzlich wie Überschriftenzellen behandelt.</p>",
  "_STEP_9_1_3_1E_QUESTIONS_6_": "<p>Was folgt daraus?</p>",
  "_STEP_9_1_3_1E_QUESTIONS_7_": "<p>Kann man sich bei einfachen Tabellen den Aufwand für die Auszeichnung von Tabellenüberschriften dann nicht sparen?</p>",
  "_STEP_9_1_3_1E_QUESTIONS_8_": "<p>Zunächst mal: Der Aufwand für die Auszeichnung der Zellen ist in der Regel nicht erheblich. Jedenfalls bei einfachen Tabellen: Es gibt entsprechende Vorlagen oder das CMS kümmert sich darum. Die eigentliche Herausforderung liegt woanders: Man muss dafür sorgen, dass die Tabellen <em>einfach sind</em>, dass die Inhalte der ersten Zeile und Spalte tatsächlich als Überschriften funktionieren und dass alle strukturierenden Inhalte dort untergebracht sind.</p>",
  "_STEP_9_1_3_1E_QUESTIONS_9_": "<p>Und klar ist: nicht jedes Hilfsmittel muß in der beschriebenen Art und Weise mit Tabellen umgehen. Der IBM Homepagereader liest nur ausgezeichnete Überschriften vor, wie künftige Jaws-Versionen funktionieren, kann auch niemand sagen.</p>",
  "_STEP_9_1_3_1E_QUESTIONS_10_": "<p>Oder allgemein gesagt: Die praktische Nutzbarkeit mit gängigen Screenreadern oder Browsern kann nicht der alleinige Maßstab für Barrierefreiheit und BITV-Konformität sein. Denn dann würde es immer bei dem unbefriedigenden Zustand bleiben, dass Screenreader versuchen müssen, aus barrierebehafteten Webangeboten irgend etwas brauchbares herauszuholen. Auf längere Sicht ist es auch wichtig, dass sich Verantwortliche Personen von Webangeboten und Entwicklende von Screenreadern oder Browsern an gemeinsame Standards halten.</p>",
  "_STEP_9_1_3_1E_QUESTIONS_11_": "<h3 id=\"_der_aufbau_von_datentabellen_kann_unter_umständen_nicht_einfach_verändert_werden_wie_kann_die_barrierefreiheit_trotzdem_sichergestellt_werden\">Der Aufbau von Datentabellen kann unter Umständen nicht einfach verändert werden, wie kann die Barrierefreiheit trotzdem sichergestellt werden?</h3>",
  "_STEP_9_1_3_1E_QUESTIONS_12_": "<p>Zwei Fälle sind da zu unterscheiden:</p>",
  "_STEP_9_1_3_1E_QUESTIONS_13_": "<p>Der Aufbau der Tabelle gehört zum Inhalt. Das Dokument ist zum Beispiel historisch, es zeigt, wie die alten Ägypter ihre Erntedaten tabellarisch geordnet haben. In diesem Fall muss geklärt werden, ob die Tabelle nur betrachtet oder auch genutzt werden soll. Wenn sie nur betrachtet werden soll, ist der lineare Zugriff ausreichend. Wenn sie auch genutzt werden soll, wenn sie also zum Beispiel <em>auch</em> über fette und magere Erntejahre Auskunft geben soll, ist die historische Form ungeeignet. Ein anderes Dokument muss dafür erstellt werden. Der häufigere und wichtigere Fall: eine andere Abteilung liefert die mangelhaft aufgebauten Tabellen, in der EDV sollen sie durch unsichtbare Zusätze nachträglich barrierefrei gemacht werden. In diesem Fall muss der Ablauf geändert werden, denn die mangelhafte Struktur kann nicht durch Auszeichnungen repariert werden, die Aufgabe ist nicht erfüllbar. Die Verantwortlichen müssen dafür sorgen, dass die Anforderungen der Barrierefreiheit an der richtigen Stelle, also schon bei der Erstellung der Tabellen beachtet werden.</p>"
}
