{
  "_STEP_9_1_3_1E_NAME_": "Правильная структура таблиц данных",
  "_STEP_9_1_3_1E_NAME_MENU_": "9.1.3.1e Правильная структура таблиц данных",
  "_STEP_9_1_3_1E_WHAT_CHECKED_1_": "<p>Таблицы данных правильно структурированы, заголовки строк и столбцов обозначены с помощью <code>th</code> или соответствующих ролей ARIA.</p>",
  "_STEP_9_1_3_1E_WHY_CHECKED_1_": "<p>Люди, ориентирующиеся на визуальное восприятие, используют заголовки и, при необходимости, значения для навигации по таблице данных. Поэтому им относительно легко распознать структурные недостатки, например, изменения в значении строк или столбцов, и справляться с ними.</p>",
  "_STEP_9_1_3_1E_WHY_CHECKED_2_": "<p>Люди с нарушениями зрения, включая слепых, аналитически воспринимают данные из таблиц. Они формируют представление о структуре таблицы, исходя из заголовков и другой доступной контекстной информации. Это представление служит основой для доступа к данным.</p>",
  "_STEP_9_1_3_1E_WHY_CHECKED_3_": "<p>Для эффективной работы необходимо выполнение двух условий:</p>",
  "_STEP_9_1_3_1E_WHY_CHECKED_4_": "<ul><li><p>Таблица должна иметь чёткую структуру, значение строк и столбцов должно быть ясным и легко извлекаемым из заголовков или вспомогательной контекстной информации. Заголовки должны быть легко обнаружимы, и должно быть ясно, к каким данным они относятся.</p></li><li><p>Чёткая структура является основой доступности таблиц данных. Некорректно структурированную таблицу невозможно сделать доступной путём специальной разметки. Однако на основе чёткой и понятной структуры правильная разметка становится полезной и важной.</p></li></ul>",
  "_STEP_9_1_3_1E_WHY_CHECKED_5_": "<p>Возможные применения разметки заголовков таблиц:</p>",
  "_STEP_9_1_3_1E_WHY_CHECKED_6_": "<ul><li><p>Скринридер информирует о позиции и количестве рядов заголовков.</p></li><li><p>Скринридер читает (новые) заголовки строк или столбцов, когда пользователь переключается между строками или столбцами таблицы.</p></li><li><p>Заголовки выделяются в форме, которая лучше подходит пользователям.</p></li></ul>",
  "_STEP_9_1_3_1E_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость шага проверки</h3>",
  "_STEP_9_1_3_1E_HOW_CHECKED_2_": "<p>Этот шаг проверки всегда применим, когда на странице присутствуют стандартные таблицы или таблицы с обозначениями ролей ARIA. Он также применим, когда содержание визуально организовано в виде таблицы данных.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_1_3_1E_HOW_CHECKED_4_": "<h4 id=\"_2_1_tabellen_für_tabellarische_daten_verwendet\">2.1 Использование таблиц для табличных данных?</h4>",
  "_STEP_9_1_3_1E_HOW_CHECKED_5_": "<ul><li><p>Проверить, используются ли для табличных данных элемент <code>table</code> или соответствующие ARIA-роли, такие как <code>role=\"table\"</code>, <code>role=\"row\"</code>, <code>role=\"columnheader\"</code> и <code>role=\"rowheader\"</code>.</p></li></ul>",
  "_STEP_9_1_3_1E_HOW_CHECKED_6_": "<h4 id=\"_2_2_prüfung_des_aufbaus_von_tabellen\">2.2 Проверка структуры таблиц:</h4>",
  "_STEP_9_1_3_1E_HOW_CHECKED_7_": "<p>Проверить, корректно ли структурирована таблица или её ARIA-структура. Проблемы часто возникают из-за того, что таблицы также служат целям макетирования, то есть решетка таблицы используется для размещения контента на экране.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_8_": "<p>К примеру, проблематичными могут быть:</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_9_": "<ul><li><p>Столбец с данными размещен перед столбцом заголовков</p></li><li><p>Изменение значения строк или столбцов (\"с этого момента …\")</p></li><li><p>Ячейки с пояснениями интегрированы в таблицу</p></li><li><p>Вставка пустых строк для задания высоты или расстояния между строками</p></li><li><p>Вложенности (другая таблица внутри ячейки таблицы)</p></li></ul>",
  "_STEP_9_1_3_1E_HOW_CHECKED_10_": "<h5 id=\"_woran_erkennt_man_dass_eine_datentabelle_sinnvoll_aufgebaut_ist\">Как определить, что таблица данных построена разумно?</h5>",
  "_STEP_9_1_3_1E_HOW_CHECKED_11_": "<p>В разумно построенной таблице можно указать, какая информация содержится в каждом столбце и строке. Этот контент можно обобщить, не сводя его только к совокупности значений в отдельных ячейках.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_12_": "<p>Значение каждой строки и столбца может быть указано в заголовках. Однако это не обязательно, таблица без заголовков также может быть структурирована разумно.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_13_": "<p>Если присутствуют значимые заголовки, следует также проверить, соответствует ли содержимое соответствующих ячеек этим заголовкам. Невыразительные заголовки могут указывать на то, что соответствующая строка или столбец не имеет общепринятого значения и, скорее всего, служит для макетирования.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_14_": "<p>Даже сложные таблицы состоят из простых столбцов и строк, требования к ним примерно одинаковы. Однако к этому добавляется, что смежные строки или столбцы сгруппированы общими заголовками. Содержание этих сгруппированных областей также должно быть обобщаемым, как и содержание отдельных столбцов и строк.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_15_": "<h5 id=\"_wie_kann_man_ohne_screenreader_prüfen_ob_eine_datentabelle_richtig_aufgebaut_ist\">Как проверить правильность построения таблицы данных (без использования скринридера)?</h5>",
  "_STEP_9_1_3_1E_HOW_CHECKED_16_": "<p>Выберите любую ячейку и прочтите её вместе с соответствующими заголовками столбцов и строк:</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_17_": "<p>\"[Заголовок(и) столбца] - [Заголовок(и) строки]: [Содержимое ячейки]\"</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_18_": "<p>Понятно ли значение ячейки в таком формате?</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_19_": "<p>Особое внимание следует уделить аномалиям: есть ли где-то необычное содержимое, выделены ли какие-то ячейки? Проверьте, доступны ли все ячейки в этих областях одинаково, независимо от соседних ячеек, только вместе с двумя заголовками. Если это так, таблица построена правильно и (при правильной разметке) доступна через скринридер.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_20_": "<h4 id=\"_2_3_prüfung_der_auszeichnung_von_nativen_tabellen\">2.3 Проверка разметки нативных таблиц:</h4>",
  "_STEP_9_1_3_1E_HOW_CHECKED_21_": "<ul><li><p>Загрузите страницу в браузере Chrome или Firefox.</p></li><li><p>Вызовите <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#tablesbm\"> Tables bookmarklet</a>. Теперь отображаются разметки таблиц.</p></li><li><p>Проверьте, правильно ли обозначены все заголовки строк и столбцов с помощью <code>th</code>.</p></li><li><p>Атрибут <code>summary</code> в HTML5 больше не разрешён для описания таблиц. Если в документах HTML5 предоставляется описание таблицы, оно должно быть реализовано другим способом, например, внутри <code>caption</code>, с помощью <code>aria-describedby</code> или <code>figure</code> и <code>figcaption</code>.</p></li></ul>",
  "_STEP_9_1_3_1E_HOW_CHECKED_22_": "<p>Минимальные требования: явные, необходимые и визуально выделенные заголовки должны быть правильно обозначены (см. замечание <a href=\"#_3_2_woran_erkennt_man_zeilenüberschriften\">3.2 Как распознать заголовки строк</a>).</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_23_": "<h4 id=\"_2_4_prüfung_von_mit_aria_umgesetzten_tabellen\">2.4 Проверка таблиц, реализованных с ARIA</h4>",
  "_STEP_9_1_3_1E_HOW_CHECKED_24_": "<ul><li><p>Проверьте, правильно ли обозначены с помощью соответствующих ARIA-ролей контенты, визуально реализованные как таблицы данных, но не использующие нативную разметку таблиц. Сравните это с <a href=\"https://www.w3.org/WAI/ARIA/apg/patterns/table/\"> APG Table pattern</a>.</p></li></ul>",
  "_STEP_9_1_3_1E_HOW_CHECKED_25_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_9_1_3_1E_HOW_CHECKED_26_": "<h4 id=\"_3_1_auszeichnung_von_zweideutigen_zellen\">3.1 Разметка двусмысленных ячеек</h4>",
  "_STEP_9_1_3_1E_HOW_CHECKED_27_": "<p>Разметка ячеек, которые одновременно являются заголовками и содержат данные, с помощью <code>td</code> и атрибута <code>scope</code> в HTML5 больше не разрешена.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_28_": "<h4 id=\"_3_2_woran_erkennt_man_zeilenüberschriften\">3.2 Как распознать заголовки строк?</h4>",
  "_STEP_9_1_3_1E_HOW_CHECKED_29_": "<p>Визуальное выделение является признаком заголовков. Если первый столбец таблицы данных визуально выделен, то можно предположить, что содержимое этого столбца должно служить заголовками.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_30_": "<p>Однако эту связь нельзя перевернуть, визуальное выделение как критерий не всегда достаточно. Иногда от выделения заголовков строк отказываются по дизайнерским причинам. Зрячим пользователям они не всегда нужны. Если содержимое ячейки данных само по себе неинформативно, они включают в расчёт ячейки вдоль левого края таблицы, положение которых служит им выделением.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_31_": "<p>Иногда бывает сложно разграничить случаи, когда отказ от визуального выделения происходит по дизайнерским причинам, от случаев, когда содержимое первого столбца на самом деле не подходит для использования в качестве заголовков. Даже если в первом столбце, например, указаны названия производителей или продуктов, это еще не является надежным признаком пригодности для заголовка. Ведь заголовки должны быть однозначными и распространенными, а названия производителей не всегда однозначны, а названия продуктов часто не распространены.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_32_": "<p>Разработчики и команды веб-редакторов должны рассмотреть, подходят ли содержимое первого столбца в качестве заголовков, имеет ли смысл, чтобы скринридер всегда зачитывал содержимое первого столбца вместе с текущей выбранной ячейкой данных при переходе по строкам. Если это так, ячейки первого столбца обязательно должны быть выделены как заголовки.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_33_": "<p>Критерии проверки:</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_34_": "<p>Ячейки, которые не содержат данных, а служат только в качестве заголовков <em>могут</em> быть соответственно обозначены (например, в крайней колонке указаны \"Длина\", \"Ширина\", \"Вес\" и т.д.). <em>Должны</em> при анализе данных быть учтены содержимое строки или столбца, без учета крайней колонки невозможно интерпретировать хотя бы часть различных значений другого столбца. Тогда крайний столбец содержит заголовки, и он должен быть соответственно обозначен (пример: в области значений таблицы находятся исключительно ценовые предложения). Крайний столбец <em>может</em> отличаться от визуального представления и обозначаться как заголовок, если это имеет смысл при сравнении значений других столбцов (пример: таблица с продуктами, поставщики и модели подобно заголовкам являются полезными). В противном случае критерий для обозначения <em>только</em> визуальное выделение. Заголовки строк <em>должны</em> быть выделены, если они визуально выделены. Даже если крайний столбец выделен по другой причине и не полезен для сравнения с данными в других столбцах, обозначение не должно отличаться от отображения на экране. При необходимости в этом случае следует адаптировать отображение для экрана (пример: в первом столбце таблицы с продуктами отображается заказной номер).</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_35_": "<p>Также для заголовков столбцов можно отказаться от визуального выделения. Приведенные правила применимы к ним в той же мере.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_36_": "<h4 id=\"_3_3_eingesparte_überschriften\">3.3 Исключенные заголовки</h4>",
  "_STEP_9_1_3_1E_HOW_CHECKED_37_": "<p>Заголовки избыточны, если в ячейках указаны не только отдельные значения, но и их значение, или если значение отдельных значений очевидно. Типичным примером являются прайс-листы: в левом столбце обычно находятся самоописательные наименования продуктов, а в правом столбце указаны не только суммы, но и символы валют.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_38_": "<p>Для слепых и слабовидящих пользователей обращение с такими таблицами может быть сложным. Так как в отсутствие заголовков они должны обращаться к диапазону значений, чтобы понять, что предлагает таблица. Для зрячих пользователей это легко, но не для тех, кто может видеть или слышать только маленький фрагмент таблицы.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_39_": "<p>Отказ от заголовков не проблематичен, если выполнены два условия:</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_40_": "<ul><li><p>Структура таблицы определяется первой строкой.</p></li><li><p>Таблица перечисляет данные, которые связаны между собой и имеют фиксированный порядок. Обычно она используется линейно, как книга.</p></li></ul>",
  "_STEP_9_1_3_1E_HOW_CHECKED_41_": "<p>Таблицы с исключенными заголовками, таким образом, соответствуют критериям проверки, если они правильно построены и линейно используемы.</p>",
  "_STEP_9_1_3_1E_HOW_CHECKED_42_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_1_3_1E_HOW_CHECKED_43_": "<h4 id=\"_nicht_voll_erfüllt\">Не полностью выполнено</h4>",
  "_STEP_9_1_3_1E_HOW_CHECKED_44_": "<ul><li><p>Для табличных данных не используется <code>table</code> (или <code>role=\"table\"</code>), а только позиционированные элементы <code>div</code>, <code>span</code> или <code>p</code>.</p></li><li><p>Заголовки столбцов и строк не обозначены корректно с помощью <code>th</code> (или соответствующих ARIA-ролей).</p></li></ul>",
  "_STEP_9_1_3_1E_SOURCES_1_": "<ul><li><p>Инициатива по доступности веба W3C: <a href=\"https://www.w3.org/WAI/tutorials/tables/\">Учебник по таблицам</a></p></li><li><p>Руководство по авторской практике ARIA (APG): <a href=\"https://www.w3.org/WAI/ARIA/apg/patterns/table/\">Шаблон таблицы</a> (W3C)</p></li><li><p><a href=\"https://codepen.io/Wildebrew/pen/gBKdVb\">Синтетические таблицы, созданные с помощью ARIA</a> (Биркир Гуннарссон, Codepen). Пример таблицы, корректно реализованной с использованием ARIA.</p></li><li><p><a href=\"https://adrianroselli.com/2017/11/a-responsive-accessible-table.html\">Отзывчивая доступная таблица</a> (Адриан Розелли, 2017)</p></li><li><p><a href=\"https://adrianroselli.com/2019/09/table-with-expando-rows.html\">Таблица с расширяемыми строками</a>. (Адриан Розелли, 2019). Статья предлагает решение для распространенного шаблона, при котором строки скрыты до тех пор, пока пользователь не решит их показать.</p></li></ul>",
  "_STEP_9_1_3_1E_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация шага проверки по WCAG 2.1</h3>",
  "_STEP_9_1_3_1E_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Руководящий принцип</h4>",
  "_STEP_9_1_3_1E_CLASSIFICATION_3_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/quickref/?showtechniques=131#adaptable\">Руководство 1.3 Адаптируемость: Создание контента, который может быть представлен различными способами (например, в более простой компоновке) без потери информации или структуры</a></p></li></ul>",
  "_STEP_9_1_3_1E_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Критерий успеха</h4>",
  "_STEP_9_1_3_1E_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/quickref/?showtechniques=131#info-and-relationships\">1.3.1 Информация и отношения</a> (Уровень A)</p></li></ul>",
  "_STEP_9_1_3_1E_CLASSIFICATION_6_": "<h4 id=\"_techniques\">Техники</h4>",
  "_STEP_9_1_3_1E_CLASSIFICATION_7_": "<h5 id=\"_general_techniques\">Общие техники</h5>",
  "_STEP_9_1_3_1E_CLASSIFICATION_8_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G115.html\">G115: Использование семантических элементов для разметки структуры</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G140.html\">G140: Разделение информации и структуры от презентации для обеспечения различных презентаций</a></p></li></ul>",
  "_STEP_9_1_3_1E_CLASSIFICATION_9_": "<h5 id=\"_html_techniques\">Техники HTML</h5>",
  "_STEP_9_1_3_1E_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H51.html\">H51: Использование разметки таблицы для представления табличной информации</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H73.html\">H73: Использование атрибута summary элемента table для обзора данных таблиц</a></p></li></ul>",
  "_STEP_9_1_3_1E_CLASSIFICATION_11_": "<h5 id=\"_failures\">Ошибки</h5>",
  "_STEP_9_1_3_1E_CLASSIFICATION_12_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F33.html\">F33: Ошибка Критерия успеха 1.3.1 и 1.3.2 из-за использования пробельных символов для создания множественных колонок в простом текстовом содержимом</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F34.html\">F34: Ошибка Критерия успеха 1.3.1 и 1.3.2 из-за использования пробельных символов для форматирования таблиц в простом текстовом содержимом</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F48.html\">F48: Ошибка Критерия успеха 1.3.1 из-за использования элемента pre для разметки табличной информации</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F91.html\">F91: Ошибка Критерия успеха 1.3.1 за неправильное размещение заголовков таблиц</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F92.html\">F92: Ошибка Критерия успеха 1.3.1 из-за использования роли presentation на содержимом, которое передает семантическую информацию</a></p></li></ul>",
  "_STEP_9_1_3_1E_QUESTIONS_1_": "<h3 id=\"_warum_müssen_die_tabellenheader_extra_ausgezeichnet_werden\">Почему заголовки таблиц должны быть отмечены отдельно?</h3>",
  "_STEP_9_1_3_1E_QUESTIONS_2_": "<p>Не может ли скринридер просто автоматически обрабатывать первую строку и левый столбец как заголовки? Разве это не делается на практике?</p>",
  "_STEP_9_1_3_1E_QUESTIONS_3_": "<p>Оба утверждения верны: скринридерам <em>не обязательно</em> нужна разметка для чтения заголовков столбцов и строк — и популярные скринридеры ведут себя именно так: например, когда пользователь переключается на другой столбец, скринридер Jaws читает текст из верхней ячейки этого столбца, даже если эта ячейка не помечена как <code>th</code>. То же самое при переходе на другую строку: содержимое первой ячейки всегда читается, независимо от разметки (если только ячейки данных явно не связаны через <code>&gt;headers</code> и <code>id</code> с определенными ячейками заголовков).</p>",
  "_STEP_9_1_3_1E_QUESTIONS_4_": "<p>Почему это так?</p>",
  "_STEP_9_1_3_1E_QUESTIONS_5_": "<p>Описанное поведение скринридеров обычно корректно для <em>простых</em> таблиц. И, конечно, в Интернете много таблиц, где заголовки не выделены. В целом, пользователи лучше всего обслуживаются, когда скринридер обрабатывает ячейки первой строки и первого столбца в основном как ячейки заголовков.</p>",
  "_STEP_9_1_3_1E_QUESTIONS_6_": "<p>Что из этого следует?</p>",
  "_STEP_9_1_3_1E_QUESTIONS_7_": "<p>Можно ли тогда не заботиться о разметке заголовков таблиц в простых таблицах?</p>",
  "_STEP_9_1_3_1E_QUESTIONS_8_": "<p>Прежде всего: усилия по разметке ячеек обычно невелики, особенно для простых таблиц: существуют соответствующие шаблоны, или CMS об этом заботится. Настоящая проблема заключается в другом: нужно убедиться, что таблицы <em>просты</em>, что содержимое первой строки и первого столбца действительно функционирует как заголовки, и что все структурирующие элементы размещены там.</p>",
  "_STEP_9_1_3_1E_QUESTIONS_9_": "<p>И, конечно, не каждое средство должно обращаться с таблицами описанным образом. IBM Homepagereader читает только выделенные заголовки, и никто не может сказать, как будут работать будущие версии Jaws.</p>",
  "_STEP_9_1_3_1E_QUESTIONS_10_": "<p>Или, говоря общими словами: практическая работоспособность с распространенными скринридерами или браузерами не может быть единственным критерием для доступности и соответствия BITV. В противном случае всегда останется недовольство от того, что скринридеры должны пытаться извлечь что-то полезное из недоступных веб-предложений. В долгосрочной перспективе важно, чтобы ответственные лица веб-предложений и разработчики скринридеров или браузеров придерживались общих стандартов.</p>",
  "_STEP_9_1_3_1E_QUESTIONS_11_": "<h3 id=\"_der_aufbau_von_datentabellen_kann_unter_umständen_nicht_einfach_verändert_werden_wie_kann_die_barrierefreiheit_trotzdem_sichergestellt_werden\">Как обеспечить доступность, если структуру таблицы нельзя легко изменить?</h3>",
  "_STEP_9_1_3_1E_QUESTIONS_12_": "<p>Следует различать два случая:</p>",
  "_STEP_9_1_3_1E_QUESTIONS_13_": "<p>Структура таблицы является частью содержимого. Например, документ исторический, он показывает, как древние египтяне организовывали свои данные о урожае в виде таблиц. В этом случае нужно решить, предназначена ли таблица только для просмотра или также для использования. Если таблица предназначена только для просмотра, то достаточно линейного доступа. Если она должна также использоваться, например, для получения информации о жирных и тощих годах урожая, то историческая форма не подходит. Должен быть создан другой документ. Более частый и важный случай: другое отделение предоставляет плохо построенные таблицы, в ИТ их должны сделать доступными с помощью невидимых добавлений. В этом случае процесс должен быть изменен, потому что плохую структуру нельзя исправить с помощью разметки, задача невыполнима. Ответственные лица должны обеспечить соблюдение требований доступности уже на этапе создания таблиц.</p>"
}