{
  "_STEP_11_7_NAME_": "Benutzerdefinierte Einstellungen",
  "_STEP_11_7_WHAT_CHECKED_1_": "<p>Die Seite soll benutzerdefinierte Browsereinstellungen berücksichtigen. Im Einzelnen können dies folgende Punkte sein:</p>",
  "_STEP_11_7_WHAT_CHECKED_2_": "<ul><li><p>Geänderte Vorder- und Hintergrundfarben</p></li><li><p>Schriftarten</p></li><li><p>Schriftgrößen</p></li><li><p>Darstellung des Fokuscursors</p></li><li><p>Maßeinheiten</p></li></ul>",
  "_STEP_11_7_WHAT_CHECKED_3_": "<p>Die Seite kann darüber hinaus eigene Werte für diese Einstellungen anbieten. Wenn diese Einstellungen nicht genutzt werden, sollen die Browsereinstellungen übernommen werden. In manchen Fällen muss die Seite neu geladen werden, damit sich die Änderungen auswirken.</p>",
  "_STEP_11_7_WHY_CHECKED_1_": "<p>Wenn Menschen eigene Einstellungen im Browser vornehmen, zum Beispiel weil sie größere Schrift oder eigene angepasste Farbeinstellungen brauchen, sollen diese vom Webangebot wo immer möglich respektiert und übernommen werden.</p>",
  "_STEP_11_7_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_11_7_HOW_CHECKED_2_": "<p>Der Prüfschritt ist immer anwendbar.</p>",
  "_STEP_11_7_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_11_7_HOW_CHECKED_4_": "<ol><li><p>Die Seite im Firefox Browser laden</p></li><li><p>Einstellungen öffnen (Element Menü öffnen &gt; Einstellungen)</p><ul><li><p>Im Bereich \"Sprache und Erscheinungsbild\" die Schriftgröße auf einen deutlich höheren Wert als den Standard-Wert setzen (z.B. 24). In den Einstellungen \"Erweitert…​\" sollte für Mindestschriftgröße \"Keine\" ausgewählt sein.</p></li><li><p>Über den Button \"Erweitert…\" für die Schriftarten \"Serif\", \"Sans Serif\" und \"Feste Breite\" deutlich abweichende Schrifttypen (Fonts) einstellen und bei der Checkbox \"Seiten das Verwenden von eigenen statt der oben gewählten Schriftarten erlauben\" den Haken entfernen.</p></li><li><p>Den Button \"Farben…\" wählen, veränderte Text- und Hintergrundfarbe mit großem Kontrastabstand einstellen.</p></li><li><p>Die Checkbox \"Systemfarben verwenden\" deaktivieren.</p></li><li><p>Bei der Auswahlliste \"Oben ausgewählte Farben anstatt der Farben der Seite verwenden\" den Wert \"Immer\" auswählen.</p></li><li><p>Mit \"OK\" bestätigen.</p></li></ul></li><li><p>Prüfen, ob sich Einstellungen der Schrifttype, Schriftgröße und Vorder- bzw. Hintergrund-Farben auf die Darstellung der Seite auswirken und übernommen werden.</p></li><li><p>Prüfen, ob alle wichtigen Bedienelemente und deren Zustände (z.B. \"Hamburger\"-Schaltfläche und Zustände von Formularelementen wie Auswahlschalter und Kontrollkästchen) bei geänderten Vorder- und Hintergrund-Farben noch sichtbar sind.</p></li></ol>",
  "_STEP_11_7_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_11_7_HOW_CHECKED_6_": "<h4 id=\"_3_1_einzusetzender_browser_für_die_prüfung\">3.1. Einzusetzender Browser für die Prüfung</h4>",
  "_STEP_11_7_HOW_CHECKED_7_": "<p>Zur Prüfung sollte wenn möglich der Firefox-Browser genutzt werden, der diese Einstellungsmöglichkeiten bietet. In anderen Browsern sind ggf. nicht alle diese Einstellungen zu finden, oder sie sind unwirksam.</p>",
  "_STEP_11_7_HOW_CHECKED_8_": "<p>Wenn zur Prüfung andere Browser genutzt werden und sich die Darstellung trotz geänderter Voreinstellungen nicht ändert, kann dies am Browser oder auch an Vorgaben der Web-Anwendung liegen.</p>",
  "_STEP_11_7_HOW_CHECKED_9_": "<h4 id=\"_3_2_hinweis_zur_prüfung_mit_firefox\">3.2 Hinweis zur Prüfung mit Firefox</h4>",
  "_STEP_11_7_HOW_CHECKED_10_": "<p>Der Firefox-Browser übernimmt für <code>button</code>-Elemente die vom Nutzer gewählte Hintergrundfarbe nicht bzw. setzt eine eigene Farbe. Dies darf nicht als Fehler bewertet werden.</p>",
  "_STEP_11_7_HOW_CHECKED_11_": "<p>Für die Praxis fehlen noch Hinweise. Sie können auf GitHub <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">ein Issue zu diesem Prüfschritt erstellen</a>, um bei der Entwicklung der Prüfung mitzuwirken.</p>",
  "_STEP_11_7_HOW_CHECKED_12_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_11_7_HOW_CHECKED_13_": "<h4 id=\"_erfüllt\">Erfüllt</h4>",
  "_STEP_11_7_HOW_CHECKED_14_": "<ul><li><p>Die Seite wird im Firefox-Browser nach dem Vornehmen von abweichenden Einstellungen (z.B. heller Text auf dunklem Hintergrund) entsprechend anders dargestellt. Alle wichtigen Funktionen sind auch bei benutzerdefinierten Farbeinstellungen weiterhin bedienbar, Schriften erscheinen vergrößert und in der jeweils eingestellten Schrifttype.</p></li></ul>",
  "_STEP_11_7_HOW_CHECKED_15_": "<h4 id=\"_teilweise_erfüllt_oder_schlechter\">Teilweise erfüllt oder schlechter</h4>",
  "_STEP_11_7_HOW_CHECKED_16_": "<ul><li><p>Aufgrund von benutzerdefinierten Farbeinstellungen treten Probleme auf, zum Beispiel:</p><ul><li><p>Für die Nutzung des Webauftritts wichtige informationstragende Grafiken oder grafische Bedienelemente sind nicht mehr sichtbar.</p></li><li><p>Unterschiedliche Zustände von Formularelementen (z. B. Auswahlschalter oder Kontrollkästchen) sind nicht mehr unterscheidbar.</p></li><li><p>Fließtext wird nicht vergrößert dargestellt.</p></li></ul></li></ul>",
  "_STEP_11_7_SOURCES_1_": "<ul><li><p>Zurzeit keine Quellen.</p></li></ul>",
  "_STEP_11_7_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Einordnung des Prüfschritts nach EN 301 549 V3.2.1</h3>",
  "_STEP_11_7_CLASSIFICATION_2_": "<h4 id=\"_11_7_user_preferences\">11.7 User preferences</h4>",
  "_STEP_11_7_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where Web-App is not designed to be isolated from its platform, and provides a user interface, that user interface shall follow the values of the user preferences for platform settings for: units of measurement, colour, contrast, font type, font size, and focus cursor except where they are overridden by the user.</p><p>NOTE 1: Web-App that is isolated from its underlying platform has no access to user settings in the platform and thus cannot adhere to them.</p><p>NOTE 2: For web content, the underlying platform is the user agent.</p><p>NOTE 3: This does not preclude the Web-App from having additional values for a setting as long as there is one mode where the application will follow the system settings even if more restricted.</p></div></div>"
}