{
  "_STEP_11_7_1_NAME_": "Пользовательские настройки",
  "_STEP_11_7_1_NAME_MENU_": "11.7.1 Пользовательские настройки",
  "_STEP_11_7_1_WHAT_CHECKED_1_": "<p>Страница должна учитывать пользовательские настройки браузера. Это могут быть следующие пункты:</p>",
  "_STEP_11_7_1_WHAT_CHECKED_2_": "<ul><li><p>Измененные передний и задний цвета</p></li><li><p>Шрифты</p></li><li><p>Размеры шрифтов</p></li><li><p>Отображение курсора фокуса</p></li><li><p>Единицы измерения</p></li></ul>",
  "_STEP_11_7_1_WHAT_CHECKED_3_": "<p>Кроме того, страница может предлагать собственные значения для этих настроек. Если эти настройки не используются, должны применяться настройки браузера. В некоторых случаях может потребоваться перезагрузка страницы, чтобы изменения вступили в силу.</p>",
  "_STEP_11_7_1_WHY_CHECKED_1_": "<p>Когда люди производят собственные настройки в браузере, например, потому что им нужен больший размер шрифта или собственные настройки цвета, эти настройки должны уважаться и приниматься веб-приложением где это возможно.</p>",
  "_STEP_11_7_1_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_11_7_1_HOW_CHECKED_2_": "<p>Этап проверки всегда применим.</p>",
  "_STEP_11_7_1_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_11_7_1_HOW_CHECKED_4_": "<ol><li><p>Загрузить страницу в браузере Firefox</p></li><li><p>Открыть настройки (Меню элементов открыть &gt; Настройки)</p><ul><li><p>В разделе \"Язык и внешний вид\" установить размер шрифта значительно выше стандартного значения (например, 24). В настройках \"Дополнительно…​\" для минимального размера шрифта должно быть выбрано \"Нет\".</p></li><li><p>С помощью кнопки \"Дополнительно…\" установить для шрифтов \"Serif\", \"Sans Serif\" и \"Fixed Width\" значительно отличающиеся шрифты (Fonts), и снять галочку \"Разрешить страницам использовать свои шрифты вместо выбранных выше\".</p></li><li><p>Выбрать кнопку \"Цвета…\", установить измененные текстовые и фоновые цвета с большим контрастом.</p></li><li><p>Отключить чекбокс \"Использовать системные цвета\".</p></li><li><p>В выпадающем списке \"Использовать выбранные выше цвета вместо цветов страницы\" выбрать значение \"Всегда\".</p></li><li><p>Подтвердить с помощью \"ОК\".</p></li></ul></li><li><p>Проверить, влияют ли настройки типа шрифта, размера шрифта и переднего/заднего цветов на отображение страницы и принимаются ли они.</p></li><li><p>Проверить, видны ли все важные элементы управления и их состояния (например, кнопка \"гамбургер\" и состояния элементов формы, такие как переключатели и флажки) при измененных переднем и заднем цветах.</p></li></ol>",
  "_STEP_11_7_1_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Примечания</h3>",
  "_STEP_11_7_1_HOW_CHECKED_6_": "<h4 id=\"_3_1_einzusetzender_browser_für_die_prüfung\">3.1. Браузер, используемый для проверки</h4>",
  "_STEP_11_7_1_HOW_CHECKED_7_": "<p>Для проверки, если это возможно, следует использовать браузер Firefox, который предлагает эти настройки. В других браузерах эти настройки могут отсутствовать или быть неэффективными.</p>",
  "_STEP_11_7_1_HOW_CHECKED_8_": "<p>Если для проверки используются другие браузеры и изменение настроек не влияет на отображение, это может быть связано как с браузером, так и с настройками веб-приложения.</p>",
  "_STEP_11_7_1_HOW_CHECKED_9_": "<h4 id=\"_3_2_hinweis_zur_prüfung_mit_firefox\">3.2. Примечания к проверке с Firefox</h4>",
  "_STEP_11_7_1_HOW_CHECKED_10_": "<p>Браузер Firefox не принимает выбранный пользователем фоновый цвет для элементов <code>button</code> или устанавливает собственный цвет. Это не должно оцениваться как ошибка.</p>",
  "_STEP_11_7_1_HOW_CHECKED_11_": "<p>Для практики еще необходимы примечания. Вы можете создать <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">issue для этого шага проверки</a> на GitHub, чтобы участвовать в разработке проверки.</p>",
  "_STEP_11_7_1_HOW_CHECKED_12_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_11_7_1_HOW_CHECKED_13_": "<h4 id=\"_erfüllt\">Выполнено</h4>",
  "_STEP_11_7_1_HOW_CHECKED_14_": "<ul><li><p>Страница в браузере Firefox после внесения изменений (например, светлый текст на темном фоне) отображается соответствующим образом. Все важные функции по-прежнему доступны при пользовательских настройках цвета, шрифты увеличены и отображаются в установленном шрифте.</p></li></ul>",
  "_STEP_11_7_1_HOW_CHECKED_15_": "<h4 id=\"_teilweise_erfüllt_oder_schlechter\">Частично выполнено или хуже</h4>",
  "_STEP_11_7_1_HOW_CHECKED_16_": "<ul><li><p>Из-за пользовательских настроек цвета возникают проблемы, например:</p><ul><li><p>Важные информационные графики или графические элементы управления, необходимые для использования веб-сайта, больше не видны.</p></li><li><p>Различные состояния элементов формы (например, переключатели или флажки) больше не различимы.</p></li><li><p>Текст не отображается увеличенным.</p></li></ul></li></ul>",
  "_STEP_11_7_1_SOURCES_1_": "<ul><li><p>В настоящее время нет источников.</p></li></ul>",
  "_STEP_11_7_1_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация шага проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_11_7_1_CLASSIFICATION_2_": "<h4 id=\"_11_7_user_preferences\">11.7 Пользовательские предпочтения</h4>",
  "_STEP_11_7_1_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where Web-App is not designed to be isolated from its platform, and provides a user interface, that user interface shall follow the values of the user preferences for platform settings for: units of measurement, colour, contrast, font type, font size, and focus cursor except where they are overridden by the user.</p><p>NOTE 1: Web-App that is isolated from its underlying platform has no access to user settings in the platform and thus cannot adhere to them.</p><p>NOTE 2: For web content, the underlying platform is the user agent.</p><p>NOTE 3: This does not preclude the Web-App from having additional values for a setting as long as there is one mode where the application will follow the system settings even if more restricted.</p></div></div>"
}