{
  "_STEP_9_1_3_1F_NAME_": "Связывание ячеек таблицы",
  "_STEP_9_1_3_1F_WHAT_CHECKED_1_": "<p>В сложных таблицах должны быть определены связи между заголовками и содержимым (через атрибуты <code>scope</code> или <code>id</code> и <code>headers</code>), в простых таблицах должны быть корректно указаны явные связи между заголовками и содержимым.</p>",
  "_STEP_9_1_3_1F_WHY_CHECKED_1_": "<p>В сложных таблицах скринридеры не могут автоматически определить связи между данными и заголовочными ячейками только на основе структуры таблицы. Поэтому эти связи должны быть явно определены с использованием доступных в HTML атрибутов.</p>",
  "_STEP_9_1_3_1F_WHY_CHECKED_2_": "<p>На практике даже в простых таблицах иногда используются атрибуты <code>headers</code> и <code>id</code>. Скринридеры в таких случаях ориентируются на заданную разметку, а не на общие правила. Поэтому разметка должна быть корректной, даже если она, строго говоря, не нужна. Потому что при неправильной разметке заголовки могут выводиться некорректно или вообще отсутствовать.</p>",
  "_STEP_9_1_3_1F_WHY_CHECKED_3_": "<p>Примечание: Для пользователей скринридеров сложные таблицы труднее воспринимать, чем простые, даже при идеальной разметке. Поэтому рекомендуется избегать таблиц с несколькими логическими уровнями (см. <a href=\"#_was_sind_tabellen_mit_mehreren_logischen_ebenen\">Что такое таблицы с несколькими логическими уровнями?</a>). Во многих случаях сложные таблицы можно заменить несколькими простыми таблицами. Лучшая оценка для этого шага проверки - \"не применимо\".</p>",
  "_STEP_9_1_3_1F_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_9_1_3_1F_HOW_CHECKED_2_": "<p>Этап проверки применим, если таблица данных сложна, то есть имеет многоуровневые заголовки строк или столбцов, или если в простой таблице ячейки явно (через <code>headers</code> и <code>id</code>) связаны с определенными заголовками (даже если это связывание на самом деле не требуется).</p>",
  "_STEP_9_1_3_1F_HOW_CHECKED_3_": "<p>В отличие от сложных, простые таблицы имеют только одну строку или столбец для заголовков. В таких таблицах обычно не требуется \"привязывать\" ячейки к \"их\" заголовкам.</p>",
  "_STEP_9_1_3_1F_HOW_CHECKED_4_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_1_3_1F_HOW_CHECKED_5_": "<ul><li><p>Загрузить страницу в <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\">Firefox</a>.</p></li><li><p>Вызвать <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#tablesbm\">Tables bookmarklet</a>. Теперь отображаются разметки таблиц.</p></li><li><p>Проверить, правильно ли определен диапазон заголовков через атрибут <code>scope</code>, или правильно ли отдельные ячейки связаны с заголовками через атрибуты <code>headers</code> и <code>id</code>.</p></li></ul>",
  "_STEP_9_1_3_1F_HOW_CHECKED_6_": "<h3 id=\"_3_hinweis\">3. Примечание</h3>",
  "_STEP_9_1_3_1F_HOW_CHECKED_7_": "<p>Основой для проверки является предварительная проверка структуры таблицы данных и разметки заголовков на этапе 9.1.3.1e \"Правильно построенные таблицы данных\". Этот шаг проверки 9.1.3.1f ограничивается полнотой и формальной корректностью связывания содержимого с заголовками.</p>",
  "_STEP_9_1_3_1F_SOURCES_1_": "<h3 id=\"_was_sind_tabellen_mit_mehreren_logischen_ebenen\">Что такое таблицы с несколькими логическими уровнями?</h3>",
  "_STEP_9_1_3_1F_SOURCES_2_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>(…) the average table of data with a row of headers across the top, and a column of headers down one side or the other (or sometimes the same headers reproduced at either side, to make life easier) has only one logical level of headers.</p><p>Tables with two or more levels are those where the row of headers \"closest to the content\" itself has headersA trivial example would be months, which have season headers (…)</p></blockquote></div>",
  "_STEP_9_1_3_1F_SOURCES_3_": "<p>(<a href=\"http://lists.w3.org/Archives/Public/wai-wcag-editor/2000OctDec/0155.html\" class=\"bare\">http://lists.w3.org/Archives/Public/wai-wcag-editor/2000OctDec/0155.html</a>)</p>",
  "_STEP_9_1_3_1F_SOURCES_4_": "<h3 id=\"_technique_h63_using_the_scope_attribute_to_associate_header_cells_and_data_cells_in_data_tables\">Техника H63: Использование атрибута scope для связывания заголовочных и данных ячеек в таблицах</h3>",
  "_STEP_9_1_3_1F_SOURCES_5_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>\"At the current time, those who want to ensure consistent support across Assistive Technologies for tables where the headers are not in the first row/column may want to use the technique for complex tables H43: Using id and headers attributes to associate data cells with header cells in data tables. For simple tables that have headers in the first column or row we recommend the use of the th and td elements.\"</p></blockquote></div>",
  "_STEP_9_1_3_1F_SOURCES_6_": "<p>(<a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H63.html\" class=\"bare\">https://www.w3.org/WAI/WCAG21/Techniques/html/H63.html</a>)</p>",
  "_STEP_9_1_3_1F_SOURCES_7_": "<h3 id=\"_technique_h43_using_id_and_headers_attributes_to_associate_data_cells_with_header_cells_in_data_tables\">Техника H43: Использование атрибутов id и headers для связывания данных ячеек с заголовочными в таблицах данных</h3>",
  "_STEP_9_1_3_1F_SOURCES_8_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>\"The objective of this technique is to associate each data cell (in a data table) with the appropriate headers. This technique adds a headers attribute to each data cell (td element)It also adds an id attribute to any cell used as a header for other cells. The headers attribute of a cell contains a list of the id attributes of the associated header cells. If there is more than one id, they are separated by spaces.</p><p>This technique is used when data cells are associated with more than one row and/or one column header. This allows screen readers to speak the headers associated with each data cell when the relationships are too complex to be identified using the th element alone or the th element with the scope attribute. Using this technique also makes these complex relationships perceivable when the presentation format changes.</p><p>This technique is not recommended for layout tables since its use implies a relationship between cells that is not meaningful when tables are used for layout.\"</p></blockquote></div>",
  "_STEP_9_1_3_1F_SOURCES_9_": "<p>(<a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H43.html\" class=\"bare\">https://www.w3.org/WAI/WCAG21/Techniques/html/H43.html</a>)</p>",
  "_STEP_9_1_3_1F_SOURCES_10_": "<h3 id=\"_weiterführende_links\">Дополнительные ссылки:</h3>",
  "_STEP_9_1_3_1F_SOURCES_11_": "<ul><li><p>pro-barrierefreiheit: <a href=\"http://www.pro-barrierefreiheit.de/entwickler/tabellen/strukturierung/\">Структурирование содержимого таблиц</a></p></li><li><p>Roger Hudson, Web Usability: <a href=\"http://www.usability.com.au/resources/tables.cfm\">Доступные таблицы данных</a></p></li></ul>",
  "_STEP_9_1_3_1F_CLASSIFICATION_1": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация проверки согласно WCAG 2.1</h3>",
  "_STEP_9_1_3_1F_CLASSIFICATION_2": "<h4 id=\"_guideline\">Руководящие принципы</h4>",
  "_STEP_9_1_3_1F_CLASSIFICATION_3": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/quickref/?showtechniques=131#adaptable\">Руководящий принцип 1.3 Адаптивность: Создавайте контент, который можно представить разными способами (например, более простой макет) без потери информации или структуры</a></p></li></ul>",
  "_STEP_9_1_3_1F_CLASSIFICATION_4": "<h4 id=\"_success_criterion\">Критерий успеха</h4>",
  "_STEP_9_1_3_1F_CLASSIFICATION_5": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/quickref/?showtechniques=131#info-and-relationships\">1.3.1 Информация и отношения</a> (Уровень A)</p></li></ul>",
  "_STEP_9_1_3_1F_CLASSIFICATION_6": "<h4 id=\"_techniques\">Техники</h4>",
  "_STEP_9_1_3_1F_CLASSIFICATION_7": "<h5 id=\"_general_techniques\">Общие техники</h5>",
  "_STEP_9_1_3_1F_CLASSIFICATION_8": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G115.html\">G115: Использование семантических элементов для разметки структуры</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G140.html\">G140: Разделение информации и структуры от представления для обеспечения различных представлений</a></p></li></ul>",
  "_STEP_9_1_3_1F_CLASSIFICATION_9": "<h5 id=\"_html_techniques\">Техники HTML</h5>",
  "_STEP_9_1_3_1F_CLASSIFICATION_10": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H43.html\">H43 Использование атрибутов <code>id</code> и <code>headers</code> для связывания данных ячеек с заголовочными ячейками в таблицах данных</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H63.html\">H63 Использование атрибута <code>scope</code> для связывания заголовочных ячеек и данных ячеек в таблицах</a></p></li></ul>",
  "_STEP_9_1_3_1F_CLASSIFICATION_11": "<h5 id=\"_failures\">Неудачи</h5>",
  "_STEP_9_1_3_1F_CLASSIFICATION_12": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F90.html\">F90: Неудача критерия успеха 1.3.1 из-за неправильной ассоциации заголовков таблиц и содержимого через атрибуты <code>headers</code> и <code>id</code></a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F92.html\">F92: Неудача критерия успеха 1.3.1 из-за использования роли presentation для содержимого, которое передает семантическую информацию</a></p></li></ul>"
}