{
  "_STEP_6_3_NAME_": "Идентификация звонящего",
  "_STEP_6_3_WHAT_CHECKED_1_": "<p>Если веб-приложение предоставляет телекоммуникационные функции с идентификацией вызова, идентификация должна быть доступна также в текстовой форме и программно определяема.</p>",
  "_STEP_6_3_WHY_CHECKED_1_": "<p>Это требование гарантирует, что пользователи с техническими средствами помощи также могут идентифицировать звонящего.</p>",
  "_STEP_6_3_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_6_3_HOW_CHECKED_2_": "<p>Этап проверки применим, если веб-приложение предоставляет телекоммуникационные функции с идентификацией вызова. Идентификация вызова здесь означает сигнализацию или отображение вызывающего абонента.</p>",
  "_STEP_6_3_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_6_3_HOW_CHECKED_4_": "<p>Для проверки веб-приложение, возможно, придется открыть на двух устройствах.</p>",
  "_STEP_6_3_HOW_CHECKED_5_": "<ol><li><p>Запустить скринридер</p></li><li><p>Открыть веб-приложение</p></li><li><p>Совершить вызов с второго устройства</p></li><li><p>Проверить, как вызов сигнализируется в сочетании с активированным скринридером. Анонсируется ли вызывающий автоматически или информация о вызывающем доступна в браузере для скринридера без лишних действий?</p></li><li><p>Проверить, как вызов визуально сигнализируется или отображается. Дисплей должен идентифицировать вызывающего каким-либо образом в текстовой форме,</p><ol class=\"loweralpha\"><li><p>например, через номер телефона или имя, связанное с номером вызывающего.</p></li></ol></li></ol>",
  "_STEP_6_3_SOURCES_1_": "<ul><li><p><a href=\"https://labs.etsi.org/rep/HF/en301549/uploads/272bede3724c5c99efe777f778201f70/tr_103708v010101p.pdf\">Human Factors (HF); Real-Time Text (RTT) in Multiparty Conference Calling / ETSI TR 103 708 V1.1.1 (2022-08)</a></p></li></ul>",
  "_STEP_6_3_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_6_3_CLASSIFICATION_2_": "<h4 id=\"_6_3_caller_id\">6.3 Идентификация звонящего</h4>",
  "_STEP_6_3_CLASSIFICATION_3_": "<p>Если ИКТ предоставляет идентификацию вызывающего абонента или аналогичные телекоммуникационные функции, идентификация вызывающего абонента и аналогичные телекоммуникационные функции должны быть доступны в текстовой форме, а также быть программно определяемыми, если функциональность не закрыта.</p>"
}