{
  "_STEP_9_1_4_2_NAME_": "Ton abschaltbar",
  "_STEP_9_1_4_2_WHAT_CHECKED_1_": "<p>Automatisch abgespielte Töne, die nicht nach drei Sekunden enden, sollen abschaltbar sein.</p>",
  "_STEP_9_1_4_2_WHY_CHECKED_1_": "<p>Automatisch abgespielte Töne stören Nutzer, die sich auf einer Seite mittels Sprachausgabe orientieren.</p>",
  "_STEP_9_1_4_2_WHY_CHECKED_2_": "<p>Falls ein Tonelement nach dem Laden einer Seite automatisch startet, ist es deshalb wichtig, dass es sich über einen am Seitenbeginn befindlichen barrierefreien Mechanismus abschalten, anhalten oder herunter regeln lässt.</p>",
  "_STEP_9_1_4_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_1_4_2_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn nach dem Laden einer Seite Tonelemente auf einer Webseite automatisch länger als drei Sekunden abgespielt werden.</p>",
  "_STEP_9_1_4_2_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_1_4_2_HOW_CHECKED_4_": "<p>Wenn nach Laden der Seite ein Tonelement automatisch abgespielt wird:</p>",
  "_STEP_9_1_4_2_HOW_CHECKED_5_": "<ul><li><p>Prüfen, ob der Ton länger als 3 Sekunden dauert.</p></li><li><p>Wenn das der Fall ist: Prüfen, ob sich am Seitenbeginn ein Mechanismus (Button, Link, oder Lautstärke-Regler) befindet, mit dem sich der Ton abschalten oder unabhängig von der Systemlautstärke herunter regeln lässt.</p></li><li><p>Den Mechanismus bedienen und den Ton abschalten.</p></li></ul>",
  "_STEP_9_1_4_2_HOW_CHECKED_6_": "<p>Wenn sich die Lautstärke regeln lässt:</p>",
  "_STEP_9_1_4_2_HOW_CHECKED_7_": "<ul><li><p>Das Kontrollelement \"Sound\" aufrufen: Windows-Menü _Start &gt; Alle Apps &gt; Windows System &gt; Systemsteuerung (&gt; Kategorie Hardware und Sound) &gt; Sound_In der Registerkarte \"Wiedergabe\" die Eigenschaften des Lautsprechers aufrufen und den \"Pegel\" (in gleichnamiger Registerkarte) anzeigen.</p></li><li><p>Ton wieder anschalten oder Seite neu laden, dann die Lautstärke ganz herunterregeln. Ist der Ton verschwunden?</p></li><li><p>Prüfen, ob der Lautstärkeregelung durch den Mechanismus unabhängig von der Systemtonlautstärke ist (Die Lautstärkeeinstellung in \"Sound\" soll unverändert bleiben). Alternativ kann die Systemlautstärke auch über den das Lautsprechersymbol im einblendbaren Infobereich der Taskleiste geprüft werden.</p></li></ul>",
  "_STEP_9_1_4_2_HOW_CHECKED_8_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_9_1_4_2_HOW_CHECKED_9_": "<ul><li><p>Töne, die nicht nach kurzer Zeit enden, können auch die Verständlichkeit der Sprachausgabe des Abschaltmechanismus stören. Deshalb wird auch berücksichtigt, wie störend sich der Ton auswirkt. Sprache oder laute Geräusche etwa stören mehr als eine gleichmäßige Hintergrundmusik.</p></li><li><p>Der Mechanismus zum Herunterregeln des Tones darf nicht die Systemtonlautstärke ändern, da dies auch die Tonausgabe von Hilfsmitteln mit Sprachausgabe beeinträchtigen würde.</p></li><li><p>Der Mechanismus zum Abschalten oder Herunterregeln des Tons muss sich am Seitenbeginn befinden und soll selbst alle Anforderungen an Barrierefreiheit erfüllen, also etwa ausreichende Kontraste haben und tastaturbedienbar sein.</p></li><li><p>Wenn sich der Ton herunterregeln lässt, soll er auf der niedrigsten Stellung des Reglers nicht mehr hörbar sein.</p></li><li><p>Es reicht zur Erfüllung dieses Prüfschritts nicht aus, wenn sich der Ton über Tastaturbefehle (etwa die <em>Escape</em>-Taste) abschalten lässt. Diese Funktion kann sinnvoll sein, wird aber von vielen Nutzern nicht vermutet.</p></li></ul>",
  "_STEP_9_1_4_2_HOW_CHECKED_10_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_9_1_4_2_HOW_CHECKED_11_": "<h4 id=\"_erfüllt\">Erfüllt</h4>",
  "_STEP_9_1_4_2_HOW_CHECKED_12_": "<ul><li><p>Automatisch abgespielte Töne dauern nicht länger als drei Sekunden oder sind über einen barrierefreien Mechanismus am Seitenbeginn abschaltbar.</p></li></ul>",
  "_STEP_9_1_4_2_HOW_CHECKED_13_": "<h4 id=\"_nicht_voll_erfüllt\">Nicht voll erfüllt</h4>",
  "_STEP_9_1_4_2_HOW_CHECKED_14_": "<ul><li><p>Automatisch abgespielter Ton enthält von Beginn an längere Sprachpassagen oder andere laute und störende Ton-Ereignisse. Die Sprachausgabe des Abschaltmechanismus kann deshalb nur schlecht wahrgenommen werden.</p></li><li><p>Der Mechanismus zum Abschalten des Tons befindet sich nicht unmittelbar am Seitenbeginn.</p></li><li><p>Es gibt am Seitenbeginn lediglich eine Erklärung, wie der Ton mittels Tastatur abschaltbar ist.</p></li></ul>",
  "_STEP_9_1_4_2_SOURCES_1_": "<h3 id=\"_bedeutung_der_tonabschaltung_nach_wcag_2_1\">Bedeutung der Tonabschaltung nach WCAG 2.1</h3>",
  "_STEP_9_1_4_2_SOURCES_2_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>Individuals who use screen reading software can find it hard to hear the speech output if there is other audio playing at the same time. This difficulty is exacerbated when the screen reader’s speech output is software based (as most are today ) and is controlled via the same volume control as the sound. Therefore, it is important that the user be able to turn off the background sound. Note: Having control of the volume includes being able to reduce its volume to zero.</p><p>Note: Playing audio automatically when landing on a page may affect a screen reader user’s ability to find the mechanism to stop it because they navigate by listening and automatically started sounds might interfere with that navigation. Therefore, we discourage the practice of automatically starting sounds (especially if they last more than 3 seconds), and encourage that the sound be started by an action initiated by the user after they reach the page, rather than requiring that the sound be stopped by an action of the user after they land on the page.</p></blockquote></div>",
  "_STEP_9_1_4_2_SOURCES_3_": "<p>(<a href=\"https://www.w3.org/WAI/WCAG21/Understanding/audio-control.html\"> Audio Control: Understanding SC 1.4.2</a>)</p>",
  "_STEP_9_1_4_2_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_1_4_2_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Guideline</h4>",
  "_STEP_9_1_4_2_CLASSIFICATION_3_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#audio-control\"> Guideline 1.4 Distinguishable: Make it easier for users to see and hear content including separating foreground from background.</a></p></li></ul>",
  "_STEP_9_1_4_2_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Success criterion</h4>",
  "_STEP_9_1_4_2_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#audio-control\"> 1.4.2 Audio Control</a> (Level A)</p></li></ul>",
  "_STEP_9_1_4_2_CLASSIFICATION_6_": "<h4 id=\"_techniques\">Techniques</h4>",
  "_STEP_9_1_4_2_CLASSIFICATION_7_": "<h5 id=\"_general_techniques\">General Techniques</h5>",
  "_STEP_9_1_4_2_CLASSIFICATION_8_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G60.html\"> G60: Playing a sound that turns off automatically within three seconds</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G170.html\"> G170: Providing a control near the beginning of the Web page that turns off sounds that play automatically</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G171.html\"> G171: Playing sounds only on user request</a></p></li></ul>",
  "_STEP_9_1_4_2_CLASSIFICATION_9_": "<h4 id=\"_failures\">Failures</h4>",
  "_STEP_9_1_4_2_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F23.html\"> F23: Failure of 1.4.2 due to playing a sound longer than 3 seconds where there is no mechanism to turn it off</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F93.html\"> F93: Failure of Success Criterion 1.4.2 for absence of a way to pause or stop an HTML5 media element that autoplays</a></p></li></ul>"
}
