{
  "_STEP_9_1_4_2_NAME_": "Звук можно выключить",
  "_STEP_9_1_4_2_WHAT_CHECKED_1_": "<p>Автоматически воспроизводимые звуки, которые не заканчиваются через три секунды, должны быть выключаемыми.</p>",
  "_STEP_9_1_4_2_WHY_CHECKED_1_": "<p>Автоматически воспроизводимые звуки могут мешать пользователям, которые ориентируются на сайте с помощью голосового сопровождения.</p>",
  "_STEP_9_1_4_2_WHY_CHECKED_2_": "<p>Если элемент со звуком автоматически активируется после загрузки страницы, важно, чтобы его можно было выключить или уменьшить громкость с помощью доступного механизма в начале страницы.</p>",
  "_STEP_9_1_4_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_9_1_4_2_HOW_CHECKED_2_": "<p>Этап проверки применим, если после загрузки страницы на веб-сайте автоматически воспроизводятся звуковые элементы дольше трех секунд.</p>",
  "_STEP_9_1_4_2_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_1_4_2_HOW_CHECKED_4_": "<p>Если после загрузки страницы автоматически воспроизводится звук:</p>",
  "_STEP_9_1_4_2_HOW_CHECKED_5_": "<ul><li><p>Проверить, длится ли звук более 3 секунд.</p></li><li><p>Если это так: Проверить, есть ли в начале страницы механизм (кнопка, ссылка или регулятор громкости), с помощью которого можно выключить звук или уменьшить громкость независимо от системной громкости.</p></li><li><p>Использовать механизм и выключить звук.</p></li></ul>",
  "_STEP_9_1_4_2_HOW_CHECKED_6_": "<p>Если громкость можно регулировать:</p>",
  "_STEP_9_1_4_2_HOW_CHECKED_7_": "<ul><li><p>Открыть элемент управления звуком: Меню Windows _Start &gt; Все приложения &gt; Система Windows &gt; Панель управления (&gt; Категория Аппаратура и звук) &gt; Звук_На вкладке \"Воспроизведение\" вызвать свойства динамика и показать \"Уровень\" (на одноименной вкладке).</p></li><li><p>Включить звук снова или перезагрузить страницу, затем полностью уменьшить громкость. Звук исчез?</p></li><li><p>Проверить, не зависит ли регулировка громкости от системной громкости звука (Настройка громкости в \"Звуке\" должна оставаться неизменной). В качестве альтернативы, системную громкость можно проверить также через значок динамика в раскрывающейся области информации панели задач.</p></li></ul>",
  "_STEP_9_1_4_2_HOW_CHECKED_8_": "<h3 id=\"_3_hinweise\">3. Примечания</h3>",
  "_STEP_9_1_4_2_HOW_CHECKED_9_": "<ul><li><p>Звуки, которые не заканчиваются быстро, могут также мешать восприятию голосового сопровождения механизма выключения. Поэтому также учитывается, насколько звук мешает. Речь или громкие звуки, например, мешают больше, чем спокойная фоновая музыка.</p></li><li><p>Механизм для уменьшения громкости не должен изменять системную громкость звука, так как это может повлиять на звуковое сопровождение с голосовым управлением.</p></li><li><p>Механизм для выключения или уменьшения громкости должен находиться в начале страницы и сам соответствовать всем требованиям доступности, например, иметь достаточные контрасты и быть управляемым с клавиатуры.</p></li><li><p>Если звук можно уменьшить, то на самой низкой позиции регулятора он не должен быть слышен.</p></li><li><p>Недостаточно для выполнения этого этапа проверки, если звук можно выключить только с помощью клавиатурных команд (например, клавишей <em>Escape</em>). Эта функция может быть полезной, но многие пользователи ее не предполагают.</p></li></ul>",
  "_STEP_9_1_4_2_HOW_CHECKED_10_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_1_4_2_HOW_CHECKED_11_": "<h4 id=\"_erfüllt\">Выполнено</h4>",
  "_STEP_9_1_4_2_HOW_CHECKED_12_": "<ul><li><p>Автоматически воспроизводимые звуки не длительнее трех секунд или могут быть выключены с помощью доступного механизма в начале страницы.</p></li></ul>",
  "_STEP_9_1_4_2_HOW_CHECKED_13_": "<h4 id=\"_nicht_voll_erfüllt\">Не полностью выполнено</h4>",
  "_STEP_9_1_4_2_HOW_CHECKED_14_": "<ul><li><p>Автоматически воспроизводимый звук содержит длительные речевые пассажи или другие громкие и мешающие звуковые события с самого начала. Голосовое сопровождение механизма выключения из-за этого плохо воспринимается.</p></li><li><p>Механизм для выключения звука находится не сразу в начале страницы.</p></li><li><p>В начале страницы есть только объяснение, как звук можно выключить с помощью клавиатуры.</p></li></ul>",
  "_STEP_9_1_4_2_SOURCES_1_": "<h3 id=\"_bedeutung_der_tonabschaltung_nach_wcag_2_1\">Значение выключения звука по WCAG 2.1</h3>",
  "_STEP_9_1_4_2_SOURCES_2_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>Individuals who use screen reading software can find it hard to hear the speech output if there is other audio playing at the same time. This difficulty is exacerbated when the screen reader’s speech output is software based (as most are today ) and is controlled via the same volume control as the sound. Therefore, it is important that the user be able to turn off the background sound. Note: Having control of the volume includes being able to reduce its volume to zero.</p><p>Note: Playing audio automatically when landing on a page may affect a screen reader user’s ability to find the mechanism to stop it because they navigate by listening and automatically started sounds might interfere with that navigation. Therefore, we discourage the practice of automatically starting sounds (especially if they last more than 3 seconds), and encourage that the sound be started by an action initiated by the user after they reach the page, rather than requiring that the sound be stopped by an action of the user after they land on the page.</p></blockquote></div>",
  "_STEP_9_1_4_2_SOURCES_3_": "<p>(<a href=\"https://www.w3.org/WAI/WCAG21/Understanding/audio-control.html\">Контроль аудио: понимание SC 1.4.2</a>)</p>",
  "_STEP_9_1_4_2_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация этапа проверки по WCAG 2.1</h3>",
  "_STEP_9_1_4_2_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Руководящие принципы</h4>",
  "_STEP_9_1_4_2_CLASSIFICATION_3_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#audio-control\">Руководящий принцип 1.4 Отличимость: Облегчение для пользователей восприятия и слушания контента, включая разделение переднего плана от фона.</a></p></li></ul>",
  "_STEP_9_1_4_2_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Критерии успеха</h4>",
  "_STEP_9_1_4_2_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#audio-control\">1.4.2 Контроль аудио</a> (Уровень A)</p></li></ul>",
  "_STEP_9_1_4_2_CLASSIFICATION_6_": "<h4 id=\"_techniques\">Техники</h4>",
  "_STEP_9_1_4_2_CLASSIFICATION_7_": "<h5 id=\"_general_techniques\">Общие техники</h5>",
  "_STEP_9_1_4_2_CLASSIFICATION_8_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G60.html\">G60: Воспроизведение звука, который автоматически выключается в течение трех секунд</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G170.html\">G170: Предоставление управления в начале веб-страницы, которое выключает звуки, воспроизводимые автоматически</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G171.html\">G171: Воспроизведение звуков только по запросу пользователя</a></p></li></ul>",
  "_STEP_9_1_4_2_CLASSIFICATION_9_": "<h4 id=\"_failures\">Неудачи</h4>",
  "_STEP_9_1_4_2_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F23.html\">F23: Неудача 1.4.2 из-за воспроизведения звука более 3 секунд, когда нет механизма для его выключения</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F93.html\">F93: Неудача критерия успеха 1.4.2 из-за отсутствия способа приостановить или остановить HTML5 медиа элемент, который автоматически воспроизводится</a></p></li></ul>"
}