{
  "_STEP_6_2_4_NAME_": "Скорость реакции текстовой коммуникации в реальном времени",
  "_STEP_6_2_4_WHAT_CHECKED_1_": "<p>Если веб-приложение поддерживает текстовую коммуникацию в реальном времени (RTT, Real-Time Text) и принимает текстовые вводы, то самая маленькая текстовая единица (отдельные символы или слова) должна отправляться максимум за 500 миллисекунд. Речь идет о системах, которые передают введенные символы непосредственно после ввода получателю. Сообщение не должно отправляться, как в большинстве чат-систем, после ввода, а появляться немедленно.</p>",
  "_STEP_6_2_4_WHY_CHECKED_1_": "<p>Люди, участвующие в онлайн-коммуникации через текст, не должны испытывать ущемления по сравнению с говорящими. Ввод должен отображаться сразу или с минимальной задержкой для других участников.</p>",
  "_STEP_6_2_4_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость проверки</h3>",
  "_STEP_6_2_4_HOW_CHECKED_2_": "<p>Этап проверки применим, если веб-приложение поддерживает ввод для текстовой коммуникации в реальном времени. Например, это приложение для коммуникации, поддерживающее текстовую коммуникацию в реальном времени и имеющее соответствующую возможность ввода в пользовательском интерфейсе.</p>",
  "_STEP_6_2_4_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_6_2_4_HOW_CHECKED_4_": "<p>На данный момент существуют только подходы для проверки на практике. Необходимо измерить, когда данные, введенные непосредственно, отправляются приложением. В промежутке можно проверить, установив текстовую коммуникацию в реальном времени между двумя устройствами.</p>",
  "_STEP_6_2_4_HOW_CHECKED_5_": "<p>Самая маленькая текстовая единица (отдельные символы или слова) должна отображаться на втором устройстве как можно быстрее после ввода.</p>",
  "_STEP_6_2_4_HOW_CHECKED_6_": "<p>Передача не должна занимать более полсекунды. При этом необходимо учитывать и вычитать физические ограничения, связанные с сетевой техникой. Это становится актуальным, например, при больших расстояниях между участниками связи. Чистое время передачи можно измерить, например, с помощью 'ping'.</p>",
  "_STEP_6_2_4_HOW_CHECKED_7_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_6_2_4_HOW_CHECKED_8_": "<ul><li><p>При текстовой коммуникации в реальном времени (RTT) текст появляется у получателя динамично во время ввода отправителем. RTT не то же самое, что и чат, где сообщения отправляются явно и появляются у получателя только после этого.</p></li><li><p>Следует стремиться к максимальной задержке отправки ввода в 300 миллисекунд, так как это улучшает восприятие потока информации.</p></li></ul>",
  "_STEP_6_2_4_HOW_CHECKED_9_": "<p>Для получения рекомендаций о том, как это можно надежно измерить на практике, вы можете открыть вопрос на GitHub <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">здесь</a>.</p>",
  "_STEP_6_2_4_SOURCES_1_": "<ul><li><p><a href=\"https://labs.etsi.org/rep/HF/en301549/uploads/272bede3724c5c99efe777f778201f70/tr_103708v010101p.pdf\">Human Factors (HF); Real-Time Text (RTT) in Multiparty Conference Calling / ETSI TR 103 708 V1.1.1 (2022-08)</a></p></li></ul>",
  "_STEP_6_2_4_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_6_2_4_CLASSIFICATION_2_": "<h4 id=\"_6_2_4_rtt_responsiveness\">6.2.4 Реакция RTT</h4>",
  "_STEP_6_2_4_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where ICT utilises RTT input, that RTT input shall be transmitted to the ICT network or platform on which the ICT runs within 500 ms of the time that the smallest reliably composed unit of text entry is available to the ICT for transmission. Delays due to platform or network performance shall not be included in the 500 ms limit.</p><p>NOTE 1: For character by character input, the \"smallest reliably composed unit of text entry\" would be a character. For word prediction it would be a word. For some voice recognition systems - the text may not exit the recognition software until an entire word (or phrase) has been spoken. In this case, the smallest reliably composed unit of text entry available to the ICT would be the word (or phrase).</p><p>NOTE 2: The 500 ms limit allows buffering of characters for this period before transmission so character by character transmission is not required unless the characters are generated more slowly than 1 per 500 ms.</p><p>NOTE 3: A delay of 300 ms, or less, produces a better impression of flow to the user.</p></div></div>"
}