{
  "_STEP_9_3_1_2_NAME_": "Выделены слова и фрагменты на другом языке",
  "_STEP_9_3_1_2_NAME_MENU_": "9.3.1.2 Выделены слова и фрагменты на другом языке",
  "_STEP_9_3_1_2_WHAT_CHECKED_1_": "<p>Слова и текстовые фрагменты на другом языке на странице должны быть выделены с помощью атрибута <code>lang</code>.</p>",
  "_STEP_9_3_1_2_WHY_CHECKED_1_": "<p>Скринридеры используют словари, в которых определено произношение слов. Они должны знать, на каком языке написан текст, чтобы использовать правильный словарь и правильно произносить текст.</p>",
  "_STEP_9_3_1_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_9_3_1_2_HOW_CHECKED_2_": "<p>Этот шаг проверки применим, если страница содержит слова, целые предложения, абзацы или другие крупные фрагменты на другом языке.</p>",
  "_STEP_9_3_1_2_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_3_1_2_HOW_CHECKED_4_": "<ol><li><p>Открыть страницу в Firefox.</p></li><li><p>Запустить <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html\">Lang bookmarklet</a>.</p></li><li><p>Проверить, правильно ли выделены слова и фрагменты на другом языке. Исключения применяются для собственных имен, терминов и неоднозначного языка (см. <a href=\"#3.Hinweise\">[3.Советы]</a>).</p></li></ol>",
  "_STEP_9_3_1_2_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Советы</h3>",
  "_STEP_9_3_1_2_HOW_CHECKED_6_": "<ul><li><p>Отдельные слова на иностранном языке могут рассматриваться как часть языка окружающего текста и не требуют выделения, если только не предполагается изменение языка или произношение без смены языка будет непонятно. Например, в немецких текстах слова типа \"Enter\" или \"Helpdesk\" не нужно выделять: такие термины либо уже являются частью немецкого языка, либо произносятся по-немецки и по-английски очень похоже, так что без выделения языка не возникает практических проблем.</p></li><li><p>Также не следует выделять \"смешанные\" слова. Примеры таких слов: Webauftritt, Checkpunkt.</p></li><li><p>Отдельные иностранные слова должны быть выделены, если они не вошли в немецкий языковой обиход. Слова, включенные в актуальное \"Deutschen Universalwörterbuch\" издательства Duden, не требуют выделения. Онлайн-поиск Duden по адресу <a href=\"http://www.duden.de/suchen\" class=\"bare\">http://www.duden.de/suchen</a> к сожалению, не позволяет различать, в каком словаре Duden найдены записи. Поэтому он может использоваться только в поддерживающем качестве.</p></li><li><p>Словари скринридеров должны содержать также распространенные иностранные слова. Однако это не всегда так, даже распространенные иностранные слова без выделения произносятся неправильно. Поэтому их выделение имеет смысл, даже если это не требуется. Примеры распространенных иностранных слов, которые можно, но не обязательно выделять: Copyright, Website, Site, Homepage.</p></li></ul>",
  "_STEP_9_3_1_2_HOW_CHECKED_7_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_3_1_2_HOW_CHECKED_8_": "<h3 id=\"_erfüllt\">Выполнено</h3>",
  "_STEP_9_3_1_2_HOW_CHECKED_9_": "<ul><li><p>Слова и фрагменты на другом языке правильно выделены. Если отдельные слова на иностранном языке \"забыты\", это не должно оцениваться отрицательно. Однако они должны быть выделены по крайней мере на 90%.</p></li></ul>",
  "_STEP_9_3_1_2_HOW_CHECKED_10_": "<h3 id=\"_nicht_erfüllt\">Не выполнено</h3>",
  "_STEP_9_3_1_2_HOW_CHECKED_11_": "<ul><li><p>Менее 50% слов на другом языке выделены.</p></li></ul>",
  "_STEP_9_3_1_2_SOURCES_1_": "<h3 id=\"_wichtigkeit_der_sprachauszeichnung_nach_wcag_2_1\">Важность выделения языка по WCAG 2.1</h3>",
  "_STEP_9_3_1_2_SOURCES_2_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>Identifying changes in language is important for a number of reasons:</p><ul><li><p>It allows braille translation software to follow changes in language, e.g., substitute control codes for accented characters, and insert control codes necessary to prevent erroneous creation of Grade 2 braille contractions.</p></li><li><p>Speech synthesizers that support multiple languages will be able to speak the text in the appropriate accent with proper pronunciation. If changes are not marked, the synthesizer will try its best to speak the words in the default language it works in. Thus, the French word for car, \"voiture\" would be pronounced \"voyture\" by a speech synthesizer that uses English as its default language.</p></li><li><p>Marking changes in language can benefit future developments in technology, for example users who are unable to translate between languages themselves will be able to use machines to translate unfamiliar languages.</p></li><li><p>Marking changes in language can also assist user agents in providing definitions using a dictionary.</p></li></ul></blockquote></div>",
  "_STEP_9_3_1_2_SOURCES_3_": "<p>(<a href=\"https://www.w3.org/WAI/WCAG21/Understanding/language-of-parts.html\">Language of Parts: Understanding SC 3.1.2</a>)</p>",
  "_STEP_9_3_1_2_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Разграничение с другими этапами проверки</h3>",
  "_STEP_9_3_1_2_CLASSIFICATION_2_": "<ul><li><p>Этап проверки 9.3.1.1 \"Указан основной язык\"</p></li></ul>",
  "_STEP_9_3_1_2_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация этапа проверки по WCAG 2.1</h3>",
  "_STEP_9_3_1_2_CLASSIFICATION_4_": "<h4 id=\"_guideline\">Рекомендации</h4>",
  "_STEP_9_3_1_2_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#readable\">Рекомендация 3.1 Читабельность: Сделать текстовый контент читаемым и понятным</a></p></li></ul>",
  "_STEP_9_3_1_2_CLASSIFICATION_6_": "<h4 id=\"_success_criterion\">Критерий успеха</h4>",
  "_STEP_9_3_1_2_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#language-of-parts\">3.1.2 Язык частей</a> (Уровень AA)</p></li></ul>",
  "_STEP_9_3_1_2_CLASSIFICATION_8_": "<h4 id=\"_techniques\">Техники</h4>",
  "_STEP_9_3_1_2_CLASSIFICATION_9_": "<h5 id=\"_html_techniques\">HTML техники</h5>",
  "_STEP_9_3_1_2_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H58.html\">H58: Использование атрибутов языка для идентификации изменений в человеческом языке</a></p></li></ul>"
}