{
  "_STEP_12_1_1_NAME_": "Документация по совместимости и доступности",
  "_STEP_12_1_1_NAME_MENU_": "12.1.1 Документация по совместимости и доступности",
  "_STEP_12_1_1_WHAT_CHECKED_1_": "<p>Если веб-предложение предоставляет документацию (включая объяснение доступности), то эта документация должна перечислять существующие дополнительные функции и характеристики доступности и объяснять их использование, если они реализованы как часть самого веб-предложения. К таким функциям, например, относятся функции чтения вслух, функции настройки индивидуальных цветовых схем или доступные горячие клавиши. Также к ним относятся сведения о (возможно ограниченной) совместимости с вспомогательными технологиями.</p>",
  "_STEP_12_1_1_WHY_CHECKED_1_": "<p>Если предложения содержат определенные функции доступности, они должны быть хорошо задокументированы, так как многие пользователи без явных указаний не узнают о существовании или не смогут использовать эти функции.</p>",
  "_STEP_12_1_1_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_12_1_1_HOW_CHECKED_2_": "<p>Этот этап проверки применим, если для предложения существует техническая документация функций предложения (например, горячие клавиши или сведения об использовании с вспомогательными средствами). Эта проверка содержания проводится как для документации, представленной в HTML, так и для документации в других форматах, таких как PDF или Word. Содержательная помощь, например, в FAQ (часто задаваемые вопросы), здесь не считается технической документацией. Объяснение доступности считается документацией предложения.</p>",
  "_STEP_12_1_1_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_12_1_1_HOW_CHECKED_4_": "<p>Дополнительные функции или свойства доступности предложения должны быть перечислены и объяснены в документации. Речь идет не о документации обеспечения базовой доступности, а о дополнительных функциях, таких как функции чтения текста вслух, настройки индивидуальных цветовых схем и т.д. Документация может предоставляться на веб-сайте или быть доступной отдельно. Найти документацию можно, например, на страницах помощи или в разделах поддержки или в объяснении доступности.</p>",
  "_STEP_12_1_1_HOW_CHECKED_5_": "<p>Документация должна содержать, например, следующую информацию о существующих функциях или свойствах доступности:</p>",
  "_STEP_12_1_1_HOW_CHECKED_6_": "<ul><li><p>Детали функций доступности, если они интегрированы в веб-сайт, например:</p><ul><li><p>Функция чтения текста вслух</p></li><li><p>Функции, позволяющие пользователям настраивать индивидуальные цветовые схемы</p></li><li><p>Функции для улучшенного отображения фокуса мыши или клавиатуры</p></li><li><p>Функции адаптации размеров текста или интервалов текста</p></li><li><p>Особые способы управления с клавиатуры / горячие клавиши, например, специальные комбинации клавиш для использования с вспомогательными технологиями</p></li></ul></li><li><p>Сведения о поддерживаемых средах, если есть ограничения на использование с вспомогательными технологиями</p></li></ul>",
  "_STEP_12_1_1_HOW_CHECKED_7_": "<p>Рекомендуется предоставлять метаданные для поддерживаемых функций доступности и совместимости в соответствии с конвенциями <a href=\"https://www.w3.org/2021/a11y-discov-vocab/latest/\">Schema.org Accessibility Properties for Discoverability Vocabulary</a>.</p>",
  "_STEP_12_1_1_HOW_CHECKED_8_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_12_1_1_HOW_CHECKED_9_": "<ol><li><p>Важно: этот этап проверки не требует, чтобы были предоставлены дополнительные функции или свойства доступности. Только если они существуют, они должны быть задокументированы.</p></li><li><p>Требуется только документация функций доступности, реализованных самим веб-предложением. Это включает в себя функции, такие как функции чтения текста, определенные и интегрированные сторонними поставщиками. Функции доступности браузера или соответствующей операционной системы не должны документироваться.</p></li><li><p>По пункту сведений о поддерживаемых средах: если предложение явно разработано для ограниченного круга пользователей (например, корпоративная интранет-система) и для этого определена поддерживаемая среда использования (например, определенный браузер и определенный скринридер), документация должна указывать поддерживаемую среду. Пользователи, сталкивающиеся с барьерами в других средах, могут хотя бы узнать причину и при необходимости адаптировать свою среду использования. Для предложений, доступных в общем вебе и используемых с различными браузерами и вспомогательными средствами, такие ограничения недопустимы.</p></li><li><p>Некоторые функции доступности, например, переключатели контраста в верхней части, изменяют отображение страницы и могут считаться самообъясняющимися. Если эти простые переключатели доступны (то есть, например, имеют программно определяемое имя и состояние), их не обязательно документировать в объяснении доступности.</p></li></ol>",
  "_STEP_12_1_1_HOW_CHECKED_10_": "<p>Для практики проверки полезны дополнительные указания, вы можете <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">создать issue на GitHub</a>.</p>",
  "_STEP_12_1_1_HOW_CHECKED_11_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_12_1_1_HOW_CHECKED_12_": "<h4 id=\"_nicht_anwendbar\">Не применимо</h4>",
  "_STEP_12_1_1_HOW_CHECKED_13_": "<ul><li><p>Нет технической документации как части предложения</p></li><li><p>Нет функций доступности, которые должны быть описаны в документации</p></li></ul>",
  "_STEP_12_1_1_HOW_CHECKED_14_": "<h4 id=\"_nicht_erfüllt\">Не выполнено</h4>",
  "_STEP_12_1_1_HOW_CHECKED_15_": "<ul><li><p>Техническая документация предложения существует, и есть функции или свойства доступности предложения. Эти функции не задокументированы и не объяснены (например, горячие клавиши или сведения об использовании с вспомогательными средствами).</p></li></ul>",
  "_STEP_12_1_1_SOURCES_1_": "<ul><li><p>В настоящее время нет источников.</p></li></ul>",
  "_STEP_12_1_1_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_12_1_1_CLASSIFICATION_2_": "<h4 id=\"_12_1_1_accessibility_and_compatibility_features\">12.1.1 Функции доступности и совместимости</h4>",
  "_STEP_12_1_1_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Product documentation provided with the ICT whether provided separately or integrated within the ICT shall list and explain how to use the accessibility and compatibility features of the ICT.</p><p>NOTE 1: Accessibility and compatibility features include accessibility features that are built-in and accessibility features that provide compatibility with assistive technology.</p><p>NOTE 2: It is best practice to use WebSchemas/Accessibility 2.0 [i.38] to provide meta data on the accessibility of the ICT.</p><p>NOTE 3: The accessibility statement and help pages are both examples of the provision of product information.</p></div></div>"
}