{
  "_STEP_9_2_1_4_NAME_": "Tastatur-Kurzbefehle abschaltbar oder anpassbar",
  "_STEP_9_2_1_4_WHAT_CHECKED_1_": "<p>Wenn Webseiten Tastaturkurzbefehle über Einzeltasten (Buchstaben, Zahlen, Satzzeichen oder Symbole) implementieren, können diese entweder abgeschaltet oder auf eine Tastenkombination mit Modifikator-Tasten umgestellt werden, oder sie sind nur aktiv für bestimmte Schnittstellen-Elemente, wenn diese den Fokus haben.</p>",
  "_STEP_9_2_1_4_WHY_CHECKED_1_": "<p>Tastaturkurzbefehle sind für Menschen, die am Computer oder einem mobilen Gerät die Spracheingabe benutzen, häufig problematisch. Spracheingaben können unerwartet Befehle für Funktionen auslösen, der Nutzungskontext geht dadurch verloren.</p>",
  "_STEP_9_2_1_4_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_2_1_4_HOW_CHECKED_2_": "<p>Der Prüfschritt ist immer anwendbar.</p>",
  "_STEP_9_2_1_4_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_2_1_4_HOW_CHECKED_4_": "<ol><li><p>Seite neu laden.</p></li><li><p>Wenn dies den Fokus auf ein Interface-Element setzt (z. B. auf ein Eingabefeld), auf einen leeren Bereich der Seite klicken, um sicherzustellen, dass keine Interface-Elemente fokussiert sind.</p></li><li><p>Mit Ausnahme der Modifikator- und Steuertasten wie STR, ALT, ENTER, Tab, Pfeiltasten und Funktionstasten F1-F12, nacheinander auf alle Tastaturtasten drücken, d. h. auf alle Nummern- Buchstaben-, Symbol- und Zeichensetzungs-Tasten.</p></li><li><p>Die Umschalttaste halten und die gleichen Tasten erneut betätigen.</p></li><li><p>Falls einzelne Tasten Funktionen auslösen, prüfen, ob die Website oder App Einstellungen bereithält, um diese Tastaturkurzbefehle über Einzeltasten abzuschalten oder auf Tastaturkurzbefehle mit einer Modifikator-Taste zu mappen.</p></li></ol>",
  "_STEP_9_2_1_4_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_9_2_1_4_HOW_CHECKED_6_": "<p>Die Anforderung gilt nicht, wenn die Tastaturkurzbefehle nur aktiv sind, sobald bestimmte Interface-Elemente den Fokus haben, etwa ein Auswahllisten-Element bzw. `select`Hier dient z. B. das Drücken einer Buchstabentaste zur schnellen Navigation innerhalb der Auswahllisten-Optionen.</p>",
  "_STEP_9_2_1_4_HOW_CHECKED_7_": "<p>Über das Anzeigen von Seitenskripten und das Suchen nach typischen Tastatur-Event-Handlern wie <code>document.addEventListener</code> oder das Vorhandensein der <code>.keycode</code>-Eigenschaft lässt sich ggf. das Vorhandensein von Skripten überprüfen, welche auf Tasteneingaben reagieren, bei denen nicht Modifikator-Tasten wie ALT oder STR gleichzeitig gedrückt werden. Da es mehrere Möglichkeiten gibt, Tastatur-Events zu implementieren, ist diese Methode aber nicht als zuverlässig zu betrachten.</p>",
  "_STEP_9_2_1_4_HOW_CHECKED_8_": "<p>Einige Browser verwenden Tastenkombinationen mit der Umschalttaste. So öffnet Firefox eine Seitensuche, wenn man Umschalttaste + / drückt, und eine Suche in Seitenlinks, wenn man Umschalttaste + ' drückt. In diesen Fällen ist es notwendig, die ESC-Taste zu drücken oder auf einen leeren Teil der Seite zu klicken, um den Fokus aus der Browser-Sucheingabe zu entfernen.</p>",
  "_STEP_9_2_1_4_HOW_CHECKED_9_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_9_2_1_4_HOW_CHECKED_10_": "<h4 id=\"_prüfschritt_erfüllt\">Prüfschritt erfüllt</h4>",
  "_STEP_9_2_1_4_HOW_CHECKED_11_": "<ul><li><p>Durch das Drücken der Tasten geschehen keinerlei Änderungen des Inhalts oder des Kontexts.</p></li><li><p>Es gibt Tastatur-Kurzbefehle über Einzeltasten, aber diese sind über Einstellungen der Website oder App abschaltbar oder auf Tastenkombinationen mit Modifikator-Tasten umstellbar.</p></li><li><p>Tastaturkurzbefehle über Einzeltasten sind nur wirksam, wenn bestimmte interaktive Elemente den Fokus haben (z.B. Auswahllisten).</p></li></ul>",
  "_STEP_9_2_1_4_SOURCES_1_": "<ul><li><p><a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste/bookmarklets.html\">   Bookmarklet \"Tastatur-Kurzbefehle auslösen\"</a> von Prüfstelle T-Systems MMS   kann ggf. zusätzlich eingesetzt werden, um der Reihe nach alle   erforderlichen Tasten auszulösen.   Dabei muss die Seite genau beobachtet werden, ob sich etwas ändert bzw.   geändert hat. Die Konsole der Entwickler-Tools zeigt die simulierten Eingaben.</p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/character-key-shortcuts.html\"> Understanding Success Criterion 2.1.4: Character Key Shortcuts</a> (zur Zeit nur auf Englisch verfügbar)</p></li></ul>",
  "_STEP_9_2_1_4_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_2_1_4_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Guideline</h4>",
  "_STEP_9_2_1_4_CLASSIFICATION_3_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#keyboard-accessible\"> Guideline 2.1 Keyboard Accessible: Make all functionality available from a keyboard</a></p></li></ul>",
  "_STEP_9_2_1_4_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Success criterion</h4>",
  "_STEP_9_2_1_4_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#character-key-shortcuts\"> 2.1.4 Character Key Shortcuts</a> (Level A)</p></li></ul>",
  "_STEP_9_2_1_4_CLASSIFICATION_6_": "<h4 id=\"_sufficient_techniques\">Sufficient Techniques</h4>",
  "_STEP_9_2_1_4_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G217\"> G217: Providing a mechanism to allow users to remap or turn off character key shortcuts</a></p></li></ul>",
  "_STEP_9_2_1_4_CLASSIFICATION_8_": "<h4 id=\"_failures\">Failures</h4>",
  "_STEP_9_2_1_4_CLASSIFICATION_9_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F99\"> F99: Failure of Success Criterion 2.1.4 due to implementing character key shortcuts that cannot be turned off or remapped</a></p></li></ul>",
  "_STEP_9_2_1_4_QUESTIONS_1_": "<h3 id=\"_das_eingebundene_video_reagiert_auf_tastaturkurzbefehle_über_einzeltasten_z_b_k_zum_pausierenabspielen_und_m_zum_stummschalten_ist_das_als_verstoß_gegen_2_1_4_tastatur_kurzbefehle_abschaltbar_oder_anpassbar_zu_werten\">Das eingebundene Video reagiert auf Tastaturkurzbefehle über Einzeltasten, z.B: \"k\" zum Pausieren/Abspielen und \"m\" zum Stummschalten. Ist das als Verstoß gegen 2.1.4 \"Tastatur-Kurzbefehle abschaltbar oder anpassbar\" zu werten?</h3>",
  "_STEP_9_2_1_4_QUESTIONS_2_": "<p>Diese Tastaturkurzbefehle sind für Tastaturnutzer zweifellos hilfreich. Ob dadurch Nachteile für Spracheingabenutzer entstehen, versuchen wir zur Zeit zu klären. Noch offen ist, ob ein Video als <a href=\"https://www.w3.org/TR/WCAG21/#dfn-user-interface-components\">User Interface Component</a> im Sinne der normativen Anforderung interpretiert werden kann. Es gibt dazu <a href=\"https://github.com/w3c/wcag/issues/1950\">eine längere Diskussion in dem Github-Issue der Accessibility Guidelines Working Group</a>. Solange diese Frage nicht klar entschieden ist, sollten Tastaturkurzbefehle auf fokussierten Videos nicht als Fehler bewertet werden.</p>"
}
