{
  "_STEP_9_2_1_4_NAME_": "Клавишные комбинации можно отключить или настроить",
  "_STEP_9_2_1_4_NAME_MENU_": "9.2.1.4 Клавишные комбинации можно отключить или настроить",
  "_STEP_9_2_1_4_WHAT_CHECKED_1_": "<p>Если веб-страницы используют клавишные комбинации на одиночных клавишах (буквы, цифры, знаки препинания или символы), они могут быть либо отключены, либо переключены на комбинацию клавиш с модификаторами, или активны только для определенных элементов интерфейса, когда те находятся в фокусе.</p>",
  "_STEP_9_2_1_4_WHY_CHECKED_1_": "<p>Клавишные комбинации часто вызывают проблемы для людей, использующих голосовой ввод на компьютере или мобильном устройстве. Голосовые команды могут неожиданно активировать функции, что приводит к потере контекста использования.</p>",
  "_STEP_9_2_1_4_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость проверки</h3>",
  "_STEP_9_2_1_4_HOW_CHECKED_2_": "<p>Этап проверки всегда применим.</p>",
  "_STEP_9_2_1_4_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_2_1_4_HOW_CHECKED_4_": "<ol><li><p>Перезагрузить страницу.</p></li><li><p>Если это устанавливает фокус на элемент интерфейса (например, на поле ввода), кликнуть на пустую область страницы, чтобы убедиться, что ни один элемент интерфейса не находится в фокусе.</p></li><li><p>Исключая модификаторы и управляющие клавиши, такие как Ctrl, Alt, Enter, Tab, стрелки и функциональные клавиши F1-F12, последовательно нажать все клавиши на клавиатуре, включая все числа, буквы, символы и знаки препинания.</p></li><li><p>Удерживая клавишу Shift, повторить нажатие тех же клавиш.</p></li><li><p>Если отдельные клавиши запускают функции, проверить, предоставляет ли сайт или приложение настройки для отключения этих клавишных комбинаций или переключения их на клавишные комбинации с модификатором.</p></li></ol>",
  "_STEP_9_2_1_4_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_9_2_1_4_HOW_CHECKED_6_": "<p>Требование не применяется, если клавишные комбинации активны только тогда, когда определенные элементы интерфейса находятся в фокусе, например элемент выбора или `select`. В этом случае нажатие клавиши буквы используется для быстрой навигации внутри опций списка выбора.</p>",
  "_STEP_9_2_1_4_HOW_CHECKED_7_": "<p>Использование страниц сценариев и поиск типичных обработчиков событий клавиатуры, таких как <code>document.addEventListener</code> или наличие свойства <code>.keycode</code>, может помочь проверить наличие скриптов, реагирующих на нажатия клавиш, при этом не нажимаются одновременно модификаторы, такие как Alt или Ctrl. Так как существует множество способов реализации событий клавиатуры, этот метод не считается надежным.</p>",
  "_STEP_9_2_1_4_HOW_CHECKED_8_": "<p>Некоторые браузеры используют сочетания клавиш с Shift. Например, в Firefox открытие поиска по странице происходит при нажатии Shift + /, а поиск по ссылкам страницы — при Shift + '. В этих случаях необходимо нажать клавишу Esc или кликнуть по пустой части страницы, чтобы убрать фокус из строки поиска браузера.</p>",
  "_STEP_9_2_1_4_HOW_CHECKED_9_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_2_1_4_HOW_CHECKED_10_": "<h4 id=\"_prüfschritt_erfüllt\">Этап проверки выполнен</h4>",
  "_STEP_9_2_1_4_HOW_CHECKED_11_": "<ul><li><p>Нажатие клавиш не вызывает изменений контента или контекста.</p></li><li><p>Есть клавишные комбинации на одиночных клавишах, но они могут быть отключены или перенастроены на комбинации клавиш с модификатором через настройки сайта или приложения.</p></li><li><p>Клавишные комбинации на одиночных клавишах действуют только тогда, когда определенные интерактивные элементы находятся в фокусе (например, списки выбора).</p></li></ul>",
  "_STEP_9_2_1_4_SOURCES_1_": "<ul><li><p><a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste/bookmarklets.html\">   Bookmarklet \"Активация клавишных комбинаций\"</a> от T-Systems MMS может быть использован дополнительно для активации всех необходимых клавиш по очереди.   Необходимо внимательно следить за изменениями на странице. Консоль инструментов разработчика показывает симулированные вводы.</p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/character-key-shortcuts.html\"> Понимание критерия успеха 2.1.4: Клавишные комбинации на символьных клавишах</a> (пока доступно только на английском)</p></li></ul>",
  "_STEP_9_2_1_4_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация этапа проверки по WCAG 2.1</h3>",
  "_STEP_9_2_1_4_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Руководство</h4>",
  "_STEP_9_2_1_4_CLASSIFICATION_3_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#keyboard-accessible\"> Руководство 2.1 Доступность с клавиатуры: Обеспечение доступности всех функций с клавиатуры.</a></p></li></ul>",
  "_STEP_9_2_1_4_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Критерии успеха</h4>",
  "_STEP_9_2_1_4_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#character-key-shortcuts\"> 2.1.4 Клавишные комбинации на символьных клавишах</a> (Уровень A)</p></li></ul>",
  "_STEP_9_2_1_4_CLASSIFICATION_6_": "<h4 id=\"_sufficient_techniques\">Достаточные техники</h4>",
  "_STEP_9_2_1_4_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G217\"> G217: Предоставление механизма, позволяющего пользователям перенастроить или отключить клавишные комбинации</a></p></li></ul>",
  "_STEP_9_2_1_4_CLASSIFICATION_8_": "<h4 id=\"_failures\">Неудачи</h4>",
  "_STEP_9_2_1_4_CLASSIFICATION_9_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F99\"> F99: Неудача критерия успеха 2.1.4 из-за реализации клавишных комбинаций на символьных клавишах, которые нельзя отключить или перенастроить</a></p></li></ul>",
  "_STEP_9_2_1_4_QUESTIONS_1_": "<h3 id=\"_das_eingebundene_video_reagiert_auf_tastaturkurzbefehle_über_einzeltasten_z_b_k_zum_pausierenabspielen_und_m_zum_stummschalten_ist_das_als_verstoß_gegen_2_1_4_tastatur_kurzbefehle_abschaltbar_oder_anpassbar_zu_werten\">Встроенное видео реагирует на клавишные комбинации на одной клавише, например, \"k\" для паузы/воспроизведения и \"m\" для отключения звука. Считается ли это нарушением 2.1.4 \"Клавишные комбинации можно отключить или настроить\"?</h3>",
  "_STEP_9_2_1_4_QUESTIONS_2_": "<p>Эти клавишные комбинации, безусловно, полезны для пользователей клавиатуры. Мы пытаемся выяснить, возникают ли из-за этого проблемы для пользователей голосового ввода. Еще не решен вопрос, можно ли трактовать видео как <a href=\"https://www.w3.org/TR/WCAG21/#dfn-user-interface-components\">Компонент пользовательского интерфейса</a> в смысле нормативных требований. По этому вопросу ведется <a href=\"https://github.com/w3c/wcag/issues/1950\">обсуждение в Github в рамках Рабочей группы по руководствам по доступности</a>. Пока этот вопрос не решен окончательно, клавишные комбинации на фокусированных видео не должны оцениваться как ошибка.</p>"
}