{
  "_STEP_6_2_3_NAME_": "Интероперабельность текстовой коммуникации в реальном времени",
  "_STEP_6_2_3_WHAT_CHECKED_1_": "<p>Веб-приложения, которые (часто в дополнение к голосовой связи) поддерживают текстовую коммуникацию в реальном времени (RTT, Real-Time Text) с другими приложениями, должны поддерживать интероперабельность, то есть соответствующие технические стандарты ITU, IETF или ETSI для текстовой коммуникации в реальном времени.</p>",
  "_STEP_6_2_3_WHY_CHECKED_1_": "<p>Когда веб-приложения, которые предлагают текстовую коммуникацию в реальном времени (RTT) в дополнение к голосовой связи, взаимодействуют с другими подобными приложениями, механизмы текстовой коммуникации должны работать одинаково с обеих сторон. Это касается, например, отображения недоставленных или неправильно переданных символов. Это гарантируется, если обе стороны поддерживают соответствующие технические стандарты ITU, IETF или ETSI. Если веб-приложение использует собственные механизмы для RTT, они могут не работать при взаимодействии с другими приложениями, поддерживающими RTT.</p>",
  "_STEP_6_2_3_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость проверки</h3>",
  "_STEP_6_2_3_HOW_CHECKED_2_": "<p>Этот шаг проверки применим, если веб-приложение поддерживает текстовую коммуникацию в реальном времени и потенциально может взаимодействовать с другим программным обеспечением, поддерживающим такую коммуникацию.</p>",
  "_STEP_6_2_3_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_6_2_3_HOW_CHECKED_4_": "<p>Проконсультироваться с документацией веб-приложения или с поставщиком веб-приложения. Поддерживаются ли (в зависимости от технической реализации) соответствующие актуальные технические стандарты для текстовой коммуникации в реальном времени?</p>",
  "_STEP_6_2_3_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_6_2_3_HOW_CHECKED_6_": "<ul><li><p>При текстовой коммуникации в реальном времени (RTT) текст появляется у получателя динамично уже во время ввода отправителем. RTT не то же самое, что чат, где сообщения отправляются явно и появляются у получателя только после этого.</p></li><li><p>При оценке поддержки стандартов необходимо учитывать текущее развитие стандартов. Возможно, что теперь стандартные стандарты для метода связи изменились.</p></li></ul>",
  "_STEP_6_2_3_HOW_CHECKED_7_": "<p>EN 301 549 V3.2.1 называет следующие стандарты, применимые в зависимости от технической реализации:</p>",
  "_STEP_6_2_3_HOW_CHECKED_8_": "<ul><li><p>Веб-приложение общается через общедоступную телефонную сеть: используются рекомендации ITU-T V.18 [i.23] или стандарты текстовой телефонии в приложениях.</p></li><li><p>Voice over IP (VoIP) через протокол инициации сеанса (SIP): используются рекомендации IETF по текстовой коммуникации в реальном времени RFC 4103 [i.13].</p></li><li><p>Веб-приложение использует Voice over IP (VoIP) через IP Multimedia Sub-System (IMS): здесь применимы протоколы ETSI TS 126 114 [i.10], ETSI TS 122 173 [i.11] и ETSI TS 134 229 [i.12].</p></li><li><p>Если используются другие методы связи: поддерживаются общие, актуальные и опубликованные стандарты. При этом общий стандарт поддерживает отображение потерянных и ошибочно переданных символов.</p></li></ul>",
  "_STEP_6_2_3_SOURCES_1_": "<ul><li><p><a href=\"https://labs.etsi.org/rep/HF/en301549/uploads/272bede3724c5c99efe777f778201f70/tr_103708v010101p.pdf\">Human Factors (HF); Real-Time Text (RTT) in Multiparty Conference Calling / ETSI TR 103 708 V1.1.1 (2022-08)</a></p></li></ul>",
  "_STEP_6_2_3_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_6_2_3_CLASSIFICATION_2_": "<h4 id=\"_6_2_3_interoperability\">6.2.3 Интероперабельность</h4>",
  "_STEP_6_2_3_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where ICT with RTT functionality interoperates with other ICT with RTT functionality (as required by clause 6.2.1.1) they shall support the applicable RTT interoperability mechanisms described below:</p><ul><li><p>(a) ICT interoperating with other ICT directly connected to the Public Switched Telephone Network (PSTN), using Recommendation ITU-T V.18 [i.23] or any of its annexes for text telephony signals at the PSTN interface;</p></li><li><p>(b) ICT interoperating with other ICT using VOIP with Session Initiation Protocol (SIP) and using RTT that conforms to IETF RFC 4103 [i.13]. For ICT interoperating with other ICT using the IP Multimedia Sub-System (IMS) to implement VOIP, the set of protocols specified in ETSI TS 126 114 [i.10], ETSI TS 122 173 [i.11] and ETSI TS 134 229 [i.12] describe how IETF RFC 4103 [i.13] would apply;</p></li><li><p>(c) ICT interoperating with other ICT using technologies other than a or b, above, using a relevant and applicable common specification for RTT exchange that is published and available for the environments in which they will be operating. This common specification shall include a method for indicating loss or corruption of characters.</p></li><li><p>(d) ICT interoperating with other ICT using a standard for RTT that has been introduced for use in any of the above environments, and is supported by all of the other active ICT that support voice and RTT in that environment.</p></li></ul><p>NOTE 1: In practice, new standards are introduced as an alternative codec/protocol that is supported alongside the existing common standard and used when all end-to-end components support it while technology development, combined with other reasons including societal development and cost efficiency, may make others become obsolete.</p><p>NOTE 2: Where multiple technologies are used to provide voice communication, multiple interoperability mechanisms may be needed to ensure that all users are able to use RTT.</p><p>EXAMPLE: A conferencing system that supports voice communication through an internet connection might provide RTT over an internet connection using a proprietary RTT method (option c). However, regardless of whether the RTT method is proprietary or non-proprietary, if the conferencing system also offers telephony communication it will also need to support options a or b to ensure that RTT is supported over the telephony connection.</p></div></div>"
}