{
  "_STEP_11_8_2_NAME_": "Создание доступного контента",
  "_STEP_11_8_2_NAME_MENU_": "11.8.2 Создание доступного контента",
  "_STEP_11_8_2_WHAT_CHECKED_1_": "<p>Если тестируемое веб-приложение является инструментом автора, оно должно позволять создавать доступные документы и поддерживать пользователя в этом процессе.</p>",
  "_STEP_11_8_2_WHY_CHECKED_1_": "<p>Для пользователей средств помощи, которым необходима программная определенность информации, важно, чтобы инструменты авторов поддерживали это при создании контента. Например, если поле для комментариев позволяет назначить заголовок, он должен быть помечен как заголовок на созданной (или обновленной) странице, чтобы пользователи средств помощи могли интерпретировать эту семантическую информацию (например, для навигации от комментария к комментарию).</p>",
  "_STEP_11_8_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_11_8_2_HOW_CHECKED_2_": "<p>Этап проверки применим при проверке инструментов автора, таких как системы управления контентом. Также применим к функциям комментирования, которые позволяют структурировать комментарии, например, назначение заголовка комментария или функции внутренней разметки комментария, такие как списки или выделение текста.</p>",
  "_STEP_11_8_2_HOW_CHECKED_3_": "<p>Проверка в первую очередь относится к выводу соответствующего инструмента автора.</p>",
  "_STEP_11_8_2_HOW_CHECKED_4_": "<p>Тип документа, создаваемого инструментом автора, должен быть оптимизирован для доступности, в противном случае этот этап проверки не применим. Это обычно возможно для систем управления веб-контентом и функций комментирования.</p>",
  "_STEP_11_8_2_HOW_CHECKED_5_": "<p>Вывод инструмента автора должен отображаться в веб-среде. Могут быть проверены только инструменты автора, которые генерируют HTML-вывод, доступный для проверки, например, в предварительном просмотре. Кроме того, могут быть проверены интегрированные во фронтенд инструменты, такие как редакторы комментариев, результаты работы которых можно проверить либо немедленно, либо после утверждения. Более сложные инструменты автора, такие как текстовые процессоры, в настоящее время не могут быть проверены в рамках BITV-Test, поскольку в этой процедуре не проверяется доступность файлов, созданных инструментом.</p>",
  "_STEP_11_8_2_HOW_CHECKED_6_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_11_8_2_HOW_CHECKED_7_": "<ol><li><p>Сгенерировать вывод на странице с использованием инструмента автора (например, функции комментирования) и, при необходимости, утвердить его.</p></li><li><p>Проверить созданную HTML-страницу. На представление применимы все соответствующие этапы проверки. Некоторые примеры:</p><ul><li><p>Заголовки, заданные в инструменте автора, должны быть помечены в выводе с использованием разметки заголовков (а не выделения жирным или стилей CSS)</p></li><li><p>Списки, созданные в инструменте автора, должны быть помечены в выводе с использованием разметки списков (а не псевдо-списков с предварительно стоящими тире)</p></li><li><p>Абзацы, заданные в инструменте автора, должны быть помечены в выводе с использованием разметки абзацев (а не div)</p></li><li><p>Выделения текста, заданные в инструменте автора, должны быть помечены в выводе с использованием семантических элементов, таких как strong или em.</p></li><li><p>Если инструмент автора позволяет вставлять изображения, должна быть возможность определения альтернативного текста для изображения. Альтернативный текст должен быть принят как атрибут alt.</p></li></ul></li></ol>",
  "_STEP_11_8_2_HOW_CHECKED_8_": "<h3 id=\"_3_hinweise\">3. Советы</h3>",
  "_STEP_11_8_2_HOW_CHECKED_9_": "<ul><li><p>Этап проверки не требует предоставления определенных семантических реализаций. Например, если функция комментирования не позволяет пользователям назначать заголовок, это здесь не оценивается негативно. Здесь не возникает недостатка по сравнению с видящими пользователями, у которых также нет заголовка. Однако в случае с изображениями: если можно вставить изображение, возникает недостаток для невизуальных пользователей, если одновременно нельзя определить альтернативный текст, описывающий содержание изображения.</p></li><li><p>Инструмент автора может зависеть от других инструментов для создания доступных документов, чтобы удовлетворить определенные критерии. Это может быть, например, дополнительный инструмент для создания субтитров.</p></li></ul>",
  "_STEP_11_8_2_HOW_CHECKED_10_": "<p>Если у вас есть комментарии по оформлению этого этапа проверки, вы можете <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">создать задачу для этого этапа проверки на GitHub</a>.</p>",
  "_STEP_11_8_2_SOURCES_1_": "<ul><li><p>В настоящее время нет источников.</p></li></ul>",
  "_STEP_11_8_2_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_11_8_2_CLASSIFICATION_2_": "<h4 id=\"_11_8_2_accessible_content_creation\">11.8.2 Создание доступного контента</h4>",
  "_STEP_11_8_2_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Authoring tools shall enable and guide the production of content that conforms to clauses 9 (Web content) or 10 (Non-Web content) as applicable.</p><p>NOTE: Authoring tools may rely on additional tools where conformance with specific requirements is not achievable by a single tool. For example, a video editing tool may enable the creation of video files for distribution via broadcast television and the web, but authoring of caption files for multiple formats may be provided by a different tool.</p></div></div>"
}