{
  "_STEP_6_1_NAME_": "Ширина полосы пропускания аудио для речи",
  "_STEP_6_1_WHAT_CHECKED_1_": "<p>Для обеспечения хорошей разборчивости речи при двусторонней голосовой коммуникации веб-приложение должно использовать при кодировании и декодировании аудио диапазон частот, верхний предел которого достигает как минимум 7 000 Гц.</p>",
  "_STEP_6_1_WHAT_CHECKED_2_": "<p>Для того чтобы веб-приложение прошло этот этап проверки, оно должно предоставлять как минимум HD-телефонию / телефонию качества ISDN. Для этого может использоваться, например, широко распространенный кодек G.722.</p>",
  "_STEP_6_1_WHY_CHECKED_1_": "<p>Хорошее качество речи особенно важно для людей с нарушениями слуха. Поэтому здесь устанавливается обязательный минимальный стандарт для качества аудио.</p>",
  "_STEP_6_1_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_6_1_HOW_CHECKED_2_": "<p>Этап проверки применим, если веб-приложение предоставляет функцию двусторонней голосовой коммуникации.</p>",
  "_STEP_6_1_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_6_1_HOW_CHECKED_4_": "<ol><li><p>Оценить качество голосовой связи в ходе практического теста. Соответствует ли качество качеству современной стационарной телефонии? При этом необходимо убедиться, что интернет-соединение на обоих концах не нарушено. При необходимости тест следует повторить.</p></li><li><p>Если тест на слух не дает четкого результата, следует проконсультироваться с документацией программного обеспечения. Здесь должен быть указан используемый кодек. При необходимости следует обратиться к производителю веб-приложения.</p></li><li><p>Затем следует исследовать кодек, чтобы узнать диапазон его частот. Верхний предел диапазона частот должен достигать как минимум 7 000 Гц.</p></li></ol>",
  "_STEP_6_1_SOURCES_1_": "<ul><li><p>В настоящее время нет источников.</p></li></ul>",
  "_STEP_6_1_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_6_1_CLASSIFICATION_2_": "<h4 id=\"_6_1_audio_bandwidth_for_speech\">6.1 Ширина полосы пропускания аудио для речи</h4>",
  "_STEP_6_1_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where ICT provides two-way voice communication, in order to provide good audio quality, that ICT shall be able to encode and decode two-way voice communication with a frequency range with an upper limit of at least 7 000 Hz.</p><p>NOTE 1: For the purposes of interoperability, support of Recommendation ITU-T G.722 [i.21] is widely used.</p><p>NOTE 2: Where codec negotiation is implemented, other standardized codecs such as Recommendation ITU-T G.722.2 [i.22] are sometimes used so as to avoid transcoding.</p></div></div>"
}