{
  "_STEP_9_2_5_3_NAME_": "Sichtbare Beschriftung Teil des zugänglichen Namens",
  "_STEP_9_2_5_3_NAME_MENU_": "9.2.5.3 Sichtbare Beschriftung Teil des zugänglichen Namens",
  "_STEP_9_2_5_3_WHAT_CHECKED_1_": "<p>Sichtbare Beschriftungen von Bedienelementen sollen im zugänglichen Name des Bedienelements vorkommen. Dies betrifft zum Beispiel Links, Beschriftungen von Textfeldern, Buttons oder Checkboxen.</p>",
  "_STEP_9_2_5_3_WHY_CHECKED_1_": "<p>Spracheingabenutzer können Bedienelemente wie Links, Tasten oder Eingabefelder aktivieren, indem sie den sichtbaren Namen sagen, auch in der Verbindung mit Befehlen (z. B. <em>Klick \"Abschicken\"</em>). Wenn die sichtbare Beschriftung nicht in dem hinterlegten zugänglichen Namen des Bedienelements (also dem Text, der programmatisch als Beschriftung ermittelt wird) vorkommt, lässt sich das Bedienelement gegebenenfalls nicht oder nur über Umwege mittels Spracheingabe aktivieren.</p>",
  "_STEP_9_2_5_3_WHY_CHECKED_2_": "<p>Bedienelemente haben manchmal einen zugänglichen Namen, der von der sichtbaren Beschriftung abweicht, weil er über nicht sichtbare Attribute wie <code>aria-label</code> oder über nur bei Mausnutzung eingeblendete Attribute wie <code>title</code> festgelegt wird. So könnte etwa die sichtbare Beschriftung \"AGB akzeptieren\" durch den hinterlegten zugänglichen Namen \"Allgemeine Geschäftsbedingungen annehmen\" ersetzt werden. Wenn Spracheingabenutzer nun Klicke \"AGB akzeptieren\" diktieren, kommt dieser Text so nicht im zugänglichen Namen vor, die Eingabe schlägt deshalb fehl.</p>",
  "_STEP_9_2_5_3_WHY_CHECKED_3_": "<p>Manchmal wird versteckter Text benutzt, um sichtbare Beschriftungen zu erweitern, oft auch in der Absicht, Hilfsmittelnutzern zu helfen. Das ist dann in Ordnung, wenn die sichtbare Beschriftung durchgehend in dem zugänglichen Namen enthalten ist, am besten zu Beginn.</p>",
  "_STEP_9_2_5_3_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_2_5_3_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar auf Bedienelemente, die entweder sich selbst beschriften (Links, Tasten) oder einem Bedienelement wie einem Texteingabefeld oder einer Checkbox direkt zugeordnet sind.</p>",
  "_STEP_9_2_5_3_HOW_CHECKED_3_": "<p>Auf Bedienelemente, die durch mehrere sichtbare Elemente beschriftet sind, ist der Prüfschritt nicht anwendbar, so wenn Elemente über eine tabellarische Matrix über Beschriftungen in Spalten- und Zeilenüberschriften ihren zugänglichen Namen empfangen. In diesen Fällen ist es für den Spracheingabe-Nutzer unklar, welche Elemente als Beschriftung des Bedienelements gelten und dementsprechend für ein Diktat per Spracheingabe benutzt werden sollten.</p>",
  "_STEP_9_2_5_3_HOW_CHECKED_4_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_2_5_3_HOW_CHECKED_5_": "<p>Für jedes Bedienelement, das sich selbst beschriftet oder durch einen einfachen zugeordneten Text beschriftet ist, prüfen, ob der Text in der gleichen Form im zugänglichen Namen des Bedienelements vorkommt.</p>",
  "_STEP_9_2_5_3_HOW_CHECKED_6_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_9_2_5_3_HOW_CHECKED_7_": "<p>Verwenden Sie einen Screenreader, die Entwickler-Werkzeuge des Browsers oder ein anderes Tool (etwa ein Bookmarklet), um den zugänglichen Namen jedes Bedienelements für den Vergleich mit dem Text der sichtbaren Beschriftung zu ermitteln (Beachten Sie, dass die Screenreader-Ausgabe Informationen enthalten kann, die nicht Teil des zugänglichen Namens sind, zum Beispiel die Rolle des Bedienelements oder eine zusätzliche Beschreibung).</p>",
  "_STEP_9_2_5_3_HOW_CHECKED_8_": "<p>Der zugängliche Name des Bedienelements kann zusätzlichen Text enthalten, aber die Zeichenkette der Beschriftung sollte in der gleichen Form in der Zeichenkette des zugänglichen Namens enthalten sein.</p>",
  "_STEP_9_2_5_3_HOW_CHECKED_9_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_9_2_5_3_HOW_CHECKED_10_": "<p>Der Prüfschritt ist erfüllt, wenn der Beschriftungstext in der gleichen Form im zugänglichen Namen vorkommt.</p>",
  "_STEP_9_2_5_3_SOURCES_1_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/label-in-name\"> Understanding Success Criterion 2.5.3: Label in Name</a> (zur Zeit nur auf Englisch verfügbar)</p></li><li><p>Accessible Name and Description Computation: <a href=\"https://www.w3.org/TR/accname/#mapping_additional_nd_te\" class=\"bare\">https://www.w3.org/TR/accname/#mapping_additional_nd_te</a> (zur Zeit nur auf Englisch verfügbar)</p></li></ul>",
  "_STEP_9_2_5_3_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_2_5_3_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Guideline</h4>",
  "_STEP_9_2_5_3_CLASSIFICATION_3_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#input-modalities\"> Guideline 2.5 Input Modalities: Make it easier for users to operate functionality through various inputs beyond keyboard</a></p></li></ul>",
  "_STEP_9_2_5_3_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Success criterion</h4>",
  "_STEP_9_2_5_3_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#label-in-name\"> 2.5.3 Label in Name</a> (Level A)</p></li></ul>",
  "_STEP_9_2_5_3_CLASSIFICATION_6_": "<h4 id=\"_sufficient_techniques\">Sufficient Techniques</h4>",
  "_STEP_9_2_5_3_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G208\"> G208: Including the text of the visible label as part of the accessible name</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G211\"> G211: Matching the accessible name to the visible label</a></p></li></ul>",
  "_STEP_9_2_5_3_CLASSIFICATION_8_": "<h4 id=\"_failures\">Failures</h4>",
  "_STEP_9_2_5_3_CLASSIFICATION_9_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F96\"> F96: Failure due to the accessible name not containing the visible label text</a></p></li></ul>"
}
