{
  "_STEP_9_2_5_3_NAME_": "Видимые метки являются частью доступного названия",
  "_STEP_9_2_5_3_WHAT_CHECKED_1_": "<p>Видимые метки элементов управления должны входить в доступное название элемента. Это касается, например, ссылок, меток текстовых полей, кнопок или чекбоксов.</p>",
  "_STEP_9_2_5_3_WHY_CHECKED_1_": "<p>Пользователи голосового ввода могут активировать элементы управления, такие как ссылки, кнопки или поля ввода, произнося видимое название, также в сочетании с командами (например, <em>нажмите \"Отправить\"</em>). Если видимая метка не входит в доступное название элемента управления (то есть в текст, который программно определяется как метка), возможно, элемент управления не удастся активировать с помощью голосового ввода или это будет затруднительно.</p>",
  "_STEP_9_2_5_3_WHY_CHECKED_2_": "<p>Иногда у элементов управления есть доступное название, которое отличается от видимой метки, потому что оно устанавливается через невидимые атрибуты, такие как <code>aria-label</code>, или через атрибуты, видимые только при использовании мыши, такие как <code>title</code>. Так, видимая метка \"Принять условия\" может быть заменена доступным названием \"Принять общие условия соглашения\". Если пользователь голосового ввода скажет \"Кликнуть 'Принять условия'\", этот текст не встречается в доступном названии, и команда не выполнится.</p>",
  "_STEP_9_2_5_3_WHY_CHECKED_3_": "<p>Иногда используется скрытый текст для расширения видимых меток, часто с намерением помочь пользователям с ограниченными возможностями. Это приемлемо, если видимая метка постоянно входит в доступное название, лучше всего — в начале.</p>",
  "_STEP_9_2_5_3_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_9_2_5_3_HOW_CHECKED_2_": "<p>Этап проверки применим к элементам управления, которые самостоятельно маркируются (ссылки, кнопки) или непосредственно связаны с элементом управления, например, текстовым полем или чекбоксом.</p>",
  "_STEP_9_2_5_3_HOW_CHECKED_3_": "<p>Этап проверки не применим к элементам управления, которые маркируются несколькими видимыми элементами, например, когда элементы получают свое доступное название через табличную матрицу с метками в заголовках столбцов и строк. В этих случаях для пользователя голосового ввода неясно, какие элементы считаются меткой элемента управления и соответственно должны использоваться для диктовки через голосовой ввод.</p>",
  "_STEP_9_2_5_3_HOW_CHECKED_4_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_2_5_3_HOW_CHECKED_5_": "<p>Для каждого элемента управления, который самомаркируется или маркируется простым связанным текстом, проверить, входит ли текст в той же форме в доступное название элемента управления.</p>",
  "_STEP_9_2_5_3_HOW_CHECKED_6_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_9_2_5_3_HOW_CHECKED_7_": "<p>Используйте скринридер, инструменты разработчика браузера или другой инструмент (например, букмарклет), чтобы определить доступное название каждого элемента управления для сравнения с текстом видимой метки (учтите, что вывод скринридера может содержать информацию, которая не является частью доступного названия, например, роль элемента управления или дополнительное описание).</p>",
  "_STEP_9_2_5_3_HOW_CHECKED_8_": "<p>Доступное название элемента управления может содержать дополнительный текст, но строка метки должна в той же форме входить в строку доступного названия.</p>",
  "_STEP_9_2_5_3_HOW_CHECKED_9_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_2_5_3_HOW_CHECKED_10_": "<p>Этап проверки считается выполненным, если текст метки в той же форме входит в доступное название.</p>",
  "_STEP_9_2_5_3_SOURCES_1_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/label-in-name\">Понимание критерия успеха 2.5.3: Метка в названии</a> (в настоящее время доступно только на английском)</p></li><li><p>Вычисление доступного названия и описания: <a href=\"https://www.w3.org/TR/accname/#mapping_additional_nd_te\" class=\"bare\">https://www.w3.org/TR/accname/#mapping_additional_nd_te</a> (в настоящее время доступно только на английском)</p></li></ul>",
  "_STEP_9_2_5_3_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация этапа проверки по WCAG 2.1</h3>",
  "_STEP_9_2_5_3_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Рекомендация</h4>",
  "_STEP_9_2_5_3_CLASSIFICATION_3_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#input-modalities\">Рекомендация 2.5 Ввод: Облегчение использования функциональности через различные входные данные помимо клавиатуры</a></p></li></ul>",
  "_STEP_9_2_5_3_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Критерий успеха</h4>",
  "_STEP_9_2_5_3_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#label-in-name\">2.5.3 Метка в названии</a> (Уровень A)</p></li></ul>",
  "_STEP_9_2_5_3_CLASSIFICATION_6_": "<h4 id=\"_sufficient_techniques\">Достаточные техники</h4>",
  "_STEP_9_2_5_3_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G208\">G208: Включение текста видимой метки как части доступного названия</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G211\">G211: Соответствие доступного названия видимой метке</a></p></li></ul>",
  "_STEP_9_2_5_3_CLASSIFICATION_8_": "<h4 id=\"_failures\">Отказы</h4>",
  "_STEP_9_2_5_3_CLASSIFICATION_9_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F96\">F96: Отказ из-за того, что доступное название не содержит текст видимой метки</a></p></li></ul>"
}