{
  "_STEP_9_3_2_1_NAME_": "Keine unerwartete Kontextänderung bei Fokus",
  "_STEP_9_3_2_1_WHAT_CHECKED_1_": "<p>Wenn irgendeine Komponente der Seite den Fokus erhält, soll dies nicht zu einer unerwarteten Kontextänderung führen.</p>",
  "_STEP_9_3_2_1_WHY_CHECKED_1_": "<p>Unerwartete und unangekündigte Kontextänderungen bei Fokussierung einer Komponente (z. B. das automatische Abschicken von Formularen), kann die Orientierung von Nutzenden beeinträchtigen. Kontextänderungen auf der Seite selbst können Nutzende ablenken und verwirren oder auch unbemerkt bleiben und dadurch für Verwirrung sorgen. Sie sollten deshalb erwartet und klar nachvollziehbar sein.</p>",
  "_STEP_9_3_2_1_WHY_CHECKED_2_": "<p>Das Öffnen neuer Fenster bei Fokussierung einer Komponente oder beim Laden einer Seite kann die Orientierung der Nutzenden ebenfalls beeinträchtigen. Das gilt ganz besonders für blinde und sehbehinderte Nutzende. Sie bemerken möglicherweise nicht, dass sich der Kontext geändert hat. Wenn das neue Fenster den Fokus erhält, funktioniert der Zurück-Button des Browsers nicht mehr. Der Überblick kann verloren gehen, möglicherweise wird dann versehentlich das falsche Fenster (mit der Historie der bislang besuchten Seiten) geschlossen.</p>",
  "_STEP_9_3_2_1_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_3_2_1_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn der Webauftritt interaktive Elemente enthält.</p>",
  "_STEP_9_3_2_1_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_3_2_1_HOW_CHECKED_4_": "<ol><li><p>Seite im <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\"> Firefox</a> aufrufen. Das Laden der Seite sollte kein neues Fenster öffnen.</p></li><li><p>Mit der Tabulatortaste die Links und Formularelemente durchgehen.</p></li><li><p>Der Fokuserhalt soll keine automatischen Kontextänderungen (etwa Pop-up-Fenster oder automatisches Abschicken von Formularen) auslösen.</p></li></ol>",
  "_STEP_9_3_2_1_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_9_3_2_1_HOW_CHECKED_6_": "<p>Der Prüfschritt bezieht sich nur auf neue Browserfenster, nicht auf skriptgesteuerte Seiten-Elemente, die den Inhalt überlagern (Stichwort modaler Dialog).</p>",
  "_STEP_9_3_2_1_HOW_CHECKED_7_": "<p>Das Öffnen von Custom Tooltips, also nicht modalen Fenstern, die sich beim Weitertabben oder Mausklick selbständig schließen, gilt dabei nicht als Kontextänderung.</p>",
  "_STEP_9_3_2_1_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_3_2_1_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Guideline</h4>",
  "_STEP_9_3_2_1_CLASSIFICATION_3_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#predictable\"> Guideline 3.2 Predictable: Make Web pages appear and operate in predictable ways.</a></p></li></ul>",
  "_STEP_9_3_2_1_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Success criterion</h4>",
  "_STEP_9_3_2_1_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#on-focus\"> 3.2.1 On Focus</a> (Level A)</p></li></ul>",
  "_STEP_9_3_2_1_CLASSIFICATION_6_": "<h4 id=\"_techniques\">Techniques</h4>",
  "_STEP_9_3_2_1_CLASSIFICATION_7_": "<h5 id=\"_general_techniques\">General Techniques</h5>",
  "_STEP_9_3_2_1_CLASSIFICATION_8_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G107.html\"> G107: Using \"activate\" rather than \"focus\" as a trigger for changes of context</a></p></li></ul>",
  "_STEP_9_3_2_1_CLASSIFICATION_9_": "<h5 id=\"_advisory_techniques\">Advisory Techniques</h5>",
  "_STEP_9_3_2_1_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G200.html\"> G200: Opening new windows and tabs from a link only when necessary</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G201.html\"> G201: Giving users advanced warning when opening a new window</a></p></li></ul>",
  "_STEP_9_3_2_1_CLASSIFICATION_11_": "<h5 id=\"_failures\">Failures</h5>",
  "_STEP_9_3_2_1_CLASSIFICATION_12_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F52.html\"> F52: Failure of Success Criterion 3.2.1 due to opening a new window as soon as a new page is loaded</a></p></li></ul>",
  "_STEP_9_3_2_1_QUESTIONS_1_": "<h3 id=\"_der_prüfschritt_bezieht_sich_nur_auf_das_öffnen_neuer_fenster_beim_laden_der_seite_erlaubt_die_bitv_2_0_jetzt_das_unangekündigte_öffnen_von_neuen_fenstern_über_links\">Der Prüfschritt bezieht sich nur auf das Öffnen neuer Fenster beim Laden der Seite, erlaubt die BITV 2.0 jetzt das unangekündigte Öffnen von neuen Fenstern über Links?</h3>",
  "_STEP_9_3_2_1_QUESTIONS_2_": "<p>Die WCAG empfehlen in den <em>Advisory Techniques</em> <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G200.html\"> G200</a> und <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G201.html\"> G201</a>, das Öffnen neuer Fenster auf Fälle zu beschränken, in denen das aus einer Zugänglichkeitsperspektive sinnvoll ist und Benutzer zuvor über das Öffnen eines neuen Fensters zu informieren (etwa als Teil des Links, der das Fenster öffnet).</p>",
  "_STEP_9_3_2_1_QUESTIONS_3_": "<p>Das unangekündigte Öffnen neuer Fenster bei der Aktivierung von Links wird jedoch grundsätzlich akzeptiert. Dies ist dadurch gerechtfertigt, das moderne Benutzeragenten Einstellungsmöglichkeiten für den Umgang mit automatisch öffnenden Fenstern bieten. In den meisten aktuellen Browser-Versionen lässt sich inzwischen festlegen, ob neue Fenster also zusätzliches Browser-Fenster oder in einem Tab (Registrierkarte) geöffnet werden sollen oder ob unangekündigte Fenster grundsätzlich unterdrückt werden sollen (Stichwort Popup-Blocker). Einige Browser (Firefox) erlauben auch die Festlegung, ob neue Tabs im Vordergrund geöffnet werden sollen (also den Fokus erhalten sollen) oder nicht.</p>"
}