{
  "_STEP_9_2_1_1_NAME_": "Использование без мыши",
  "_STEP_9_2_1_1_NAME_MENU_": "9.2.1.1 Использование без мыши",
  "_STEP_9_2_1_1_WHAT_CHECKED_1_": "<p>Веб-сайт должен быть доступен для управления без использования мыши, то есть исключительно с помощью клавиатуры.</p>",
  "_STEP_9_2_1_1_WHY_CHECKED_1_": "<p>Управление должно быть независимым от устройства. Это означает, что оно должно быть возможным как с помощью мыши, так и с клавиатуры. Потому что другие специальные устройства ведут себя как мышь или как клавиатура.</p>",
  "_STEP_9_2_1_1_WHY_CHECKED_2_": "<p>Проблемы чаще всего возникают с управлением с помощью клавиатуры, так как большинство пользователей интернета используют мышь, поэтому часто думают только об этом.</p>",
  "_STEP_9_2_1_1_WHY_CHECKED_3_": "<p>На управление с помощью клавиатуры полагаются, например, многие люди с ограниченными физическими возможностями или слепые.</p>",
  "_STEP_9_2_1_1_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_9_2_1_1_HOW_CHECKED_2_": "<p>Этап проверки применим, если веб-сайт содержит интерактивные элементы.</p>",
  "_STEP_9_2_1_1_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_2_1_1_HOW_CHECKED_4_": "<ol><li><p>Открыть страницу в браузере Firefox.</p></li><li><p>Используя клавишу Tab, пройти по ссылкам и элементам форм.</p></li><li><p>Проверить, можно ли достичь и использовать все основные ссылки и элементы форм.</p></li><li><p>Если на странице есть элементы, которые выглядят как элементы управления, но не могут быть выбраны с помощью клавиши Tab, проверить, реагируют ли эти элементы на мышь (например, движение, увеличение, отображение дополнительного содержимого).</p></li><li><p>Если на странице есть прокручиваемые области, убедиться, что содержимое этих областей доступно также с помощью клавиатуры.</p></li><li><p>Открыть страницу в браузере Chrome и повторить шаги с 2 по 5.</p></li></ol>",
  "_STEP_9_2_1_1_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_9_2_1_1_HOW_CHECKED_6_": "<h4 id=\"_3_1_allgemeine_hinweise\">3.1 Общие замечания</h4>",
  "_STEP_9_2_1_1_HOW_CHECKED_7_": "<ul><li><p>Проверяющие должны быть знакомы с функциональностью используемых браузеров, они должны знать, какие клавиши и комбинации клавиш предназначены для управления с клавиатуры.</p></li><li><p>Проблемы с управлением обычно вызваны использованием JavaScript. Таким образом, проверка должна проводиться с включенным JavaScript.</p></li><li><p>Не имеют значения, например, функции, которые уже предлагаются самим браузером (например, \"закрыть окно\").</p></li><li><p>Также проверяется управление с клавиатуры элементами без выделения фокуса. Для отображения фокуса можно использовать подходящее bookmarklet, например, Force Show Keyboard Focus.</p></li></ul>",
  "_STEP_9_2_1_1_HOW_CHECKED_8_": "<p>Важно в этом контексте:</p>",
  "_STEP_9_2_1_1_HOW_CHECKED_9_": "<ul><li><p>Если окно браузера не имеет фокуса, нельзя просто щелкнуть по нему, а затем начать управление с помощью клавиатуры. Фокус должен быть перемещен в окно браузера с помощью клавиатуры (F6).</p></li><li><p>Выпадающие списки без кнопки отправки, реагирующие на событие \"onchange\", могут быть управляемы только с помощью клавиш со стрелками, так как всегда активируется первая опция списка. Чтобы пролистать такие списки, их сначала нужно открыть с помощью комбинации клавиш \"Alt + стрелка вниз\". Затем можно перемещаться по опциям с помощью стрелок вверх и вниз и выбирать опцию с помощью клавиши ввода.</p></li><li><p>Управление с помощью клавиатуры не должно точно соответствовать управлению с помощью мыши. Например, не является недостатком, если с помощью мыши можно вызвать глубокие ссылки в выпадающих меню за один шаг, а с помощью клавиатуры для вызова соответствующих страниц требуется несколько шагов.</p></li></ul>",
  "_STEP_9_2_1_1_HOW_CHECKED_10_": "<p>Некоторые элементы могут быть активированы, возможно, только при включенном скринридере NVDA (или только при дополнительном нажатии клавиши <code>alt</code>). Это обычно связано с неправильной разметкой ARIA и оценивается на этапе проверки 9.4.1.2 \"Name, Role, Value Available\".</p>",
  "_STEP_9_2_1_1_HOW_CHECKED_11_": "<h4 id=\"_3_2_hinweis_zu_drag_and_drop_funktionen\">3.2 Замечание о функциях перетаскивания</h4>",
  "_STEP_9_2_1_1_HOW_CHECKED_12_": "<p>Для важных функций управления, которые доступны с помощью перетаскивания, должны быть предложены альтернативы, доступные с помощью клавиатуры.</p>",
  "_STEP_9_2_1_1_HOW_CHECKED_13_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_2_1_1_HOW_CHECKED_14_": "<h4 id=\"_erfüllt\">Выполнено:</h4>",
  "_STEP_9_2_1_1_HOW_CHECKED_15_": "<ul><li><p>Все основное содержимое и функции доступны и управляемы в Firefox и Chrome в принципе.</p></li></ul>",
  "_STEP_9_2_1_1_HOW_CHECKED_16_": "<h4 id=\"_nicht_erfüllt\">Не выполнено:</h4>",
  "_STEP_9_2_1_1_HOW_CHECKED_17_": "<ul><li><p>Основное содержимое и функции в Firefox или Chrome с помощью клавиатуры не доступны или не управляемы.</p></li></ul>",
  "_STEP_9_2_1_1_SOURCES_1_": "<h3 id=\"_die_wcag_2_1_zur_tastaturbedienbarkeit\">WCAG 2.1 по управлению с помощью клавиатуры</h3>",
  "_STEP_9_2_1_1_SOURCES_2_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>If all functionality can be achieved using the keyboard, it can be accomplished by keyboard users, by speech input (which creates keyboard input), by mouse (using on-screen keyboards), and by a wide variety of assistive technologies that create simulated keystrokes as their output. No other input form has this flexibility or is universally supported and operable by people with different disabilities, as long as the keyboard input is not time-dependent.</p><p>Note that providing universal keyboard input does not mean that other types of input should not be supported. Optimized speech input, optimized mouse/pointer input, etc., are also good. The key is to provide keyboard input and control as well.</p><p>Some devices do not have native keyboards? for example, a PDA or cell phone. If these devices have a Web browsing capability, however, they will have some means of generating text or \"keystrokes.\" This guideline uses the term \"keyboard interface\" to acknowledge that Web content should be controlled from keystrokes that may come from a keyboard, keyboard emulator, or other hardware or software that generates keyboard or text input.</p></blockquote></div>",
  "_STEP_9_2_1_1_SOURCES_3_": "<p>(<a href=\"https://www.w3.org/WAI/WCAG21/Understanding/keyboard.html\"> Доступный с клавиатуры: Понимание руководящего принципа 2.1</a>)</p>",
  "_STEP_9_2_1_1_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Разграничение с другими этапами проверки</h3>",
  "_STEP_9_2_1_1_CLASSIFICATION_2_": "<ul><li><p>Этот этап проверки касается <strong>активации</strong> функций и ссылок также с помощью клавиатуры.</p></li><li><p><strong>Клавиатурные ловушки</strong> являются предметом этапа проверки 9.2.1.2 \"Без клавиатурной ловушки\".</p></li><li><p>Для элементов, генерируемых скриптами или отображаемых с помощью скриптов (например, раскрывающихся текстов или lightbox), <strong>логическая последовательность</strong> в исходном коде является предметом этапа проверки 9.1.3.2 \"Логическая последовательность\".</p></li><li><p><strong>Выделение фокуса</strong> является предметом этапа проверки 9.2.4.7 \"Четкая текущая позиция фокуса\".</p></li><li><p>В этом этапе проверки не играет роли последовательность фокуса, в которой ссылки и элементы формы активируются. <strong>Логическая последовательность фокуса</strong> оценивается в 9.2.4.3 \"Логическая последовательность при управлении с клавиатуры\".</p></li></ul>",
  "_STEP_9_2_1_1_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация этапа проверки по WCAG 2.1</h3>",
  "_STEP_9_2_1_1_CLASSIFICATION_4_": "<h4 id=\"_guideline\">Руководящий принцип</h4>",
  "_STEP_9_2_1_1_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#keyboard-accessible\"> Руководящий принцип 2.1 Доступный с клавиатуры: Сделать всю функциональность доступной с клавиатуры.</a></p></li></ul>",
  "_STEP_9_2_1_1_CLASSIFICATION_6_": "<h4 id=\"_success_criteria\">Критерии успеха</h4>",
  "_STEP_9_2_1_1_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#keyboard\"> 2.1.1 Клавиатура</a> (Уровень A)</p></li></ul>",
  "_STEP_9_2_1_1_CLASSIFICATION_8_": "<h4 id=\"_techniques\">Техники</h4>",
  "_STEP_9_2_1_1_CLASSIFICATION_9_": "<h5 id=\"_general_techniques\">Общие техники</h5>",
  "_STEP_9_2_1_1_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G90.html\"> G90: Обеспечение обработчиков событий, активируемых с клавиатуры</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G202.html\"> G202: Обеспечение управления клавиатурой для всей функциональности</a></p></li></ul>",
  "_STEP_9_2_1_1_CLASSIFICATION_11_": "<h5 id=\"_html_techniques\">Техники HTML</h5>",
  "_STEP_9_2_1_1_CLASSIFICATION_12_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H91.html\"> H91: Использование HTML-форм и ссылок</a></p></li></ul>",
  "_STEP_9_2_1_1_CLASSIFICATION_13_": "<h5 id=\"_scripting_techniques\">Техники скриптования</h5>",
  "_STEP_9_2_1_1_CLASSIFICATION_14_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/client-side-script/SCR2.html\"> SCR2: Использование избыточных обработчиков событий клавиатуры и мыши</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/client-side-script/SCR20.html\"> SCR20: Использование функций клавиатуры и других специфических для устройства функций</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/client-side-script/SCR27.html\"> SCR27: Перестановка разделов страницы с использованием объектной модели документа</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/client-side-script/SCR29.html\"> SCR29: Добавление действий, доступных с клавиатуры, к статическим HTML-элементам</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/client-side-script/SCR35.html\"> SCR35: Обеспечение доступности действий с клавиатуры с использованием события onclick у якорей и кнопок</a></p></li></ul>",
  "_STEP_9_2_1_1_CLASSIFICATION_15_": "<h5 id=\"_failures\">Неудачи</h5>",
  "_STEP_9_2_1_1_CLASSIFICATION_16_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F42.html\"> F42: Неудача критериев успеха 1.3.1 и 2.1.1 из-за использования событий скриптов для имитации ссылок таким образом, который не может быть программно определен</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F54.html\"> F54: Неудача критерия успеха 2.1.1 из-за использования только событий, специфичных для указывающего устройства (включая жест), для функции</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F55.html\"> F55: Неудача критериев успеха 2.1.1, 2.4.7 и 3.2.1 из-за использования скрипта для удаления фокуса, когда фокус получен</a></p></li></ul>"
}