{
  "_STEP_9_1_4_10_NAME_": "Inhalte brechen um",
  "_STEP_9_1_4_10_NAME_MENU_": "9.1.4.10 Inhalte brechen um",
  "_STEP_9_1_4_10_WHAT_CHECKED_1_": "<p>Seiten-Inhalte sollen bei einer Browserfensterbreite von 320 CSS-Pixeln (bzw. bei einer Browserfensterbreite von 1280 CSS-Pixeln und 400% Zoomvergrößerung) so umbrechen, dass alle Informationen und Funktionen verfügbar sind, ohne dass Nutzer horizontal scrollen müssen.</p>",
  "_STEP_9_1_4_10_WHAT_CHECKED_2_": "<p>Es wird dabei nicht verlangt, dass alle Inhalte in gleicher Weise in der responsiven Ansicht verfügbar sind. So sind die sichtbaren Navigationsmenüs einer Standard-Ansicht auf dem Desktop häufig nach dem Hereinzoomen (oder bei Nutzung des Angebots auf einem Smartphone-Bildschirm) nur über eine Ausklappnavigation zugänglich. Inhalte können auch in Ausklappbereichen oder über Links auf andere Seiten oder Ansichten verfügbar sein.</p>",
  "_STEP_9_1_4_10_WHAT_CHECKED_3_": "<p>Ausnahmen gelten für Inhalte, für deren Nutzung ein zweidimensionales Layout erforderlich ist, z. B. Bilder, Landkarten, Diagramme, Videos, Spiele, Präsentationen, Datentabellen und Anwendungs-Schnittstellen, in denen die Bearbeitung von Inhalten die permanente Verfügbarkeit von Werkzeugleisten erfordert.</p>",
  "_STEP_9_1_4_10_WHAT_CHECKED_4_": "<p><em>Hinweis</em>: Dieser Prüfschritt beschränkt sich auf Inhalte, deren primäre Schreibrichtung waagerecht ist, wie bei der für die meisten westlichen Sprachen benutzten lateinischen Schrift. Die zugrunde liegende WCAG-Anforderung gilt in ähnlicher Weise für Inhalte mit vertikaler Schreibrichtung.</p>",
  "_STEP_9_1_4_10_WHY_CHECKED_1_": "<p>Sehbehinderte Nutzer vergrößern häufig Seiten-Inhalte über die Zoomfunktion, die in gängigen Desktop-Browsern vorhanden ist. Über eine responsive Gestaltung mittels CSS media queries sollen Webseiten die Nutzung mit starkem Zoom durch eine dynamische Anpassung des Seiten-Umbruchs unterstützen.</p>",
  "_STEP_9_1_4_10_WHY_CHECKED_2_": "<p>Responsive Seiten-Layouts ordnen die Inhaltsblöcke neu an. Mehrspaltige Inhalte werden dabei meist so umbrochen, dass sie bei starkem Zoom einspaltig untereinander angeordnet sind. Bei Fließtexten entstehen auch neue Zeilenumbrüche mit kürzeren Zeilen.</p>",
  "_STEP_9_1_4_10_WHY_CHECKED_3_": "<p>Der Vorteil: Nutzer müssen beim Lesen nur in eine Richtung scrollen (bei westlichen Sprachen: vertikal). Wenn Zeilen bei Zoomvergrößerung nicht umgebrochen werden, sind Nutzer dagegen gezwungen, beim Lesen jeder Zeile horizontal hin- und her zu scrollen, was die Aufnahme der Inhalte sehr stark beeinträchtigt und verlangsamt.</p>",
  "_STEP_9_1_4_10_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_1_4_10_HOW_CHECKED_2_": "<p>Der Prüfschritt ist für Webinhalte anwendbar, wenn deren Ausgangsbasis für Zugänglichkeit die üblichen Desktop-Browser mit eingebauter Zoomfunktion einschließt. Er ist nicht anwendbar bei der Nutzung von Browsern mobiler Betriebssysteme, deren eingebaute Zoomvergrößerung (etwa über eine Spreizgeste) in der Regel keine Vergrößerung mit Inhaltsumbruch bieten.</p>",
  "_STEP_9_1_4_10_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_1_4_10_HOW_CHECKED_4_": "<h4 id=\"_2_1_prüfung_mit_320px_viewport_breite\">2.1 Prüfung mit 320px Viewport-Breite</h4>",
  "_STEP_9_1_4_10_HOW_CHECKED_5_": "<p>Die Prüfung bezieht sich auf Web-Inhalte mit horizontal verlaufender Schrift.</p>",
  "_STEP_9_1_4_10_HOW_CHECKED_6_": "<ol><li><p>Seite im <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#chrome\">Chrome Browser</a> öffnen.</p></li><li><p>Die <em>Developer Tools</em> rechts angedockt öffnen (über Funktionstaste F12, über die Tastenkombination Strg + Umschalttaste + I, oder über <em>Menü Einstellungen &gt; Weitere Tools &gt; Entwicklertools</em>) und die vertikale Abgrenzung zwischen Seiten- und Tool-Bereich ziehen, bis oben rechts im Seiten-Bereich <em>320px x (Viewporthöhe)</em> angezeigt wird (wird rechts ein Scrollbalken angezeigt, 14px dazuzählen, also <em>334px x Viewporthöhe</em> einstellen).</p></li><li><p>Seite neu laden.</p></li><li><p>Feststellen, ob Seiten-Inhalte so umbrechen, dass eine Nutzung ohne horizontales Scrollen möglich ist und keine Inhalte und Funktionen verloren gehen.</p></li></ol>",
  "_STEP_9_1_4_10_HOW_CHECKED_7_": "<h4 id=\"_2_2_alternative_prüfung_mit_1280px_viewport_breite\">2.2 Alternative Prüfung mit 1280px Viewport-Breite</h4>",
  "_STEP_9_1_4_10_HOW_CHECKED_8_": "<ol><li><p>In einem Browser, der Zoomvergrößerung um 400% unterstützt (z. B. Chrome) das Browserfenster auf eine Breite von 1280 CSS-Pixeln und eine Höhe von 1024 CSS-Pixeln einstellen. Hierzu lässt sich die <em>Resize</em>-Funktion der <em>Web Developer Toolbar</em> nutzen.</p></li><li><p>Die Standard-Einstellung von 100% Zoomvergrößerung und 100% Textvergrößerung sicherstellen.</p></li><li><p>Auf 400% zoomen</p></li><li><p>Die Seite neu laden</p></li><li><p>Feststellen, ob Inhalte so umbrechen, dass eine Nutzung ohne horizontales Scrollen möglich ist und keine Inhalte und Funktionen verloren gehen.</p></li></ol>",
  "_STEP_9_1_4_10_HOW_CHECKED_9_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_9_1_4_10_HOW_CHECKED_10_": "<ul><li><p>Inhalte und Funktionen müssen in der Umbruch-Ansicht nicht in der gleichen Weise angeboten werden. Sie können etwa auch in einem Ausklappbereich oder über einen direkten Link erreichbar sein.</p></li><li><p>Bei der alternativen Prüfung mit 1280px Viewport-Breite und 400% Zoom soll nicht negativ bewertet werden, wenn fest positionierte Inhalte (etwa Ausklappmenüs) aufgrund der sehr geringen verfügbaren Höhe des Browser-Fensters nicht voll erreichbar sind. Geprüft wird allein, ob Inhalte erfolgreich in eine Ansicht umbrechen, die nicht horizontal gescrollt werden braucht. Zur Prüfung des Verlusts von Informationen und Funktionalität ist die Prüfung bei 320px Viewport-Breite ausschlaggebend.</p></li><li><p>Ausnahmen für die Anforderung, dass horizontales Scrollen nicht erforderlich ist, sind Inhalte, deren Nutzung ein zweidimensionales Layout voraussetzen, etwa Datentabellen, Bilder, Diagramme, Videos, Spiele oder Benutzerschnittstellen mit Werkzeugleisten.</p></li><li><p>Optionen in geöffneten <code>select</code>-Elementen, die nicht in den Viewport passen, gelten nicht als Fehler im Sinne dieses Prüfschritts.</p></li><li><p>Im Prüfschritt wird nicht geprüft, ob die Zoomvergrößerung auf 400% Textinhalte tatsächlich auf 400% oder einen geringeren Wert vergrößert.   Dies ist Gegenstand von Prüfschritt 9.1.4.4 \"Text auf 200% vergrößerbar\".</p></li><li><p>Für Unternehmen, die Bestandssysteme verwenden oder ihre Layoutmethoden aus irgendeinem Grund nicht aktualisieren können, kann eine alternative, konforme Version eine mobile Website mit einem festen, 320px breiten Layout sein. Der Benutzer sollte in der Lage sein, diese Version von der Standardwebsite aus zu finden.</p></li></ul>",
  "_STEP_9_1_4_10_HOW_CHECKED_11_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_9_1_4_10_HOW_CHECKED_12_": "<h4 id=\"_prüfschritt_erfüllt\">Prüfschritt erfüllt</h4>",
  "_STEP_9_1_4_10_HOW_CHECKED_13_": "<ul><li><p>Inhalte und Funktionen sind bei einer Browserfenster-Breite von 1280px nach Zoom auf 400% (oder bei ungezoomter Ansicht bei einer Browserfenster-Breite von 320px) ohne horizontales Scrollen vollständig erreichbar.</p></li></ul>",
  "_STEP_9_1_4_10_SOURCES_1_": "<li><p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/reflow.html\"> Understanding Reflow</a> (zur Zeit nur auf Englisch verfügbar)</p></li>",
  "_STEP_9_1_4_10_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_von_anderen_prüfschritten\">Abgrenzung von anderen Prüfschritten</h3>",
  "_STEP_9_1_4_10_CLASSIFICATION_2_": "<p>In diesem Prüfschritt geht es darum, ob Inhalte beim Reinzoomen oder in schmalen Viewports ohne Verlust von Information in eine einspaltige Ansicht umbrechen. Die Vergrößerbarkeit von Schrift wird dagegen in Prüfschritt 9.1.4.4 \"Text auf 200% vergrößerbar\" bewertet.</p>",
  "_STEP_9_1_4_10_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_1_4_10_CLASSIFICATION_4_": "<h4 id=\"_guideline\">Guideline</h4>",
  "_STEP_9_1_4_10_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#distinguishable\"> Guideline 1.4 Distinguishable: Make it easier for users to see and hear content including separating foreground from background</a></p></li></ul>",
  "_STEP_9_1_4_10_CLASSIFICATION_6_": "<h4 id=\"_success_criterion\">Success criterion</h4>",
  "_STEP_9_1_4_10_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#reflow\"> 1.4.10 Reflow</a> (Level AA)</p></li></ul>",
  "_STEP_9_1_4_10_CLASSIFICATION_8_": "<h4 id=\"_sufficient_techniques\">Sufficient Techniques</h4>",
  "_STEP_9_1_4_10_CLASSIFICATION_9_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/css/C32.html\"> C32: Using media queries and grid CSS to reflow columns</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/css/C31.html\"> C31: Using CSS Flexbox to reflow content</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/css/C33.html\"> C33: Allowing for Reflow with Long URLs and Strings of Text</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/css/C38.html\"> C38: Using CSS width, max-width and flexbox to fit labels and inputs</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/client-side-script/SCR34.html\"> SCR34: Calculating size and position in a way that scales with text size</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G206.html\"> G206: Providing options within the content to switch to a layout that does not require the user to scroll horizontally to read a line of text</a></p></li></ul>",
  "_STEP_9_1_4_10_CLASSIFICATION_10_": "<h4 id=\"_failures\">Failures</h4>",
  "_STEP_9_1_4_10_CLASSIFICATION_11_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F102\"> F102: Failure of Success Criterion 1.4.10 due to content disappearing and not being available when content has reflowed</a></p></li></ul>"
}
