{
  "_STEP_9_1_4_10_NAME_": "Содержимое переформатируется",
  "_STEP_9_1_4_10_NAME_MENU_": "9.1.4.10 Содержимое переформатируется",
  "_STEP_9_1_4_10_WHAT_CHECKED_1_": "<p>Содержимое страницы должно переформатироваться так, чтобы при ширине окна браузера 320 CSS-пикселей (или при ширине окна браузера 1280 CSS-пикселей и масштабировании на 400%) все информации и функции были доступны без необходимости горизонтальной прокрутки.</p>",
  "_STEP_9_1_4_10_WHAT_CHECKED_2_": "<p>Не требуется, чтобы все содержимое было доступно одинаково в адаптивном виде. Так, видимые навигационные меню стандартного рабочего стола часто доступны только через выпадающее меню после увеличения масштаба (или при использовании на экране смартфона). Содержимое также может быть доступно в разворачивающихся разделах или по ссылкам на другие страницы или представления.</p>",
  "_STEP_9_1_4_10_WHAT_CHECKED_3_": "<p>Исключения предусмотрены для контента, для которого необходимо двумерное макетирование, например, изображения, карты, диаграммы, видео, игры, презентации, таблицы данных и пользовательские интерфейсы, требующие постоянного доступа к панелям инструментов.</p>",
  "_STEP_9_1_4_10_WHAT_CHECKED_4_": "<p><em>Примечание</em>: Этот этап проверки ограничивается содержимым, основное направление письма в котором горизонтальное, как в латинском алфавите, используемом для большинства западных языков. Основное требование WCAG применимо аналогичным образом к содержимому с вертикальным направлением письма.</p>",
  "_STEP_9_1_4_10_WHY_CHECKED_1_": "<p>Пользователи с нарушениями зрения часто увеличивают масштаб страницы с помощью функции масштабирования, доступной в распространенных настольных браузерах. Адаптивное дизайн с использованием CSS media queries должен поддерживать использование сильного масштабирования за счет динамической перестройки макета страницы.</p>",
  "_STEP_9_1_4_10_WHY_CHECKED_2_": "<p>Адаптивные макеты страниц переупорядочивают блоки контента. Многостолбцовый контент при сильном увеличении обычно переносится таким образом, что он располагается в один столбец. В тексте также появляются новые разрывы строк с более короткими строками.</p>",
  "_STEP_9_1_4_10_WHY_CHECKED_3_": "<p>Преимущество: Пользователям необходимо прокручивать только в одном направлении (для западных языков: вертикально). Если строки при увеличении масштаба не переносятся, пользователи вынуждены прокручивать каждую строку горизонтально взад и вперед, что значительно затрудняет восприятие содержимого и замедляет его.</p>",
  "_STEP_9_1_4_10_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_9_1_4_10_HOW_CHECKED_2_": "<p>Этап проверки применим к веб-контенту, если его основа для доступности включает обычные настольные браузеры с встроенной функцией масштабирования. Он не применим при использовании браузеров мобильных операционных систем, встроенное увеличение которых (например, через жест разведения) обычно не предусматривает увеличение с перестройкой содержимого.</p>",
  "_STEP_9_1_4_10_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_1_4_10_HOW_CHECKED_4_": "<h4 id=\"_2_1_prüfung_mit_320px_viewport_breite\">2.1 Проверка при ширине вьюпорта 320px</h4>",
  "_STEP_9_1_4_10_HOW_CHECKED_5_": "<p>Проверка касается веб-контента с горизонтально направленным текстом.</p>",
  "_STEP_9_1_4_10_HOW_CHECKED_6_": "<ol><li><p>Открыть страницу в <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#chrome\">браузере Chrome</a>.</p></li><li><p>Открыть <em>Инструменты разработчика</em> справа (через клавишу F12, комбинацию клавиш Ctrl+Shift+I, или через <em>Меню Настройки &gt; Дополнительные инструменты &gt; Инструменты разработчика</em>) и подвинуть вертикальное разделение между областью страницы и инструментами, пока в правом верхнем углу области страницы не будет отображаться <em>320px x (высота вьюпорта)</em> (если справа отображается полоса прокрутки, добавить 14px, т.е. настроить <em>334px x высота вьюпорта</em>).</p></li><li><p>Перезагрузить страницу.</p></li><li><p>Определить, перестраивается ли содержимое страницы так, что его можно использовать без горизонтальной прокрутки и без потери содержимого и функциональности.</p></li></ol>",
  "_STEP_9_1_4_10_HOW_CHECKED_7_": "<h4 id=\"_2_2_alternative_prüfung_mit_1280px_viewport_breite\">2.2 Альтернативная проверка при ширине вьюпорта 1280px</h4>",
  "_STEP_9_1_4_10_HOW_CHECKED_8_": "<ol><li><p>В браузере, поддерживающем увеличение масштаба на 400% (например, Chrome), настроить размер окна браузера на ширину 1280 CSS-пикселей и высоту 1024 CSS-пикселя. Для этого можно использовать функцию <em>Изменение размера</em> в <em>Панели инструментов веб-разработчика</em>.</p></li><li><p>Установить стандартное увеличение масштаба 100% и увеличение текста 100%.</p></li><li><p>Увеличить масштаб на 400%</p></li><li><p>Перезагрузить страницу</p></li><li><p>Определить, перестраивается ли содержимое так, что его можно использовать без горизонтальной прокрутки и без потери содержимого и функциональности.</p></li></ol>",
  "_STEP_9_1_4_10_HOW_CHECKED_9_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_9_1_4_10_HOW_CHECKED_10_": "<ul><li><p>Содержимое и функции не обязательно должны быть представлены в одинаковом виде. Они могут быть доступны, например, в выпадающем разделе или по прямой ссылке.</p></li><li><p>При альтернативной проверке с шириной окна просмотра 1280px и увеличением 400% не следует отрицательно оценивать, если фиксированные элементы (например, выпадающие меню) не полностью доступны из-за очень небольшой доступной высоты окна браузера. Проверяется только, успешно ли содержимое перестраивается в вид, который не требует горизонтальной прокрутки. Для оценки потери информации и функциональности решающей является проверка при ширине вьюпорта 320px.</p></li><li><p>Исключения для требования об отсутствии необходимости горизонтальной прокрутки применяются к содержимому, для использования которого требуется двумерное макетирование, например, таблицы данных, изображения, диаграммы, видео, игры или пользовательские интерфейсы с панелями инструментов.</p></li><li><p>Опции в открытых <code>select</code>-элементах, не помещающиеся в вьюпорт, не считаются ошибкой в рамках этого этапа проверки.</p></li><li><p>На этом этапе проверки не оценивается, увеличивает ли масштабирование на 400% текст действительно до 400% или до меньшего значения. Это является предметом проверки на этапе 9.1.4.4 \"Текст увеличивается до 200%\".</p></li><li><p>Для компаний, использующих устаревшие системы или по каким-то причинам не могут обновить методы макетирования, альтернативной совместимой версией может быть мобильный сайт с фиксированным макетом шириной 320px. Пользователь должен иметь возможность найти эту версию со стандартного сайта.</p></li></ul>",
  "_STEP_9_1_4_10_HOW_CHECKED_11_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_1_4_10_HOW_CHECKED_12_": "<h4 id=\"_prüfschritt_erfüllt\">Этап проверки выполнен</h4>",
  "_STEP_9_1_4_10_HOW_CHECKED_13_": "<ul><li><p>Содержимое и функции полностью доступны при ширине окна браузера 1280px после увеличения на 400% (или при неувеличенном виде при ширине окна браузера 320px) без необходимости горизонтальной прокрутки.</p></li></ul>",
  "_STEP_9_1_4_10_SOURCES_1_": "<li><p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/reflow.html\"> Понимание переформатирования</a> (на данный момент доступно только на английском)</p></li>",
  "_STEP_9_1_4_10_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_von_anderen_prüfschritten\">Разграничение с другими этапами проверки</h3>",
  "_STEP_9_1_4_10_CLASSIFICATION_2_": "<p>На этом этапе проверки оценивается, перестраивается ли содержимое при увеличении масштаба или в узких вьюпортах без потери информации в одноколоночное представление. Возможность увеличения шрифта оценивается на этапе 9.1.4.4 \"Текст увеличивается до 200%\".</p>",
  "_STEP_9_1_4_10_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация этапа проверки по WCAG 2.1</h3>",
  "_STEP_9_1_4_10_CLASSIFICATION_4_": "<h4 id=\"_guideline\">Руководство</h4>",
  "_STEP_9_1_4_10_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#distinguishable\"> Руководство 1.4 Отличимость: Упрощение восприятия и слухового сопровождения контента, включая разделение переднего и заднего плана</a></p></li></ul>",
  "_STEP_9_1_4_10_CLASSIFICATION_6_": "<h4 id=\"_success_criterion\">Критерий успеха</h4>",
  "_STEP_9_1_4_10_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#reflow\"> 1.4.10 Переформатирование</a> (Уровень AA)</p></li></ul>",
  "_STEP_9_1_4_10_CLASSIFICATION_8_": "<h4 id=\"_sufficient_techniques\">Достаточные техники</h4>",
  "_STEP_9_1_4_10_CLASSIFICATION_9_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/css/C32.html\"> C32: Использование медиазапросов и сетки CSS для перестроения столбцов</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/css/C31.html\"> C31: Использование CSS Flexbox для переформатирования контента</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/css/C33.html\"> C33: Обеспечение переформатирования с длинными URL-адресами и строками текста</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/css/C38.html\"> C38: Использование ширины CSS, максимальной ширины и flexbox для подгонки меток и полей ввода</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/client-side-script/SCR34.html\"> SCR34: Расчет размера и позиции таким образом, чтобы они масштабировались вместе с размером текста</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G206.html\"> G206: Предоставление вариантов в контенте для переключения на макет, который не требует горизонтальной прокрутки текста для чтения строки</a></p></li></ul>",
  "_STEP_9_1_4_10_CLASSIFICATION_10_": "<h4 id=\"_failures\">Неудачи</h4>",
  "_STEP_9_1_4_10_CLASSIFICATION_11_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F102\"> F102: Неудача Критерия успеха 1.4.10 из-за исчезновения контента и его недоступности, когда контент переформатирован</a></p></li></ul>"
}