{
  "_STEP_6_5_3_NAME_": "Частота кадров при видеотелефонии",
  "_STEP_6_5_3_WHAT_CHECKED_1_": "<p>Если веб-приложение поддерживает видеотелефонию, оно должно обеспечивать частоту кадров (framerate) не менее 20 кадров в секунду. Лучше использовать частоту кадров 30 кадров в секунду.</p>",
  "_STEP_6_5_3_WHY_CHECKED_1_": "<p>Достаточная частота кадров особенно важна для людей с нарушениями слуха, которые анализируют визуальную информацию, например, для глухих людей, читающих по губам говорящего. Также поддерживающее восприятие мимики и жестов требует адекватной частоты кадров.</p>",
  "_STEP_6_5_3_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_6_5_3_HOW_CHECKED_2_": "<p>Этап проверки применим, если веб-приложение поддерживает видеотелефонию.</p>",
  "_STEP_6_5_3_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_6_5_3_HOW_CHECKED_4_": "<p>Для оценки соответствия этому этапу проверки текущие сведения производителя программного обеспечения необходимо сопоставить с собственными визуальными впечатлениями. Для проверки веб-приложение необходимо открыть на двух устройствах.</p>",
  "_STEP_6_5_3_HOW_CHECKED_5_": "<ol><li><p>Извлечь поддерживаемую частоту кадров из документации веб-предложения или запросить у производителя. Поддерживается ли минимум 20 кадров в секунду?</p></li><li><p>Открыть веб-приложение на двух устройствах</p></li><li><p>Установить видеотелефонное соединение между устройствами</p></li><li><p>Проверить, отображается ли изображение плавно. Кажутся ли данные производителя о частоте кадров правдоподобными?</p></li></ol>",
  "_STEP_6_5_3_HOW_CHECKED_6_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_6_5_3_HOW_CHECKED_7_": "<p>Для видеотелефонии рекомендуется частота кадров 30 кадров в секунду для обеспечения плавного отображения изображения.</p>",
  "_STEP_6_5_3_HOW_CHECKED_8_": "<p>Точный метод измерения поддерживаемой частоты кадров еще не определен. Вы можете оставить свои рекомендации по разработке методики проверки в <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">запросе на GitHub</a>.</p>",
  "_STEP_6_5_3_SOURCES_1_": "<ul><li><p>В настоящее время нет источников.</p></li></ul>",
  "_STEP_6_5_3_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_6_5_3_CLASSIFICATION_2_": "<h4 id=\"_6_5_3_framerate\">6.5.3 Частота кадров</h4>",
  "_STEP_6_5_3_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where ICT that provides two-way voice communication includes real-time video functionality, the ICT:</p><ul><li><p>shall support a frame rate of at least 20 frames per second (FPS)</p></li></ul></div></div>"
}