{
  "_STEP_11_8_3_NAME_": "Сохранение информации о доступности при преобразованиях",
  "_STEP_11_8_3_NAME_MENU_": "11.8.3 Сохранение информации о доступности при преобразованиях",
  "_STEP_11_8_3_WHAT_CHECKED_1_": "<p>Если веб-приложение является инструментом автора и предлагает функции переструктурирования или перекодировки, то информация о доступности должна сохраняться в выводных данных, если в целевом типе документа вывода существуют эквивалентные механизмы для хранения информации о доступности.</p>",
  "_STEP_11_8_3_WHY_CHECKED_1_": "<p>Людям с ограниченными возможностями необходимы семантические метки (например, заголовки или правильно построенные таблицы данных), чтобы эффективно использовать содержимое. Если эти метки удаляются или искажаются в процессе трансформации, это ухудшает удобство использования документов.</p>",
  "_STEP_11_8_3_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_11_8_3_HOW_CHECKED_2_": "<p>Этап проверки применим, если веб-приложение является инструментом автора и предлагает функции переструктурирования (преобразование структуры) или перекодировки.</p>",
  "_STEP_11_8_3_HOW_CHECKED_3_": "<h4 id=\"_1_1_restrukturierungstransformationen\">1.1 Преобразования переструктурирования</h4>",
  "_STEP_11_8_3_HOW_CHECKED_4_": "<p>Преобразования переструктурирования - это преобразования, при которых изменяются структурные особенности (например, линеаризация таблиц, разделение документа на страницы или объединение отдельных PDF-документов в один файл). Тип документа или технология остаются теми же.</p>",
  "_STEP_11_8_3_HOW_CHECKED_5_": "<h4 id=\"_1_2_rekodierungstransformationen\">1.2 Преобразования перекодировки</h4>",
  "_STEP_11_8_3_HOW_CHECKED_6_": "<p>Преобразования перекодировки - это преобразования, при которых изменяется технология или тип документа. Это может быть, например, преобразование документа HTML в PDF.</p>",
  "_STEP_11_8_3_HOW_CHECKED_7_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_11_8_3_HOW_CHECKED_8_": "<ol><li><p>Выбрать образец документа в исходном формате. Например, если инструмент автора предлагает преобразование кодировки из HTML в PDF, это будет файл HTML.</p></li><li><p>Открыть образец документа в веб-приложении и преобразовать его в целевой формат или в другую структуру.</p></li><li><p>Проверить целевой файл. В зависимости от типа документа это может потребовать проверок, которые нельзя выполнить в рамках теста BITV. Примером может служить преобразование документа HTML в документ PDF:</p><ul><li><p>Все ли заголовки из исходного файла были перенесены?</p></li><li><p>Содержат ли графики в файле PDF альтернативные тексты?</p></li><li><p>Была ли корректно переведена разметка таблицы?</p></li></ul></li></ol>",
  "_STEP_11_8_3_HOW_CHECKED_9_": "<h3 id=\"_3_hinweise\">3. Советы</h3>",
  "_STEP_11_8_3_HOW_CHECKED_10_": "<p>Шаги должны быть повторены для каждого формата ввода и вывода, который поддерживает веб-приложение для трансформации.</p>",
  "_STEP_11_8_3_HOW_CHECKED_11_": "<p>Даже если веб-приложение лишь изменяет структуру входного документа, необходимо убедиться, что выходной файл все еще содержит всю информацию, необходимую для доступности.</p>",
  "_STEP_11_8_3_HOW_CHECKED_12_": "<p>Если у вас есть предложения по улучшению инструкции проверки, вы можете <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">создать задачу для этого этапа проверки на GitHub</a>.</p>",
  "_STEP_11_8_3_SOURCES_1_": "<ul><li><p>В настоящее время нет источников.</p></li></ul>",
  "_STEP_11_8_3_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_11_8_3_CLASSIFICATION_2_": "<h4 id=\"_11_8_3_preservation_of_accessibility_information_in_transformations\">11.8.3 Сохранение информации о доступности при трансформациях</h4>",
  "_STEP_11_8_3_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>If the authoring tool provides restructuring transformations or re-coding transformations, then accessibility information shall be preserved in the output if equivalent mechanisms exist in the content technology of the output.</p><p>NOTE 1: Restructuring transformations are transformations in which the content technology stays the same, but the structural features of the content are changed (e.g. linearizing tables, splitting a document into pages).</p><p>NOTE 2: Re-coding transformations are transformations in which the technology used to encode the content is changed.</p></div></div>"
}