{
  "_STEP_5_2_NAME_": "Aktivierung von Barrierefreiheitsfunktionen",
  "_STEP_5_2_NAME_MENU_": "5.2 Aktivierung von Barrierefreiheitsfunktionen",
  "_STEP_5_2_WHAT_CHECKED_1_": "<p>Wenn die Webseite dokumentierte Funktionen für die Barrierefreiheit bereithält, die spezielle Bedürfnisse von Nutzenden erfüllen, soll die Aktivierung dieser Funktionen für diese Nutzendengruppe barrierefrei möglich sein. Das bedeutet, dass die Barrierefreiheitsfunktion für die Nutzendengruppe, die sie unterstützen soll, selbstständig aktivierbar sein soll. In der Regel ist dies der Fall, wenn die Funktion - etwa ein Kontrastumschalter oder eine Icon-basierter Link zu einer Version in leichter Sprache - alle übrigen Anforderungen der EN 301 549 erfüllt.</p>",
  "_STEP_5_2_WHAT_CHECKED_2_": "<p>Die Anforderung 5.2 beschränkt die Prüfung auf Funktionen, die dokumentiert sind, also etwa auf Hilfeseiten oder in der Erklärung zur Barrierefreiheit benannt bzw. erläutert sind.</p>",
  "_STEP_5_2_WHAT_CHECKED_3_": "<p>Beispiele für Barrierefreiheitsfunktionen:</p>",
  "_STEP_5_2_WHAT_CHECKED_4_": "<ul><li><p>Vorlesefunktion</p></li><li><p>Kontrasterhöhung, abweichende Farbschemata</p></li><li><p>Anpassung der Schriftgröße, Schriftformatierungen (z. B. Zeilenabstand, Schriftart usw.)</p></li><li><p>Versionen in Leichter Sprache oder Deutscher Gebärdensprache</p></li><li><p>Einstellungen zum Deaktivieren automatischen Abspielens von Animationen, Videos oder Audio-Dateien</p></li></ul>",
  "_STEP_5_2_WHY_CHECKED_1_": "<p>Barrierefreiheitsfunktionen, die von der zu testenden Webseite (also nicht vom Betriebssystem oder dem Browser) bereitgestellt werden, sollen von Nutzenden, die diese brauchen, selbstständig aktivierbar sein.</p>",
  "_STEP_5_2_WHY_CHECKED_2_": "<p>Wenn die Webseite beispielsweise eine Funktion zur Verfügung stellt, mit der die Kontrastverhältnisse verbessert werden, müssen sämtliche Bedienelemente, die zur Aktivierung der Funktion bedient werden müssen, auch in der Standardansicht ein ausreichendes Kontrastverhältnis aufweisen. Damit wird sichergestellt, dass auch Nutzende, die mit kontrastarmen Inhalten und Bedienelementen Schwierigkeiten haben (also zur Zielgruppe der Barrierefreiheitsfunktion gehören), die Funktion zur Kontrasterhöhung selbstständig aktivieren können.</p>",
  "_STEP_5_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_5_2_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn die zu prüfende Webseite spezielle Barrierefreiheits-Funktionen bereithält, die im Angebot selbst, etwa in den Einstellungen, oder in einer zur Verfügung gestellen technischen Dokumentation dokumentiert sind. Nicht berücksichtigt werden systemseitige Bedienungshilfen (z. B. vom Browser oder Betriebssystem).</p>",
  "_STEP_5_2_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_5_2_HOW_CHECKED_4_": "<ol><li><p>Webseite aufrufen.</p></li><li><p>Falls dokumentierte Barrierefreiheitsfunktionen angeboten werden:</p><ul><li><p>Ist die Barrierefreiheits-Funktion für die Zielgruppe identifizierbar?</p></li><li><p>Ist die Barrierefreiheits-Funktion für die Zielgruppe selbstständig aktivierbar?</p></li></ul></li></ol>",
  "_STEP_5_2_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_5_2_HOW_CHECKED_6_": "<h4 id=\"_3_1_hinweis_zur_bestimmung_der_zielgruppe_der_barrierefreiheits_funktion\">3.1 Hinweis zur Bestimmung der Zielgruppe der Barrierefreiheits-Funktion</h4>",
  "_STEP_5_2_HOW_CHECKED_7_": "<p>Viele Menschen mit Behinderung nutzen verschieden Eingabemöglichkeiten, z.B. fallweise die Maus oder die Tastatur. Menschen mit kognitiven Einschränkungen haben zum Teil auch andere Einschränkungen. Bei der Bestimmung der Zielgruppe ist es deshalb wichtig, auch Anforderungen zu berücksichtigen, die nicht direkt mit der Einschränkung zu tun haben, für die die Barrierefreiheits-Funktion gedacht ist.</p>",
  "_STEP_5_2_HOW_CHECKED_8_": "<h4 id=\"_3_2_hinweis_zur_identifizierbarkeit_und_aktivierbarkeit\">3.2 Hinweis zur Identifizierbarkeit und Aktivierbarkeit</h4>",
  "_STEP_5_2_HOW_CHECKED_9_": "<p>Bedienelemente für Barrierefreiheits-Funktionen sollen grundsätzlich alle Barrierefreiheits-Anforderungen erfüllen. Zwei Beispiele:</p>",
  "_STEP_5_2_HOW_CHECKED_10_": "<ol><li><p>Ein Schalter zum Laden einer Version in Leichter Sprache sollte leicht verständlich, kontrastreich und zugänglich beschriftet sein, denn es gibt Menschen mit kognitiven Einschränkungen, die außerdem sehbehindert oder blind sind.</p></li><li><p>Ein visueller Kontrastmodus-Schalter für Menschen mit Sehbehinderung braucht auch eine zugängliche Beschriftung, denn manche sehbehinderten Menschen nutzen zusätzlich auch eine Sprachausgabe.</p></li></ol>",
  "_STEP_5_2_HOW_CHECKED_11_": "<h3 id=\"_3_3_hinweis_auf_andere_anwendbare_anforderungen\">3.3 Hinweis auf andere anwendbare Anforderungen</h3>",
  "_STEP_5_2_HOW_CHECKED_12_": "<p>Bei nicht dokumentierten Barrierefreiheitsfunktionen, für die dieser Prüfschritt erfüllt ist, kann es zu negativen Bewertungen in anderen Prüfschritten kommen.</p>",
  "_STEP_5_2_HOW_CHECKED_13_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_5_2_HOW_CHECKED_14_": "<h4 id=\"_erfüllt\">Erfüllt</h4>",
  "_STEP_5_2_HOW_CHECKED_15_": "<p>Die Barrierefreiheits-Funktion ist barrierefrei identifizierbar und aktivierbar.</p>",
  "_STEP_5_2_HOW_CHECKED_16_": "<h4 id=\"_nicht_voll_erfüllt\">Nicht voll erfüllt</h4>",
  "_STEP_5_2_HOW_CHECKED_17_": "<p>Bedienelemente der Barrierefreiheitsfunktion oder die Funktion selbst verstoßen gegen andere Anforderungen der EN.</p>",
  "_STEP_5_2_SOURCES_1_": "<ul><li><p>Zurzeit keine Quellen.</p></li></ul>",
  "_STEP_5_2_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Einordnung des Prüfschritts nach EN 301 549 V3.2.1</h3>",
  "_STEP_5_2_CLASSIFICATION_2_": "<h4 id=\"_5_2_activation_of_accessibility_features\">5.2 Activation of accessibility features</h4>",
  "_STEP_5_2_CLASSIFICATION_3_": "<p>Where ICT has documented accessibility features, it shall be possible to activate those documented accessibility features that are required to meet a specific need without relying on a method that does not support that need.</p>"
}