{
  "_STEP_5_2_NAME_": "Активация функций доступности",
  "_STEP_5_2_NAME_MENU_": "5.2 Активация функций доступности",
  "_STEP_5_2_WHAT_CHECKED_1_": "<p>Если веб-сайт предоставляет задокументированные функции доступности, удовлетворяющие специальным потребностям пользователей, активация этих функций для этих групп пользователей должна быть возможна без барьеров. Это означает, что функции доступности для группы пользователей, которым они предназначены, должны быть активированы самостоятельно. Обычно это так, если функция, например, переключатель контрастности или иконка-ссылка на версию на простом языке, соответствует всем другим требованиям EN 301 549.</p>",
  "_STEP_5_2_WHAT_CHECKED_2_": "<p>Требование 5.2 ограничивает проверку функциями, которые задокументированы, например, на страницах помощи или в объяснении доступности.</p>",
  "_STEP_5_2_WHAT_CHECKED_3_": "<p>Примеры функций доступности:</p>",
  "_STEP_5_2_WHAT_CHECKED_4_": "<ul><li><p>Функция чтения текста</p></li><li><p>Увеличение контрастности, изменение цветовых схем</p></li><li><p>Настройка размера шрифта, форматирование текста (например, межстрочный интервал, шрифт и т.д.)</p></li><li><p>Версии на простом языке или немецком жестовом языке</p></li><li><p>Настройки для отключения автоматического воспроизведения анимаций, видео или аудиофайлов</p></li></ul>",
  "_STEP_5_2_WHY_CHECKED_1_": "<p>Функции доступности, предоставляемые проверяемым веб-сайтом (а не операционной системой или браузером), должны быть активируемы пользователем, которому они необходимы, самостоятельно.</p>",
  "_STEP_5_2_WHY_CHECKED_2_": "<p>Например, если веб-сайт предоставляет функцию, улучшающую контрастность, все элементы управления, необходимые для активации этой функции, должны иметь достаточное контрастное соотношение в стандартном виде. Это гарантирует, что даже пользователи, испытывающие трудности с контрастностью содержимого и элементов управления (т.е. целевая группа функции доступности), могут самостоятельно активировать функцию увеличения контрастности.</p>",
  "_STEP_5_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_5_2_HOW_CHECKED_2_": "<p>Этап проверки применим, если проверяемый веб-сайт предоставляет специальные функции доступности, которые документированы на сайте, например, в настройках или предоставленной технической документации. Системные средства управления доступом (например, браузера или операционной системы) не учитываются.</p>",
  "_STEP_5_2_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_5_2_HOW_CHECKED_4_": "<ol><li><p>Открыть веб-сайт.</p></li><li><p>Если предлагаются задокументированные функции доступности:</p><ul><li><p>Можно ли идентифицировать функцию доступности для целевой группы?</p></li><li><p>Может ли целевая группа самостоятельно активировать функцию доступности?</p></li></ul></li></ol>",
  "_STEP_5_2_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Примечания</h3>",
  "_STEP_5_2_HOW_CHECKED_6_": "<h4 id=\"_3_1_hinweis_zur_bestimmung_der_zielgruppe_der_barrierefreiheits_funktion\">3.1 Примечание по определению целевой группы функции доступности</h4>",
  "_STEP_5_2_HOW_CHECKED_7_": "<p>Многие люди с инвалидностью используют различные способы ввода, например, иногда мышь или клавиатуру. Люди с когнитивными ограничениями иногда имеют и другие ограничения. Поэтому при определении целевой группы важно также учитывать требования, которые не непосредственно связаны с ограничениями, для которых предназначена функция доступности.</p>",
  "_STEP_5_2_HOW_CHECKED_8_": "<h4 id=\"_3_2_hinweis_zur_identifizierbarkeit_und_aktivierbarkeit\">3.2 Примечание по идентифицируемости и активируемости</h4>",
  "_STEP_5_2_HOW_CHECKED_9_": "<p>Элементы управления функциями доступности в принципе должны соответствовать всем требованиям доступности. Два примера:</p>",
  "_STEP_5_2_HOW_CHECKED_10_": "<ol><li><p>Переключатель для загрузки версии на простом языке должен быть легко понятным, контрастным и доступно обозначенным, так как есть люди с когнитивными ограничениями, которые также слепы или имеют нарушения зрения.</p></li><li><p>Визуальный переключатель режима контрастности для людей с нарушениями зрения также нуждается в доступной маркировке, так как некоторые люди с нарушениями зрения также используют голосовой вывод.</p></li></ol>",
  "_STEP_5_2_HOW_CHECKED_11_": "<h3 id=\"_3_3_hinweis_auf_andere_anwendbare_anforderungen\">3.3 Примечание о других применимых требованиях</h3>",
  "_STEP_5_2_HOW_CHECKED_12_": "<p>При недокументированных функциях доступности, для которых этот этап проверки выполнен, могут возникнуть негативные оценки в других этапах проверки.</p>",
  "_STEP_5_2_HOW_CHECKED_13_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_5_2_HOW_CHECKED_14_": "<h4 id=\"_erfüllt\">Выполнено</h4>",
  "_STEP_5_2_HOW_CHECKED_15_": "<p>Функция доступности идентифицируема и активируема без барьеров.</p>",
  "_STEP_5_2_HOW_CHECKED_16_": "<h4 id=\"_nicht_voll_erfüllt\">Не полностью выполнено</h4>",
  "_STEP_5_2_HOW_CHECKED_17_": "<p>Элементы управления функцией доступности или сама функция нарушают другие требования EN.</p>",
  "_STEP_5_2_SOURCES_1_": "<ul><li><p>В настоящее время нет источников.</p></li></ul>",
  "_STEP_5_2_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_5_2_CLASSIFICATION_2_": "<h4 id=\"_5_2_activation_of_accessibility_features\">5.2 Активация функций доступности</h4>",
  "_STEP_5_2_CLASSIFICATION_3_": "<p>Когда ИКТ имеет задокументированные функции доступности, должна быть возможность активировать эти задокументированные функции доступности, необходимые для удовлетворения конкретной потребности, без использования метода, который не поддерживает эту потребность.</p>"
}