{
  "_STEP_6_2_2_4_NAME_": "Визуальная индикация голосовой коммуникации в реальном времени",
  "_STEP_6_2_2_4_WHAT_CHECKED_1_": "<p>Если веб-приложение поддерживает двустороннюю голосовую связь и функции текстовой коммуникации в реальном времени (RTT, Real-Time Text), активность говорящих должна визуализироваться в реальном времени. Визуальный индикатор, что кто-то говорит, также должен быть программно определяемым, чтобы люди с ограниченными возможностями слуха и зрения, например, через брайлевскую строку, могли получать информацию о текущей аудиокоммуникации. В данном случае речь идет только о сигнализации того, что происходит ввод аудио, а не о передаче содержания.</p>",
  "_STEP_6_2_2_4_WHY_CHECKED_1_": "<p>Важной информацией в коммуникации, например, в веб-конференции, является указание на то, что кто-то говорит, и определение, кто именно это делает. Таким образом, участники, которые не могут слышать вклад, например, глухие люди, будут знать, что в данный момент кто-то говорит, и кто именно это делает.</p>",
  "_STEP_6_2_2_4_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость проверки</h3>",
  "_STEP_6_2_2_4_HOW_CHECKED_2_": "<p>Этот шаг проверки применим, если веб-приложение поддерживает двустороннюю голосовую связь и функции текстовой коммуникации в реальном времени.</p>",
  "_STEP_6_2_2_4_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_6_2_2_4_HOW_CHECKED_4_": "<ol><li><p>Открыть веб-приложение.</p></li><li><p>Установить связь с другим устройством через приложение.</p></li><li><p>Проверить, происходит ли сигнализация в реальном времени при говорении,</p><ol class=\"loweralpha\"><li><p>например, через мигающий значок</p></li></ol></li><li><p>Если это так, проверить с помощью скринридера и брайлевской строки, определяема ли сигнализация программно и отображается ли она на брайлевской строке экономно, например, мигающими брайлевыми модулями и т.д.</p></li></ol>",
  "_STEP_6_2_2_4_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_6_2_2_4_HOW_CHECKED_6_": "<ul><li><p>При текстовой коммуникации в реальном времени (RTT, Real-Time Text) текст появляется у получателя динамично уже в процессе ввода отправителем. RTT не то же самое, что чат, где сообщения отправляются явно и появляются у получателя только после этого.</p></li></ul>",
  "_STEP_6_2_2_4_SOURCES_1_": "<ul><li><p><a href=\"https://labs.etsi.org/rep/HF/en301549/uploads/272bede3724c5c99efe777f778201f70/tr_103708v010101p.pdf\">Human Factors (HF); Real-Time Text (RTT) in Multiparty Conference Calling / ETSI TR 103 708 V1.1.1 (2022-08)</a></p></li></ul>",
  "_STEP_6_2_2_4_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_6_2_2_4_CLASSIFICATION_2_": "<h4 id=\"_6_2_2_4_visual_indicator_of_audio_with_rtt\">6.2.2.4 Визуальный индикатор аудио с RTT</h4>",
  "_STEP_6_2_2_4_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where ICT provides two-way voice communication, and has RTT capabilities, the ICT shall provide a real-time visual indicator of audio activity on the display.</p><p>NOTE 1: The visual indicator may be a simple character position on the display that flickers on and off to reflect audio activity, or presentation of the information in another way that can be both visible to sighted users and passed on to deaf-blind users who are using a braille display.</p><p>NOTE 2: Without this indication a person who lacks the ability to hear does not know when someone is talking.</p></div></div>"
}