{
  "_STEP_9_4_1_2_NAME_": "Имя, Роль, Значение доступны",
  "_STEP_9_4_1_2_NAME_MENU_": "9.4.1.2 Имя, Роль, Значение доступны",
  "_STEP_9_4_1_2_WHAT_CHECKED_1_": "<p>Все пользовательские компоненты веб-сайта (элементы или виджеты, которые не основаны на интерактивных HTML-элементах) реализованы таким образом, что семантическая информация (имя, роль, свойства) доступна. Если используются несемантические элементы (например, <code>div</code> или <code>span</code>), превращенные с помощью JavaScript в элементы управления, семантика обеспечивается с помощью WAI-ARIA.</p>",
  "_STEP_9_4_1_2_WHAT_CHECKED_2_": "<p>Изменяющиеся состояния элементов управления не только визуально отображаются через CSS и JavaScript, но и через скриптовое изменение значений атрибутов ARIA, чтобы семантика была доступна и при невизуальном использовании.</p>",
  "_STEP_9_4_1_2_WHY_CHECKED_1_": "<p>Стандартные HTML-элементы управления, такие как ссылки (<code>a</code>-элемент) и элементы форм (<code>input</code>, <code>button</code>, <code>checkbox</code> и т. д.), имеют имена, роли, значения и состояния, если они реализованы в соответствии со спецификацией, и обычно распознаются вспомогательными технологиями. Например, слепые пользователи могут узнать, что они перешли на ссылку, и могут следовать по ней. Также передаются состояния, например, флажка (выбран или не выбран). Поэтому интерактивные кнопки должны быть реализованы с помощью подходящих нативных HTML-элементов, чтобы их значение было ясно.</p>",
  "_STEP_9_4_1_2_WHY_CHECKED_2_": "<p>Если используются несоответствующие (потому что несемантические) элементы (например, <code>div</code> или <code>span</code>), превращенные с помощью JavaScript в ссылки или элементы управления, семантику можно обеспечить с помощью WAI-ARIA. Это также касается компонентов (виджетов, таких как панели вкладок, аккордеоны и т. д.), которые в нативном HTML не предоставляются и реализуются с помощью несемантических элементов и скриптов. Атрибуты WAI-ARIA помогают понять их, передавая семантическую информацию от браузера к технологиям помощи.</p>",
  "_STEP_9_4_1_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_9_4_1_2_HOW_CHECKED_2_": "<p>Этап проверки применим, если на странице есть интерактивные элементы управления (ссылки, элементы формы или программно созданные элементы, реагирующие на <code>onclick</code> или другие обработчики событий).</p>",
  "_STEP_9_4_1_2_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_4_1_2_HOW_CHECKED_4_": "<ol><li><p>Открыть страницу в браузере Firefox.</p></li><li><p>Проверить элементы управления на странице на корректность семантики:</p><ul><li><p>Есть ли очевидные ссылки или кнопки без атрибута <code>href</code>? Это можно определить, например, с помощью <a href=\"http://www.bitvtest.de/werkzeugliste-2011#webdeveloper\">Web Developer Toolbar</a> через функцию <em>Information</em> &gt; <em>Display link details</em>.</p></li><li><p>Есть ли элементы формы, такие как флажки или радиокнопки, которые отличаются от стандартного представления, потому что они воссозданы с помощью других элементов, таких как <code>div</code> или <code>img</code>?</p></li><li><p>Есть ли на странице пользовательские виджеты, такие как ползунки или панели вкладок?</p></li></ul></li><li><p>С помощью инструментов разработчика проверить, отображаются ли через WAI-ARIA имя, свойства и, при необходимости, состояния. Изменения состояний должны отражаться изменениями значений атрибутов. Визуальные изменения состояний за счет программной замены изображений, используемых вместо элементов управления, также должны создавать доступные смысловые изменения атрибутов <code>alt</code> или свойств WAI-ARIA.</p></li></ol>",
  "_STEP_9_4_1_2_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Советы</h3>",
  "_STEP_9_4_1_2_HOW_CHECKED_6_": "<ul><li><p>В случае сомнений обратитесь к <a href=\"https://www.w3.org/WAI/ARIA/apg/\">ARIA Authoring Practices Guide</a>.</p></li><li><p>Несемантические элементы, такие как <code>span</code> или <code>div</code>, можно сделать фокусируемыми с клавиатуры, если установлен атрибут <code>tabindex</code>. Если это не так, элементы могут быть исследованы с помощью курсорного инструмента aViewer.</p></li><li><p>Для проверки сложных виджетов следует использовать средство чтения с экрана.</p></li><li><p>Для динамически отображаемых элементов (например, раскрывающихся списков комбобоксов) может потребоваться приостановить выполнение скрипта, чтобы исследовать отображаемые элементы. Для этого подходит ввод скрипта <code>setTimeout(function(){debugger}, 5000);</code> в консоль инструментов разработчика (которую можно вызвать с помощью F12), сразу после вызова отображаемого содержимого. Через пять секунд после активации консольного скрипта выполнение скрипта на странице остановится, и динамические элементы можно будет исследовать только с помощью инструментов разработчика.</p></li></ul>",
  "_STEP_9_4_1_2_HOW_CHECKED_7_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_4_1_2_HOW_CHECKED_8_": "<h4 id=\"_nicht_erfüllt\">Не выполнено</h4>",
  "_STEP_9_4_1_2_HOW_CHECKED_9_": "<ul><li><p>Важные элементы управления реализованы с использованием несемантических HTML-элементов или элементов <code>a</code> без атрибута <code>href</code>, при этом семантика не воссоздана с помощью WAI-ARIA.</p></li></ul>",
  "_STEP_9_4_1_2_SOURCES_1_": "<h3 id=\"_wai_aria_spezifikation\">Спецификация WAI-ARIA</h3>",
  "_STEP_9_4_1_2_SOURCES_2_": "<ul><li><p><a href=\"https://www.w3.org/TR/wai-aria/\" class=\"bare\">https://www.w3.org/TR/wai-aria/</a></p></li><li><p><a href=\"https://www.w3.org/TR/wai-aria-1.1/\">Доступные богатые интернет-приложения (WAI-ARIA) 1.1</a> (на данный момент <em>Candidate Recommendation</em>)</p></li></ul>",
  "_STEP_9_4_1_2_SOURCES_3_": "<h3 id=\"_aria_in_html\">ARIA в HTML</h3>",
  "_STEP_9_4_1_2_SOURCES_4_": "<ul><li><p><a href=\"https://www.w3.org/TR/html-aria/\">ARIA в HTML</a></p></li></ul>",
  "_STEP_9_4_1_2_SOURCES_5_": "<h3 id=\"_aria_widgets\">ARIA-виджеты</h3>",
  "_STEP_9_4_1_2_SOURCES_6_": "<ul><li><p><a href=\"https://www.w3.org/WAI/ARIA/apg/\">Руководство по созданию ARIA (APG)</a></p></li></ul>",
  "_STEP_9_4_1_2_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_von_anderen_prüfschritten\">Разграничение с другими этапами проверки</h3>",
  "_STEP_9_4_1_2_CLASSIFICATION_2_": "<p>Этот этап проверки не оценивает возможность управления с клавиатуры программными элементами управления. Это предмет проверки на этапе 9.2.1.1 \"Можно использовать без мыши\".</p>",
  "_STEP_9_4_1_2_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация этапа проверки по WCAG 2.1</h3>",
  "_STEP_9_4_1_2_CLASSIFICATION_4_": "<h4 id=\"_guideline\">Руководство</h4>",
  "_STEP_9_4_1_2_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#compatible\">Руководство 4.1 Совместимость: Максимизировать совместимость с текущими и будущими пользовательскими агентами, включая вспомогательные технологии.</a></p></li></ul>",
  "_STEP_9_4_1_2_CLASSIFICATION_6_": "<h4 id=\"_success_criterion\">Критерий успеха</h4>",
  "_STEP_9_4_1_2_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#name-role-value\">4.1.2 Имя, Роль, Значение</a> (Уровень A)</p></li></ul>",
  "_STEP_9_4_1_2_CLASSIFICATION_8_": "<h4 id=\"_techniques\">Техники</h4>",
  "_STEP_9_4_1_2_CLASSIFICATION_9_": "<h5 id=\"_general_techniques\">Общие техники</h5>",
  "_STEP_9_4_1_2_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G10.html\">G10: Создание компонентов с использованием технологии, поддерживающей функции API доступности платформ, на которых будут работать пользовательские агенты, для раскрытия имен и ролей, позволяя свойства, устанавливаемые пользователем, быть непосредственно установленными, и предоставляя уведомление об изменениях</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G108.html\">G108: Использование функций разметки для раскрытия имени и роли, позволяя свойства, устанавливаемые пользователем, быть непосредственно установленными, и предоставляя уведомление об изменениях</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G135.html\">G135: Использование функций API доступности технологии для раскрытия имен и ролей, позволяя свойства, устанавливаемые пользователем, быть непосредственно установленными, и предоставляя уведомление об изменениях</a></p></li></ul>",
  "_STEP_9_4_1_2_CLASSIFICATION_11_": "<h5 id=\"_html_techniques\">HTML Техники</h5>",
  "_STEP_9_4_1_2_CLASSIFICATION_12_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H64.html\">H64: Использование атрибута title элементов frame и iframe</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H91.html\">H91: Использование HTML-элементов форм и ссылок</a></p></li></ul>",
  "_STEP_9_4_1_2_CLASSIFICATION_13_": "<h5 id=\"_aria_techniques\">ARIA Техники</h5>",
  "_STEP_9_4_1_2_CLASSIFICATION_14_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA4.html\">ARIA4: Использование роли WAI-ARIA для раскрытия роли компонента пользовательского интерфейса</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA5.html\">ARIA5: Использование атрибутов состояния и свойств WAI-ARIA для раскрытия состояния компонента пользовательского интерфейса</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA14.html\">ARIA14: Использование aria-label для предоставления невидимой метки, когда видимая метка не может быть использована</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA16.html\">ARIA16: Использование aria-labelledby для предоставления имени элементов управления пользовательского интерфейса</a></p></li></ul>",
  "_STEP_9_4_1_2_CLASSIFICATION_15_": "<h4 id=\"_failures\">Неудачи</h4>",
  "_STEP_9_4_1_2_CLASSIFICATION_16_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F15.html\">F15: Несоблюдение критерия успеха 4.1.2 из-за реализации пользовательских элементов управления, которые не используют API доступности для технологии или делают это не полностью</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F20.html\">F20: Несоблюдение критериев успеха 1.1.1 и 4.1.2 из-за необновления текстовых альтернатив при изменениях в нон-текстовом контенте</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F59.html\">F59: Несоблюдение критерия успеха 4.1.2 из-за использования скрипта для превращения div или span в элемент управления интерфейса в HTML</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F79.html\">F79: Несоблюдение критерия успеха 4.1.2 из-за того, что состояние фокуса компонента пользовательского интерфейса нельзя определить программно или отсутствует уведомление о изменении состояния фокуса</a></p></li></ul>"
}