{
  "_STEP_9_2_5_4_NAME_": "Alternativen für Bewegungsaktivierung",
  "_STEP_9_2_5_4_NAME_MENU_": "9.2.5.4 Alternativen für Bewegungsaktivierung",
  "_STEP_9_2_5_4_WHAT_CHECKED_1_": "<p>Wenn Webinhalte auf die Bewegung eines mobilen Gerätes reagieren oder wenn Bewegungen der Nutzenden von Gerätesensoren oder der Kamera erfasst werden, um Funktionen auszulösen, sollten hierfür alternative Eingabemöglichkeiten vorhanden sein, und die Bewegungseingabe soll von Nutzenden abgeschaltet werden können.</p>",
  "_STEP_9_2_5_4_WHAT_CHECKED_2_": "<p>Der Prüfschritt gilt nicht für Bewegungseingaben, die für die Funktion wesentlich sind, z. B. wenn ein Bewegungssensor die Schritte einer Person aufzeichnet, oder wenn die Bewegung Teil einer zugänglichkeits-unterstützten Hilfsmitteleingabe ist.</p>",
  "_STEP_9_2_5_4_WHAT_CHECKED_3_": "<p>Abschaltbarkeit der Bewegungseingabe: Gegebenenfalls können Webinhalte diese Anforderung erfüllen, indem sie Betriebssystemeinstellungen unterstützen, die es den Nutzenden ermöglichen, die Bewegungserkennung auf Systemebene zu deaktivieren.</p>",
  "_STEP_9_2_5_4_WHY_CHECKED_1_": "<p>Menschen mit motorischen Einschränkungen können Bewegungseingaben oft nicht, oder nicht gezielt, ausführen. In manchen Fällen sind Geräte fest montiert, zum Beispiel an einem Rollstuhl, was Bewegungseingaben unmöglich macht. Deshalb ist es wichtig, dass es auch andere Möglichkeiten der Eingabe über Bedienelemente des Webinhaltes gibt.</p>",
  "_STEP_9_2_5_4_WHY_CHECKED_2_": "<p>Bei anderen motorischen Einschränkungen kann es durch unwillkürliche Bewegungen zu ungewollten Eingaben kommen. Deshalb ist es wichtig, dass sich von Webinhalten bereitgestellte motorische Eingaben deaktivieren lassen.</p>",
  "_STEP_9_2_5_4_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_2_5_4_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn Webinhalte bestimmte Bewegungseingaben definieren, etwa die Bewegung durch eine 360-Grad-Rundumansicht durch ein Rotieren des Geräts, oder das Blättern durch eine Folge von Präsentationsfolien durch ruckartige Seitwärtsbewegungen.</p>",
  "_STEP_9_2_5_4_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_2_5_4_HOW_CHECKED_4_": "<ol><li><p>Über Bewegungen, Quellcode-Prüfung oder geeignete Hilfsfunktionen, die in Scripten das Vorhandensein von Motion-Eventhandlern aufzeigen, prüfen, ob der Webinhalt in irgend einer Weise auf Bewegungseingaben reagiert.</p></li><li><p>Für alle Funktionen, die über Bewegungseingabe ausgelöst werden, prüfen, ob alternative Eingabemöglichkeiten über Bedienelemente bestehen.</p></li><li><p>Prüfen, ob sich vorhandene Bewegungseingaben abschalten lassen.</p></li></ol>",
  "_STEP_9_2_5_4_HOW_CHECKED_5_": "<h3 id=\"_3_bewertung\">3. Bewertung</h3>",
  "_STEP_9_2_5_4_HOW_CHECKED_6_": "<h4 id=\"_prüfschritt_erfüllt\">Prüfschritt erfüllt</h4>",
  "_STEP_9_2_5_4_HOW_CHECKED_7_": "<ul><li><p>Von Webinhalten definierte Bewegungseingaben haben eine alternative Eingabemöglichkeit über zugängliche Bedienelemente oder lassen sich vom Nutzer wirkungsvoll deaktivieren (ggf. über Einstellungen des Betriebssystems).</p></li></ul>",
  "_STEP_9_2_5_4_SOURCES_1_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/motion-actuation.html\"> Understanding Success Criterion 2.5.4: Motion Actuation</a> (zur Zeit nur auf Englisch verfügbar)</p></li></ul>",
  "_STEP_9_2_5_4_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_2_5_4_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Guideline</h4>",
  "_STEP_9_2_5_4_CLASSIFICATION_3_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#input-modalities\"> Guideline 2.5 Input Modalities: Make it easier for users to operate functionality through various inputs beyond keyboard</a></p></li></ul>",
  "_STEP_9_2_5_4_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Success criterion</h4>",
  "_STEP_9_2_5_4_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#motion-actuation\"> 2.5.4 Motion Actuation</a> (Level A)</p></li></ul>",
  "_STEP_9_2_5_4_CLASSIFICATION_6_": "<h4 id=\"_sufficient_techniques\">Sufficient Techniques</h4>",
  "_STEP_9_2_5_4_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G213\"> G213: Provide conventional controls and an application setting for motion activated input</a></p></li></ul>",
  "_STEP_9_2_5_4_CLASSIFICATION_8_": "<h4 id=\"_failures\">Failures</h4>",
  "_STEP_9_2_5_4_CLASSIFICATION_9_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F106\"> F106: Failure due to inability to deactivate motion actuation</a></p></li></ul>"
}