{
  "_STEP_9_2_5_4_NAME_": "Альтернативы для активации движением",
  "_STEP_9_2_5_4_NAME_MENU_": "9.2.5.4 Альтернативы для активации движением",
  "_STEP_9_2_5_4_WHAT_CHECKED_1_": "<p>Если веб-контент реагирует на движение мобильного устройства или на движения пользователей, зафиксированные датчиками устройства или камерой для активации функций, должны быть предусмотрены альтернативные способы ввода, и пользователи должны иметь возможность отключить ввод движением.</p>",
  "_STEP_9_2_5_4_WHAT_CHECKED_2_": "<p>Этот шаг проверки не применяется к вводу движения, который является существенным для функции, например, когда датчик движения записывает шаги человека, или когда движение является частью вспомогательного средства ввода.</p>",
  "_STEP_9_2_5_4_WHAT_CHECKED_3_": "<p>Отключение ввода движения: Веб-контент может соответствовать этому требованию, поддерживая настройки операционной системы, которые позволяют пользователям отключать определение движений на системном уровне.</p>",
  "_STEP_9_2_5_4_WHY_CHECKED_1_": "<p>Люди с ограниченными физическими возможностями часто не могут или не могут точно выполнять жесты движения. В некоторых случаях устройства закреплены, например, на инвалидной коляске, что делает невозможным выполнение жестов движения. Поэтому важно, чтобы существовали другие способы ввода через элементы управления веб-контента.</p>",
  "_STEP_9_2_5_4_WHY_CHECKED_2_": "<p>При других моторных нарушениях непроизвольные движения могут привести к нежелательным вводам. Поэтому важно, чтобы моторные вводы, предоставляемые веб-контентом, можно было отключить.</p>",
  "_STEP_9_2_5_4_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость шага проверки</h3>",
  "_STEP_9_2_5_4_HOW_CHECKED_2_": "<p>Шаг проверки применим, если веб-контент определяет определенные вводы движения, например, просмотр 360-градусного вида путем вращения устройства, или листание через последовательность слайдов презентации с помощью резких боковых движений.</p>",
  "_STEP_9_2_5_4_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_2_5_4_HOW_CHECKED_4_": "<ol><li><p>Проверить, реагирует ли веб-контент на движения, используя проверку исходного кода или соответствующие вспомогательные функции, отображающие наличие обработчиков событий движения.</p></li><li><p>Для всех функций, активируемых вводом движения, проверить, существуют ли альтернативные способы ввода через элементы управления.</p></li><li><p>Проверить, можно ли отключить существующий ввод движения.</p></li></ol>",
  "_STEP_9_2_5_4_HOW_CHECKED_5_": "<h3 id=\"_3_bewertung\">3. Оценка</h3>",
  "_STEP_9_2_5_4_HOW_CHECKED_6_": "<h4 id=\"_prüfschritt_erfüllt\">Шаг проверки выполнен</h4>",
  "_STEP_9_2_5_4_HOW_CHECKED_7_": "<ul><li><p>Движения, определенные веб-контентом, имеют альтернативный способ ввода через доступные элементы управления или могут быть эффективно отключены пользователем (возможно, через настройки операционной системы).</p></li></ul>",
  "_STEP_9_2_5_4_SOURCES_1_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/motion-actuation.html\">Понимание критерия успеха 2.5.4: Активация движением</a> (в настоящее время доступно только на английском языке)</p></li></ul>",
  "_STEP_9_2_5_4_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация шага проверки по WCAG 2.1</h3>",
  "_STEP_9_2_5_4_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Руководящие принципы</h4>",
  "_STEP_9_2_5_4_CLASSIFICATION_3_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#input-modalities\">Руководящий принцип 2.5 Вводные модальности: Облегчение использования функциональности пользователями через различные входы, отличные от клавиатуры</a></p></li></ul>",
  "_STEP_9_2_5_4_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Критерий успеха</h4>",
  "_STEP_9_2_5_4_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#motion-actuation\">2.5.4 Активация движением</a> (Уровень A)</p></li></ul>",
  "_STEP_9_2_5_4_CLASSIFICATION_6_": "<h4 id=\"_sufficient_techniques\">Достаточные техники</h4>",
  "_STEP_9_2_5_4_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G213\">G213: Предоставление обычных управлений и настройки приложения для ввода, активируемого движением</a></p></li></ul>",
  "_STEP_9_2_5_4_CLASSIFICATION_8_": "<h4 id=\"_failures\">Отказы</h4>",
  "_STEP_9_2_5_4_CLASSIFICATION_9_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F106\">F106: Отказ из-за невозможности деактивировать активацию движением</a></p></li></ul>"
}