{
  "_STEP_7_1_5_NAME_": "Gesprochene Untertitel",
  "_STEP_7_1_5_WHAT_CHECKED_1_": "<p>Wenn das Webangebot Videos mit einem Originalton enthält, der nicht der Hauptsprache des Webangebots entspricht, sollen zuschaltbare bzw. programmatisch ermittelbare Untertitel, die in der Hauptsprache der Seite angeboten werden, als akustische Ausgabe zugänglich sein, z.B. über eine eigene Tonspur, die den Untertiteln entspricht, oder über eine generierte Sprachausgabe der Untertitel. Nicht programmatisch ermittelbar sind Untertitel, die \"fest eingebrannt\" (open captions), also Teil der Bildinformation, sind.</p>",
  "_STEP_7_1_5_WHY_CHECKED_1_": "<p>Für Menschen, die den fremdsprachigen Originalton eines Videos nicht verstehen, ist eine Übersetzung in Untertiteln in der eigenen Sprache wichtig. Diese Untertitel sollen auch für blinde oder seheingeschränkte Menschen als akustische Ausgabe zugänglich sein.</p>",
  "_STEP_7_1_5_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_7_1_5_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar:</p>",
  "_STEP_7_1_5_HOW_CHECKED_3_": "<ul><li><p>wenn der Original-Ton des Videos fremdsprachig ist (d.h. er entspricht nicht der Hauptsprache des Webauftritts)</p></li><li><p>und Untertitel in der Hauptsprache des Webauftritts bereitgestellt werden</p></li><li><p>und wenn es keine Version des Videos mit einer Tonspur in der Hauptsprache des Webauftritts gibt.</p></li></ul>",
  "_STEP_7_1_5_HOW_CHECKED_4_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_7_1_5_HOW_CHECKED_5_": "<ol><li><p>Webangebot öffnen.</p></li><li><p>Prüfen, ob der Originalton des Videos von der Hauptsprache des Webangebots abweicht.</p></li><li><p>Prüfen, ob für Videos mit fremdsprachiger Tonspur Untertitel in der Hauptsprache des Webangebots angeboten werden.</p></li><li><p>Prüfen, ob sich eine alternative Tonspur in der Hauptsprache des Angebots oder eine generierte Sprachausgabe der Untertitel aktivieren lässt.</p></li></ol>",
  "_STEP_7_1_5_HOW_CHECKED_6_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_7_1_5_HOW_CHECKED_7_": "<ul><li><p>Gängige Video-Player verfügen derzeit meist nicht über die Möglichkeit einer einschaltbaren Sprachausgabe der Untertitel.</p></li><li><p>Für blinde oder sehbehinderte Menschen, die den fremdsprachigen Originalton eines Videos nicht verstehen, sollen Untertitel in der Hauptsprache der Webseite als akustische Ausgabe zugänglich sein. Ist der Original-Ton des Videos bereits in der Hauptsprache, so gelten Untertitel in anderen Sprachen als zusätzliche Informationen und sind daher nicht von der Anforderung betroffen.</p></li></ul>",
  "_STEP_7_1_5_HOW_CHECKED_8_": "<p>Hinweise zu diesem Prüfschritt können Sie auf GitHub <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">in einem Issue anlegen</a>.</p>",
  "_STEP_7_1_5_HOW_CHECKED_9_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_7_1_5_HOW_CHECKED_10_": "<h4 id=\"_nicht_erfüllt\">Nicht erfüllt:</h4>",
  "_STEP_7_1_5_HOW_CHECKED_11_": "<ul><li><p>Bei Videos mit fremdsprachiger Tonspur und zuschaltbaren Untertiteln in der Hauptsprache sind die Untertitel nicht als akustische Ausgabe zugänglich.</p></li></ul>",
  "_STEP_7_1_5_SOURCES_1_": "<ul><li><p>Empfehlungen für die Audio-Darstellung von Text in Videos, einschließlich Untertitel und andere Texte im Bild (ITU Version, Englisch, kostenlos) <a href=\"https://www.itu.int/rec/T-REC-T.701.25-202203-I/en\">ITU T.701.25 : Guidance on the audio presentation of text in videos, including captions, subtitles and other on-screen text (itu.int)</a></p></li></ul>",
  "_STEP_7_1_5_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v_3_2_1\">Einordnung des Prüfschritts nach EN 301 549 v.3.2.1</h3>",
  "_STEP_7_1_5_CLASSIFICATION_2_": "<h4 id=\"_7_1_5_spoken_subtitles\">7.1.5 Spoken subtitles</h4>",
  "_STEP_7_1_5_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where ICT displays video with synchronized audio, it shall have a mode of operation to provide a spoken output of the available captions, except where the content of the displayed captions is not programmatically determinable.</p><p>NOTE 1: Being able to manage speech output range for spoken subtitles independently from general ICT speech is preferable for most users. That is possible when the audio file with spoken subtitle is delivered in a separate audio track and mixed in the end users device.</p></div></div>"
}