{
  "_STEP_7_1_5_NAME_": "Озвученные субтитры",
  "_STEP_7_1_5_NAME_MENU_": "7.1.5 Озвученные субтитры",
  "_STEP_7_1_5_WHAT_CHECKED_1_": "<p>Если веб-приложение содержит видео с оригинальной звуковой дорожкой, которая не соответствует основному языку веб-приложения, должны быть предложены включаемые или программно определяемые субтитры на основном языке сайта, доступные для акустического воспроизведения, например, через отдельную звуковую дорожку, соответствующую субтитрам, или через генерированное голосовое озвучивание субтитров. Не программно определяемые субтитры, которые 'вживлены' (open captions), то есть являются частью изображения, не подходят.</p>",
  "_STEP_7_1_5_WHY_CHECKED_1_": "<p>Для людей, которые не понимают иностранный оригинальный звук видео, важен перевод на субтитрах на их родном языке. Эти субтитры также должны быть доступны для слепых или слабовидящих людей в форме аудио.</p>",
  "_STEP_7_1_5_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость проверки</h3>",
  "_STEP_7_1_5_HOW_CHECKED_2_": "<p>Этап проверки применим:</p>",
  "_STEP_7_1_5_HOW_CHECKED_3_": "<ul><li><p>если оригинальная звуковая дорожка видео иностранная (то есть не соответствует основному языку веб-сайта)</p></li><li><p>и субтитры предоставляются на основном языке веб-сайта</p></li><li><p>и если нет версии видео с звуковой дорожкой на основном языке веб-сайта.</p></li></ul>",
  "_STEP_7_1_5_HOW_CHECKED_4_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_7_1_5_HOW_CHECKED_5_": "<ol><li><p>Открыть веб-приложение.</p></li><li><p>Проверить, отличается ли оригинальная звуковая дорожка видео от основного языка веб-сайта.</p></li><li><p>Проверить, предлагаются ли для видео с иностранной звуковой дорожкой субтитры на основном языке веб-сайта.</p></li><li><p>Проверить, можно ли включить альтернативную звуковую дорожку на основном языке приложения или сгенерированное голосовое озвучивание субтитров.</p></li></ol>",
  "_STEP_7_1_5_HOW_CHECKED_6_": "<h3 id=\"_3_hinweise\">3. Примечания</h3>",
  "_STEP_7_1_5_HOW_CHECKED_7_": "<ul><li><p>Большинство современных видеоплееров пока не предоставляют возможность включения голосового озвучивания субтитров.</p></li><li><p>Для слепых или слабовидящих людей, которые не понимают иностранный оригинальный звук видео, субтитры на основном языке веб-сайта должны быть доступны в виде аудио. Если оригинальный звук видео уже на основном языке, субтитры на других языках считаются дополнительной информацией и поэтому не подпадают под это требование.</p></li></ul>",
  "_STEP_7_1_5_HOW_CHECKED_8_": "<p>Для получения комментариев по этому этапу проверки вы можете создать <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">задачу на GitHub</a>.</p>",
  "_STEP_7_1_5_HOW_CHECKED_9_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_7_1_5_HOW_CHECKED_10_": "<h4 id=\"_nicht_erfüllt\">Не выполнено:</h4>",
  "_STEP_7_1_5_HOW_CHECKED_11_": "<ul><li><p>Для видео с иностранным звуком и переключаемыми субтитрами на основном языке, субтитры не доступны в виде аудио.</p></li></ul>",
  "_STEP_7_1_5_SOURCES_1_": "<ul><li><p>Рекомендации по аудио-представлению текста в видео, включая субтитры и другие тексты на экране (версия ITU, английский, бесплатно) <a href=\"https://www.itu.int/rec/T-REC-T.701.25-202203-I/en\">ITU T.701.25 : Guidance on the audio presentation of text in videos, including captions, subtitles and other on-screen text (itu.int)</a></p></li></ul>",
  "_STEP_7_1_5_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v_3_2_1\">Классификация этапа проверки по EN 301 549 v.3.2.1</h3>",
  "_STEP_7_1_5_CLASSIFICATION_2_": "<h4 id=\"_7_1_5_spoken_subtitles\">7.1.5 Озвученные субтитры</h4>",
  "_STEP_7_1_5_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where ICT displays video with synchronized audio, it shall have a mode of operation to provide a spoken output of the available captions, except where the content of the displayed captions is not programmatically determinable.</p><p>NOTE 1: Being able to manage speech output range for spoken subtitles independently from general ICT speech is preferable for most users. That is possible when the audio file with spoken subtitle is delivered in a separate audio track and mixed in the end users device.</p></div></div>"
}