{
  "_STEP_9_1_4_1_NAME_": "Ohne Farben nutzbar",
  "_STEP_9_1_4_1_NAME_MENU_": "9.1.4.1 Ohne Farben nutzbar",
  "_STEP_9_1_4_1_WHAT_CHECKED_1_": "<p>Über Farben vermittelte Informationen sollen auch <strong>ohne</strong> Wahrnehmung der Farbe verfügbar sein, also zusätzlich durch andere Mittel (etwa Fettung oder Einrückung) hervorgehoben sein.</p>",
  "_STEP_9_1_4_1_WHY_CHECKED_1_": "<p>Ausschließlich über Farben vermittelte Informationen sind für blinde Nutzende nicht zugänglich. Auch farbfehlsichtige Nutzende, die unter Umständen mit eigenen Farbschemata arbeiten, können Farben nicht oder nur eingeschränkt identifizieren und unterscheiden.</p>",
  "_STEP_9_1_4_1_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_1_4_1_HOW_CHECKED_2_": "<p>Der Prüfschritt ist immer anwendbar.</p>",
  "_STEP_9_1_4_1_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_1_4_1_HOW_CHECKED_4_": "<h4 id=\"_2_1_vermittlung_von_informationen_über_die_farbgebung\">2.1 Vermittlung von Informationen über die Farbgebung</h4>",
  "_STEP_9_1_4_1_HOW_CHECKED_5_": "<p>Prüfen, ob die Webseite Elemente enthält, die durch Farbgebung Informationen vermitteln. Beispiele dafür:</p>",
  "_STEP_9_1_4_1_HOW_CHECKED_6_": "<ul><li><p>Überschriften werden farblich hervorgehoben</p></li><li><p>Ausgewählte Menueinträge werden in einer anderen Farbe dargestellt</p></li><li><p>Links im Fließtext werden in einer anderen Farbe dargestellt</p></li><li><p>Eine Grafik verwendet unterschiedliche Farben für die vergleichende Darstellung des Kursverlaufs verschiedener Aktien</p></li><li><p>Pflichtfelder in Formularen werden farblich gekennzeichnet (die gelb unterlegten Felder müssen immer ausgefüllt werden)</p></li></ul>",
  "_STEP_9_1_4_1_HOW_CHECKED_7_": "<p>Solche Hervorhebungen sind positiv. Die Vermittlung wichtiger Informationen soll sich aber <strong>nicht ausschließlich</strong> auf <strong>einfache</strong> Farbänderungen stützen. Zu prüfen ist also, ob die Informationen zusätzlich noch auf einem anderen Weg vermittelt werden.</p>",
  "_STEP_9_1_4_1_HOW_CHECKED_8_": "<p>Beispiele für zusätzliche Vermittlung:</p>",
  "_STEP_9_1_4_1_HOW_CHECKED_9_": "<ul><li><p>Überschriften sind zusätzlich eingerückt oder durch eine andere Schriftgröße hervorgehoben (das ist fast immer der Fall).</p></li><li><p>Ausgewählte Menueinträge haben einen Kontrastunterschied von mehr als 3:1 zur Farbe benachbarter Einträge oder sind durch Einrückung, Fettung, Unterstreichung, zusätzliche Elemente für die Hervorhebung, Änderung der Form des Menü-Eintrags oder dergleichen hervorgehoben.</p></li><li><p>Links im Fließtext sind nicht nur farblich abgesetzt, sondern durch ein weiteres visuelles Merkmal unterschieden: z.B. zusätzlich unterstrichen, gefettet oder kursiv, invertiert oder mit einer Markierung versehen. <strong>Ausnahme:</strong> Das Kontrastverhältnis zwischen Linkfarbe und umgebender Textfarbe ist 3:1 oder besser. In diesem Fall kann im Ausgangszustand auf die zusätzliche Hervorhebung verzichtet werden. Die Links müssen dann aber bei Fokuserhalt zusätzlich hervorgehoben werden.</p></li><li><p>Linien in Schaubildern sind zusätzlich gestrichelt oder durchgezogen, Flächen haben unterscheidbare Muster.</p></li><li><p>Pflichtfelder im Formular sind zusätzlich mit einem Stern mit Bedeutungserklärung am Formularbeginn) oder textlich (\"Pflichtfeld\") gekennzeichnet.</p></li></ul>",
  "_STEP_9_1_4_1_HOW_CHECKED_10_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_9_1_4_1_HOW_CHECKED_11_": "<p>Es gibt verschiedene Arten, Information nicht nur über Farbe zu vermitteln:</p>",
  "_STEP_9_1_4_1_HOW_CHECKED_12_": "<ul><li><p>Ein Menüeintrag ist farblich hervorgehoben, aber ein Breadcrumb nennt zusätzlich, welche Seite ausgewählt ist</p></li><li><p>Ein Menüeintrag ist farblich hervorgehoben, aber es gibt zusätzlich eine gleichlautende Überschrift, die dem Menüeintrag jeweils entspricht</p></li><li><p>Ein Icon wechselt die Farbe, aber es ändert sich außerdem die nachfolgende Beschriftung</p></li><li><p>ein Bedienelement ändert bei Fokussierung die Farbe, aber es kommt zusätzlich ein äußerer Rahmen hinzu, der ausreichend zum Hintergrund kontrastiert</p></li><li><p>Farbumkehr ausreichend kontrastreicher Elemente: Vorder- und Hintergrundfarbe eines Elements werden bei Fokussierung oder Aktivierung ausgetauscht</p></li></ul>",
  "_STEP_9_1_4_1_HOW_CHECKED_13_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_9_1_4_1_HOW_CHECKED_14_": "<h4 id=\"_nicht_voll_erfüllt\">Nicht voll erfüllt</h4>",
  "_STEP_9_1_4_1_HOW_CHECKED_15_": "<ul><li><p>Fließtextlinks sind von ihrer Textumgebung nur durch abweichende Farbe mit einem Kontrastunterschied von unter 3:1 unterscheidbar.</p></li></ul>",
  "_STEP_9_1_4_1_HOW_CHECKED_16_": "<h4 id=\"_nicht_erfüllt\">Nicht erfüllt</h4>",
  "_STEP_9_1_4_1_HOW_CHECKED_17_": "<ul><li><p>Informationen (etwa richtig / falsch) werden lediglich über die Farbe (etwa grün=richtig, rot=falsch) vermittelt.</p></li></ul>",
  "_STEP_9_1_4_1_SOURCES_1_": "<h3 id=\"_use_of_color_understanding_sc_1_4_1\">Use of Color: Understanding SC 1.4.1</h3>",
  "_STEP_9_1_4_1_SOURCES_2_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>The intent of this Success Criterion is to ensure that all users can access information that is conveyed by color differences, that is, by the use of color where each color has a meaning assigned to it. If the information is conveyed through color differences in an image (or other non-text format), the color may not be seen by users with color deficiencies. In this case, providing the information conveyed with color through another visual means ensures users who cannot see color can still perceive the information.</p><p>Color is an important asset in design of Web content, enhancing its aesthetic appeal, its usability, and its accessibility. However, some users have difficulty perceiving color. People with partial sight often experience limited color vision, and many older users do not see color well. In addition, people using text-only, limited-color or monochrome displays and browsers will be unable to access information that is presented only in color.</p><p>Examples of information conveyed by color differences: \"required fields are red\", \"error is shown in red\", and \"Mary’s sales are in red, Tom’s are in blue\". Examples of indications of an action include: using color to indicate that a link will open in a new window or that a database entry has been updated successfully. An example of prompting a response would be: using highlighting on form fields to indicate that a required field had been left blank.</p><p>Note: This should not in any way discourage the use of color on a page, or even color coding if it is redundant with other visual indication.</p></blockquote></div>",
  "_STEP_9_1_4_1_SOURCES_3_": "<p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/use-of-color.html\" class=\"bare\">https://www.w3.org/WAI/WCAG21/Understanding/use-of-color.html</a></p>",
  "_STEP_9_1_4_1_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Abgrenzung zu anderen Prüfschritten</h3>",
  "_STEP_9_1_4_1_CLASSIFICATION_2_": "<h4 id=\"_abgrenzung_zur_prüfung_der_kontraste\">Abgrenzung zur Prüfung der Kontraste</h4>",
  "_STEP_9_1_4_1_CLASSIFICATION_3_": "<p>In diesem Prüfschritt geht es nicht um die Prüfung der Kontraste zum Hintergrund. Dies ist Aufgabe der Prüfkriterien 9.1.4.3 \"Kontraste von Texten ausreichend\" und 9.1.4.11 \"Kontraste von Grafiken und grafischen Bedienelementen ausreichend\".</p>",
  "_STEP_9_1_4_1_CLASSIFICATION_4_": "<p>Für Fließtext-Links gilt ein deutlicher Kontrast (mindestens 3,0:1) der Linkfarbe zur Farbe des umgebenden Textes ausreichend, um diese Anforderung zu erfüllen. Es ist dann keine zusätzliche Hervorhebung nötig. Für die Erfüllung von 9.1.4.3 Kontraste von Texten ausreichend muss jedoch gewährleistet sein, dass die Linkfarbe zum Hintergrund 4,5:1 erfüllt.</p>",
  "_STEP_9_1_4_1_CLASSIFICATION_5_": "<h4 id=\"_abgrenzung_zum_prüfschritt_9_1_3_3_ohne_bezug_auf_sensorische_merkmale_nutzbar\">Abgrenzung zum Prüfschritt 9.1.3.3. Ohne Bezug auf sensorische Merkmale nutzbar</h4>",
  "_STEP_9_1_4_1_CLASSIFICATION_6_": "<p>In diesem Prüfschritt geht es nicht um die Prüfung von Verweisen auf Seiteninhalte mit Hilfe der Angabe von Farben. Die sinnesunabhängige Bereitstellung von Verweisen auf Seiteninhalte wird im Prüfschritt 9.1.3.3 \"Ohne Bezug auf sensorische Merkmale nutzbar\" geprüft.</p>",
  "_STEP_9_1_4_1_CLASSIFICATION_7_": "<h4 id=\"_abgrenzung_zur_prüfung_des_markups\">Abgrenzung zur Prüfung des Markups</h4>",
  "_STEP_9_1_4_1_CLASSIFICATION_8_": "<p>In diesem Prüfschritt wird die Auszeichnung von Elementen durch Markup nicht beachtet. Es geht also um die mehrgleisige Vermittlung von Informationen <strong>auf dem Bildschirm</strong>. Bei den Prüfkriterien zur richtigen Auszeichnung geht es dagegen darum, dass Informationen <strong>unabhängig</strong> von der Darstellung auf dem Bildschirm verfügbar sind oder dass der Benutzer die Darstellung auf dem Bildschirm <strong>anpassen</strong> kann.</p>",
  "_STEP_9_1_4_1_CLASSIFICATION_9_": "<h4 id=\"_abgrenzung_zu_fehlenden_hervorhebungen\">Abgrenzung zu fehlenden Hervorhebungen</h4>",
  "_STEP_9_1_4_1_CLASSIFICATION_10_": "<p>In diesem Prüfschritt 9.1.4.1 geht es um die Farbunabhängigkeit <strong>vorhandener</strong> Seitenelemente.</p>",
  "_STEP_9_1_4_1_CLASSIFICATION_11_": "<p>Eine negative Bewertung ist also beispielsweise angebracht, wenn Links im Text oder Menü-Elemente nur durch die Farbe (und nicht zusätzlich durch Unterstreichung, Fettung oder andere Markierung) gekennzeichnet sind. Wenn Links im Text <strong>überhaupt nicht</strong> gekennzeichnet sind, ist dies zwar nicht nutzerfreundlich, aber wird in diesem Prüfschritt nicht negativ bewertet.</p>",
  "_STEP_9_1_4_1_CLASSIFICATION_12_": "<p>Kennzeichnung der aktuellen Menüposition: Ein Webangebot, das die aktuelle Position <em>überhaupt nicht</em> anzeigt, verstößt nicht gegen diesen Prüfschritt 9.1.4.1.</p>",
  "_STEP_9_1_4_1_CLASSIFICATION_13_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_1_4_1_CLASSIFICATION_14_": "<h4 id=\"_guidelines\">Guidelines</h4>",
  "_STEP_9_1_4_1_CLASSIFICATION_15_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#distinguishable\"> Guideline 1.4 Distinguishable: Make it easier for users to see and hear content including separating foreground from background</a></p></li></ul>",
  "_STEP_9_1_4_1_CLASSIFICATION_16_": "<h4 id=\"_success_criteria\">Success criteria</h4>",
  "_STEP_9_1_4_1_CLASSIFICATION_17_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#use-of-color\"> 1.4.1 Use of Color</a> (Level A)</p></li><li><p><a href=\"https://www.w3.org/TR/WCAG21/#non-text-contrast\"> 1.4.11 Non-text contrast</a> (Level AA)</p></li></ul>",
  "_STEP_9_1_4_1_CLASSIFICATION_18_": "<h4 id=\"_techniques\">Techniques</h4>",
  "_STEP_9_1_4_1_CLASSIFICATION_19_": "<h5 id=\"_general_techniques\">General Techniques</h5>",
  "_STEP_9_1_4_1_CLASSIFICATION_20_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G14.html\"> G14: Ensuring that information conveyed by color differences is also available in text</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G111.html\"> G111: Using color and pattern</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G182.html\"> G182: Ensuring that additional visual cues are available when text color differences are used to convey information</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G183.html\"> G183: Using a contrast ratio of 3:1 with surrounding text and providing additional visual cues on focus for links or controls where color alone is used to identify them</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G205.html\"> G205: Including a text cue for colored form control labels</a></p></li></ul>",
  "_STEP_9_1_4_1_CLASSIFICATION_21_": "<h5 id=\"_failures\">Failures</h5>",
  "_STEP_9_1_4_1_CLASSIFICATION_22_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F13.html\"> F13: Failure of Success Criterion 1.4.1 due to having a text alternative that does not include information that is conveyed by color differences in the image</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F73.html\"> F73: Failure of Success Criterion 1.4.1 due to creating links that are not visually evident without color vision</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F81.html\"> F81: Failure of Success Criterion 1.4.1 due to identifying required or error fields using color differences only</a></p></li></ul>",
  "_STEP_9_1_4_1_QUESTIONS_1_": "<h3 id=\"_häufig_werden_besuchte_links_in_einer_anderen_farbe_dargestellt_fällt_das_auch_unter_diesen_prüfschritt\">Häufig werden besuchte Links in einer anderen Farbe dargestellt Fällt das auch unter diesen Prüfschritt?</h3>",
  "_STEP_9_1_4_1_QUESTIONS_2_": "<p>Die Unterscheidung besuchter und nicht besuchter Links ist hilfreich. Der Benutzer kann gleich sehen, welche Seiten er schon besucht hat. Ideal wäre es daher, wenn besuchte Links zum Beispiel zusätzlich durch eine andere Unterstreichung markiert würden.</p>",
  "_STEP_9_1_4_1_QUESTIONS_3_": "<p>Aber die verfügbaren Gestaltungsmöglichkeiten sind begrenzt. Und zu viele unterschiedliche Kennzeichnungen von Links können auch Verwirrung stiften.</p>",
  "_STEP_9_1_4_1_QUESTIONS_4_": "<p>In diesem Prüfschritt des BITV-Tests wird die Kennzeichnung besuchter Links nicht berücksichtigt, sie ist für die Bewertung nicht relevant.</p>"
}
