{
  "_STEP_9_1_4_1_NAME_": "Использование без опоры на цвет",
  "_STEP_9_1_4_1_WHAT_CHECKED_1_": "<p>Информация, передаваемая через цвет, должна быть доступна также <strong>без</strong> восприятия цвета, например, выделена другими способами (такими как жирный шрифт или отступ).</p>",
  "_STEP_9_1_4_1_WHY_CHECKED_1_": "<p>Информация, передаваемая исключительно через цвет, недоступна для слепых пользователей. Также пользователи с дальтонизмом, которые могут использовать собственные цветовые схемы, не могут или ограниченно могут идентифицировать и различать цвета.</p>",
  "_STEP_9_1_4_1_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_9_1_4_1_HOW_CHECKED_2_": "<p>Этот этап проверки всегда применим.</p>",
  "_STEP_9_1_4_1_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_1_4_1_HOW_CHECKED_4_": "<h4 id=\"_2_1_vermittlung_von_informationen_über_die_farbgebung\">2.1 Передача информации через цвет</h4>",
  "_STEP_9_1_4_1_HOW_CHECKED_5_": "<p>Проверить, содержит ли веб-сайт элементы, которые передают информацию через цвет. Примеры таких элементов:</p>",
  "_STEP_9_1_4_1_HOW_CHECKED_6_": "<ul><li><p>Заголовки выделены цветом</p></li><li><p>Выбранные пункты меню отображаются другим цветом</p></li><li><p>Ссылки в тексте выделены другим цветом</p></li><li><p>График использует различные цвета для сравнительного отображения курса акций</p></li><li><p>Обязательные поля в формах отмечены цветом (поля, подсвеченные желтым, должны быть заполнены)</p></li></ul>",
  "_STEP_9_1_4_1_HOW_CHECKED_7_": "<p>Такие выделения положительны. Однако передача важной информации должна <strong>не исключительно</strong> опираться на <strong>простое</strong> изменение цвета. Следует проверить, передается ли информация дополнительным способом.</p>",
  "_STEP_9_1_4_1_HOW_CHECKED_8_": "<p>Примеры дополнительной передачи информации:</p>",
  "_STEP_9_1_4_1_HOW_CHECKED_9_": "<ul><li><p>Заголовки дополнительно выделены отступом или другим размером шрифта (что почти всегда так).</p></li><li><p>Выбранные пункты меню имеют контрастное отличие более чем 3:1 от цвета соседних записей или выделены отступом, жирным шрифтом, подчеркиванием, дополнительными элементами для выделения, изменением формы пункта меню и т.д.</p></li><li><p>Ссылки в тексте не только отличаются по цвету, но и имеют другой визуальный признак: например, дополнительно подчеркнуты, выделены жирным или курсивом, инвертированы или помечены. <strong>Исключение:</strong> Контрастное соотношение между цветом ссылки и окружающим текстом составляет 3:1 или лучше. В этом случае можно отказаться от дополнительного выделения в исходном состоянии. Однако при получении фокуса ссылки должны дополнительно выделяться.</p></li><li><p>Линии на диаграммах дополнительно пунктирные или сплошные, области имеют отличимые узоры.</p></li><li><p>Обязательные поля в форме дополнительно отмечены звездочкой с объяснением значения в начале формы или текстом (\"Обязательное поле\").</p></li></ul>",
  "_STEP_9_1_4_1_HOW_CHECKED_10_": "<h3 id=\"_3_hinweise\">3. Советы</h3>",
  "_STEP_9_1_4_1_HOW_CHECKED_11_": "<p>Существуют различные способы передачи информации, не опирающиеся исключительно на цвет:</p>",
  "_STEP_9_1_4_1_HOW_CHECKED_12_": "<ul><li><p>Пункт меню выделен цветом, но дополнительно указано, какая страница выбрана через Breadcrumb</p></li><li><p>Пункт меню выделен цветом, но есть дополнительное соответствующее название, которое соответствует пункту меню</p></li><li><p>Иконка меняет цвет, но также меняется следующая подпись</p></li><li><p>Элемент управления меняет цвет при фокусировке, но также добавляется внешняя рамка, достаточно контрастная по отношению к фону</p></li><li><p>Инверсия цветов достаточно контрастных элементов: цвета переднего и заднего плана элемента меняются местами при фокусировке или активации</p></li></ul>",
  "_STEP_9_1_4_1_HOW_CHECKED_13_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_1_4_1_HOW_CHECKED_14_": "<h4 id=\"_nicht_voll_erfüllt\">Не полностью выполнено</h4>",
  "_STEP_9_1_4_1_HOW_CHECKED_15_": "<ul><li><p>Ссылки в тексте отличимы от окружающего текста только по цвету с контрастным соотношением менее 3:1.</p></li></ul>",
  "_STEP_9_1_4_1_HOW_CHECKED_16_": "<h4 id=\"_nicht_erfüllt\">Не выполнено</h4>",
  "_STEP_9_1_4_1_HOW_CHECKED_17_": "<ul><li><p>Информация (например, правильно/неправильно) передается исключительно через цвет (например, зеленый=правильно, красный=неправильно).</p></li></ul>",
  "_STEP_9_1_4_1_SOURCES_1_": "<h3 id=\"_use_of_color_understanding_sc_1_4_1\">Использование цвета: понимание SC 1.4.1</h3>",
  "_STEP_9_1_4_1_SOURCES_2_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>The intent of this Success Criterion is to ensure that all users can access information that is conveyed by color differences, that is, by the use of color where each color has a meaning assigned to it. If the information is conveyed through color differences in an image (or other non-text format), the color may not be seen by users with color deficiencies. In this case, providing the information conveyed with color through another visual means ensures users who cannot see color can still perceive the information.</p><p>Color is an important asset in design of Web content, enhancing its aesthetic appeal, its usability, and its accessibility. However, some users have difficulty perceiving color. People with partial sight often experience limited color vision, and many older users do not see color well. In addition, people using text-only, limited-color or monochrome displays and browsers will be unable to access information that is presented only in color.</p><p>Examples of information conveyed by color differences: \"required fields are red\", \"error is shown in red\", and \"Mary’s sales are in red, Tom’s are in blue\". Examples of indications of an action include: using color to indicate that a link will open in a new window or that a database entry has been updated successfully. An example of prompting a response would be: using highlighting on form fields to indicate that a required field had been left blank.</p><p>Note: This should not in any way discourage the use of color on a page, or even color coding if it is redundant with other visual indication.</p></blockquote></div>",
  "_STEP_9_1_4_1_SOURCES_3": "<p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/use-of-color.html\" class=\"bare\">https://www.w3.org/WAI/WCAG21/Understanding/use-of-color.html</a></p>",
  "_STEP_9_1_4_1_CLASSIFICATION_1": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Различие между другими этапами проверки</h3>",
  "_STEP_9_1_4_1_CLASSIFICATION_2": "<h4 id=\"_abgrenzung_zur_prüfung_der_kontraste\">Различие с проверкой контрастности</h4>",
  "_STEP_9_1_4_1_CLASSIFICATION_3": "<p>На этом этапе проверки не рассматривается проверка контрастности фона. Это задача критериев 9.1.4.3 \"Достаточный контраст текста\" и 9.1.4.11 \"Достаточный контраст графики и графических элементов управления\".</p>",
  "_STEP_9_1_4_1_CLASSIFICATION_4": "<p>Для текстовых ссылок достаточным считается явный контраст (минимум 3,0:1) цвета ссылки по отношению к цвету окружающего текста, чтобы удовлетворять этому требованию. В этом случае дополнительное выделение не требуется. Однако для выполнения критерия 9.1.4.3 \"Достаточный контраст текста\" необходимо, чтобы цвет ссылки к фону соответствовал 4,5:1.</p>",
  "_STEP_9_1_4_1_CLASSIFICATION_5": "<h4 id=\"_abgrenzung_zum_prüfschritt_9_1_3_3_ohne_bezug_auf_sensorische_merkmale_nutzbar\">Различие с этапом проверки 9.1.3.3. Используемый без ссылок на сенсорные характеристики</h4>",
  "_STEP_9_1_4_1_CLASSIFICATION_6": "<p>На этом этапе проверки не рассматривается проверка ссылок на содержание страницы с помощью указания цветов. Независимое от органов чувств предоставление ссылок на содержание страницы проверяется на этапе 9.1.3.3 \"Используемый без ссылок на сенсорные характеристики\".</p>",
  "_STEP_9_1_4_1_CLASSIFICATION_7": "<h4 id=\"_abgrenzung_zur_prüfung_des_markups\">Различие с проверкой разметки</h4>",
  "_STEP_9_1_4_1_CLASSIFICATION_8": "<p>На этом этапе проверки не учитывается разметка элементов. Речь идет о многоканальной передаче информации <strong>на экране</strong>. В критериях правильной разметки речь идет о том, чтобы информация была доступна <strong>независимо</strong> от отображения на экране или чтобы пользователь мог <strong>настроить</strong> отображение на экране.</p>",
  "_STEP_9_1_4_1_CLASSIFICATION_9": "<h4 id=\"_abgrenzung_zu_fehlenden_hervorhebungen\">Различие с отсутствием выделений</h4>",
  "_STEP_9_1_4_1_CLASSIFICATION_10": "<p>На этом этапе 9.1.4.1 рассматривается независимость от цвета <strong>существующих</strong> элементов страницы.</p>",
  "_STEP_9_1_4_1_CLASSIFICATION_11": "<p>Отрицательная оценка, например, уместна, если ссылки в тексте или элементы меню отмечены только цветом (и не дополнительно подчеркиванием, жирным шрифтом или другой маркировкой). Если ссылки в тексте <strong>вообще не</strong> отмечены, это, хоть и неудобно для пользователя, но в рамках этого этапа проверки не оценивается негативно.</p>",
  "_STEP_9_1_4_1_CLASSIFICATION_12": "<p>Отображение текущей позиции в меню: Веб-предложение, которое <em>вообще не</em> показывает текущую позицию, не нарушает этот этап проверки 9.1.4.1.</p>",
  "_STEP_9_1_4_1_CLASSIFICATION_13": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация этапа проверки по WCAG 2.1</h3>",
  "_STEP_9_1_4_1_CLASSIFICATION_14": "<h4 id=\"_guidelines\">Руководящие принципы</h4>",
  "_STEP_9_1_4_1_CLASSIFICATION_15": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#distinguishable\">Руководящий принцип 1.4 Различимость: Облегчение восприятия и слышимости контента, включая разделение переднего плана от фона</a></p></li></ul>",
  "_STEP_9_1_4_1_CLASSIFICATION_16": "<h4 id=\"_success_criteria\">Критерии успеха</h4>",
  "_STEP_9_1_4_1_CLASSIFICATION_17": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#use-of-color\">1.4.1 Использование цвета</a> (Уровень A)</p></li><li><p><a href=\"https://www.w3.org/TR/WCAG21/#non-text-contrast\">1.4.11 Контраст не текстовых элементов</a> (Уровень AA)</p></li></ul>",
  "_STEP_9_1_4_1_CLASSIFICATION_18": "<h4 id=\"_techniques\">Техники</h4>",
  "_STEP_9_1_4_1_CLASSIFICATION_19": "<h5 id=\"_general_techniques\">Общие техники</h5>",
  "_STEP_9_1_4_1_CLASSIFICATION_20": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G14.html\">G14: Обеспечение того, чтобы информация, передаваемая различиями цвета, также была доступна в тексте</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G111.html\">G111: Использование цвета и узора</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G182.html\">G182: Обеспечение наличия дополнительных визуальных подсказок, когда для передачи информации используются различия цвета текста</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G183.html\">G183: Использование коэффициента контрастности 3:1 с окружающим текстом и предоставление дополнительных визуальных подсказок при фокусировке на ссылках или элементах управления, где цвет используется для их идентификации</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G205.html\">G205: Включение текстовой подсказки для цветных меток элементов управления формы</a></p></li></ul>",
  "_STEP_9_1_4_1_CLASSIFICATION_21": "<h5 id=\"_failures\">Неудачи</h5>",
  "_STEP_9_1_4_1_CLASSIFICATION_22": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F13.html\">F13: Неудача критерия успеха 1.4.1 из-за наличия текстовой альтернативы, которая не включает информацию, передаваемую различиями цвета на изображении</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F73.html\">F73: Неудача критерия успеха 1.4.1 из-за создания ссылок, которые визуально не очевидны без цветового зрения</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F81.html\">F81: Неудача критерия успеха 1.4.1 из-за идентификации обязательных или полей с ошибками только с помощью различий в цвете</a></p></li></ul>",
  "_STEP_9_1_4_1_QUESTIONS_1": "<h3 id=\"_häufig_werden_besuchte_links_in_einer_anderen_farbe_dargestellt_fällt_das_auch_unter_diesen_prüfschritt\">Часто посещенные ссылки отображаются другим цветом. Подпадает ли это под данный этап проверки?</h3>",
  "_STEP_9_1_4_1_QUESTIONS_2": "<p>Различение посещенных и непосещенных ссылок полезно. Пользователь сразу видит, какие страницы он уже посетил. Идеально было бы, если бы посещенные ссылки, например, были бы дополнительно отмечены другим видом подчеркивания.</p>",
  "_STEP_9_1_4_1_QUESTIONS_3": "<p>Однако возможности дизайна ограничены. И слишком много разных маркировок ссылок также могут вызвать путаницу.</p>",
  "_STEP_9_1_4_1_QUESTIONS_4": "<p>На этом этапе проверки BITV-теста маркировка посещенных ссылок не учитывается, она не имеет значения для оценки.</p>"
}