{
  "_STEP_9_2_5_2_NAME_": "Zeigergesten-Eingaben können abgebrochen oder widerrufen werden",
  "_STEP_9_2_5_2_NAME_MENU_": "9.2.5.2 Zeigergesten-Eingaben können abgebrochen oder widerrufen werden",
  "_STEP_9_2_5_2_WHAT_CHECKED_1_": "<p>Funktionen von Bedienelementen sollen nicht bereits durch den Down-Event eines Zeigers (z. B. Mauszeiger, Trackpad-Zeiger, Finger oder Eingabestift) auf einem Bedienelement ausgeführt werden; falls doch, muss es eine Möglichkeit geben, die ausgelöste Funktion entweder abzubrechen oder rückgängig zu machen.</p>",
  "_STEP_9_2_5_2_WHAT_CHECKED_2_": "<p>Eine Ausnahme für diese Anforderung besteht, wenn das Auslösen der Funktion durch das Down-Ereignis essenziell ist (etwa beim Zeichnen mittels Maus, Eingabestift oder Finger auf einem Touchscreen oder Grafiktablett, oder beim Interagieren mit einer virtuellen Tastatur).</p>",
  "_STEP_9_2_5_2_WHY_CHECKED_1_": "<p>Menschen mit motorischen Beeinträchtigungen haben häufig Schwierigkeiten, Zeiger-Gesten auf Schnittstellen-Elementen zielgerichtet auszuführen. Die Ausführung beim Up-Event (etwa wenn die Maustaste losgelassen wird oder der Finger vom Touchscreen abgehoben wird) gibt diesen Menschen die Möglichkeit, Fehleingaben zu vermeiden, da es sie befähigt, vor Auslösen des Up-Events den Zeiger vom Interface-Element wegzubewegen. Wenn Down-Events bereits Funktionen auslösen, besteht diese Korrekturmöglichkeit nicht.</p>",
  "_STEP_9_2_5_2_WHY_CHECKED_2_": "<p>In Fällen, wo eine Zeiger-Eingabe mehrstufig ist, etwa bei Drag-and-Drop Aktionen, ist es wichtig, dass es einen Weg gibt, versehentlich ausgeführte Eingaben rückgängig zu machen. Dies kann auf verschiedene Weise geschehen, etwa über eine Schaltfläche zum Rückgängig-Machen der Aktion, einen Bestätigungsdialog, durch das Loslassen des Elements über dem Ausgangsort, oder durch das Loslassen des Elements über einem Ort, der nicht als Drop Target definiert ist und das Element zum Ausgangspunkt zurückspringen lässt.</p>",
  "_STEP_9_2_5_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_2_5_2_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn auf der Seite Bedienelemente vorhanden sind.</p>",
  "_STEP_9_2_5_2_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_2_5_2_HOW_CHECKED_4_": "<p>Es wird auf einem Smartphone überprüft, ob es Bedienelemente gibt, deren Funktionen durch Down-Events ausgelöst werden. Die Prüfung auf dem Desktop ist nicht ausreichend, weil hier Touch-Events wie <code>touchstart</code> ggf. nicht ausgewertet werden.</p>",
  "_STEP_9_2_5_2_HOW_CHECKED_5_": "<ol><li><p>Auf dem Smartphone Bedienelemente (Links, Schalter) berühren, den Finger kurz liegen lassen.</p></li><li><p>Beobachten, ob nun schon eine Funktion ausgeführt wird. Dies geschieht wahrscheinlich aufgrund eines Down-Events.</p></li><li><p>Wenn keine Funktion ausgelöst wird, Finger vom Punkt der Berührung wegbewegen   und loslassen. Dadurch wird in der Regel der Aufruf des Links oder der Funktion   vermieden, selbst wenn der berührte Punkt dem Finger folgt (die Seite   gescrollt wird).</p></li><li><p>Wenn Funktionen beim Down-Event ausgelöst werden, prüfen, ob die Funktion abgebrochen oder rückgängig gemacht werden kann oder beim Up-Event wieder rückgängig gemacht wird.</p></li></ol>",
  "_STEP_9_2_5_2_HOW_CHECKED_6_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_9_2_5_2_HOW_CHECKED_7_": "<p>Es ist in der Regel nicht notwendig, jedes einzelne Bedienelement aufzurufen, wenn eine stichprobenartige Prüfung zeigt, dass die Umsetzung gleichartig ist. Für ein Menü etwa reicht es dann, bei jeder Art von Menüeintrag (etwa Hauptmenü- und Untermenü-Einträge) ein Element zu testen. Das Gleiche gilt für Fließtextlinks.</p>",
  "_STEP_9_2_5_2_HOW_CHECKED_8_": "<p>Es kann bei der Prüfung zum Aufruf von Funktionen des Browsers kommen (etwa: ein Kontextmenü wird angezeigt). Dies ist nicht Teil der Prüfung und sollte ignoriert werden.</p>",
  "_STEP_9_2_5_2_HOW_CHECKED_9_": "<p>Als Zeiger-Down-Events gelten <code>mousedown</code>, <code>touchstart</code> und <code>pointerdown</code>.</p>",
  "_STEP_9_2_5_2_HOW_CHECKED_10_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_9_2_5_2_HOW_CHECKED_11_": "<h4 id=\"_prüfschritt_erfüllt\">Prüfschritt erfüllt</h4>",
  "_STEP_9_2_5_2_HOW_CHECKED_12_": "<ul><li><p>Keine Funktionen werden beim Down-Event ausgelöst.</p></li><li><p>Funktionen, die beim Down-Event ausgelöst werden, können abgebrochen, zurückgenommen oder beim Up-Event in den alten Zustand zurückversetzt werden.</p></li></ul>",
  "_STEP_9_2_5_2_SOURCES_1_": "<ul><li><p>Das Bookmarklet <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste/bookmarklets.html\"> Down-Events auslösen</a> von Prüfstelle T-Systems MMS kann ggf. zusätzlich eingesetzt werden, um der Reihe nach auf allen Elementen down-events auszulösen. Dabei muss die Seite genau beobachtet werden, ob sich etwas ändert bzw. geändert hat. Die Geschwindigkeit (Intervall in Millisekunden) kann am Beginn eingestellt werden.</p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/pointer-cancellation\"> Understanding Success Criterion 2.5.2: Pointer Cancellation</a> (zur Zeit nur auf Englisch verfügbar)</p></li><li><p>Spezifikation PointerEvents (<a href=\"https://www.w3.org/TR/pointerevents/\" class=\"bare\">https://www.w3.org/TR/pointerevents/</a>)</p></li><li><p>Spezifikation TouchEvents (<a href=\"https://www.w3.org/TR/touch-events/\" class=\"bare\">https://www.w3.org/TR/touch-events/</a>)</p></li><li><p>Spezifikation UIEvents (<a href=\"https://www.w3.org/TR/uievents/\" class=\"bare\">https://www.w3.org/TR/uievents/</a>)</p></li></ul>",
  "_STEP_9_2_5_2_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_2_5_2_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Guideline</h4>",
  "_STEP_9_2_5_2_CLASSIFICATION_3_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#input-modalities\"> Guideline 2.5 Input Modalities: Make it easier for users to operate functionality through various inputs beyond keyboard</a></p></li></ul>",
  "_STEP_9_2_5_2_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Success criterion</h4>",
  "_STEP_9_2_5_2_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#pointer-cancellation\"> 2.5.2 Pointer Cancellation</a> (Level A)</p></li></ul>",
  "_STEP_9_2_5_2_CLASSIFICATION_6_": "<h4 id=\"_sufficient_techniques\">Sufficient Techniques</h4>",
  "_STEP_9_2_5_2_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G210\"> G210: Ensuring that drag-and-drop actions can be cancelled</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G212\"> G212: Using native controls to ensure functionality is triggered on the up-event.</a></p></li></ul>",
  "_STEP_9_2_5_2_CLASSIFICATION_8_": "<h4 id=\"_failures\">Failures</h4>",
  "_STEP_9_2_5_2_CLASSIFICATION_9_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F101\"> F101: Failure of Success Criterion 2.5.2 due to activating a control on the down-event</a></p></li></ul>"
}
