{
  "_STEP_9_2_5_2_NAME_": "Ввод жестов указателя можно отменить или откатить",
  "_STEP_9_2_5_2_WHAT_CHECKED_1_": "<p>Функции элементов управления не должны активироваться событием нажатия указателя (например, курсора мыши, курсора тачпада, пальца или стилуса) на элементе управления; если это происходит, должна быть возможность отменить или откатить вызванную функцию.</p>",
  "_STEP_9_2_5_2_WHAT_CHECKED_2_": "<p>Исключение составляют случаи, когда активация функции событием нажатия является существенной (например, при рисовании с помощью мыши, стилуса или пальца на сенсорном экране или графическом планшете, или при взаимодействии с виртуальной клавиатурой).</p>",
  "_STEP_9_2_5_2_WHY_CHECKED_1_": "<p>Люди с моторными нарушениями часто испытывают трудности с точным выполнением жестов указателя на элементах интерфейса. Выполнение функции при событии отпускания (например, когда отпускается кнопка мыши или палец убирается с сенсорного экрана) дает этим людям возможность избежать ошибочных вводов, так как они могут перед выполнением события отпускания увести указатель от элемента интерфейса. Если функции вызываются уже при событии нажатия, такой возможности исправления нет.</p>",
  "_STEP_9_2_5_2_WHY_CHECKED_2_": "<p>В случаях, когда ввод указателя многоступенчатый, например, в действиях перетаскивания, важно, чтобы был способ отменить случайно выполненный ввод. Это может быть выполнено разными способами, например, через кнопку для отмены действия, диалоговое окно подтверждения, отпускание элемента над исходным местоположением, или отпускание элемента над местом, которое не определено как цель сброса, что возвращает элемент в исходное положение.</p>",
  "_STEP_9_2_5_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_9_2_5_2_HOW_CHECKED_2_": "<p>Этап проверки применим, если на странице присутствуют элементы управления.</p>",
  "_STEP_9_2_5_2_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_2_5_2_HOW_CHECKED_4_": "<p>На смартфоне проверяется, существуют ли элементы управления, функции которых активируются событиями нажатия. Проверка на настольном компьютере недостаточна, потому что события касания, такие как <code>touchstart</code>, могут не обрабатываться.</p>",
  "_STEP_9_2_5_2_HOW_CHECKED_5_": "<ol><li><p>На смартфоне коснуться элементов управления (ссылок, кнопок), подержать палец немного.</p></li><li><p>Наблюдать, активируется ли уже какая-либо функция. Это, вероятно, происходит из-за события нажатия.</p></li><li><p>Если функция не запускается, переместить палец с точки касания и отпустить. Обычно это предотвращает вызов ссылки или функции, даже если касаемая точка следует за пальцем (страница прокручивается).</p></li><li><p>Если функции активируются событием нажатия, проверить, можно ли отменить или откатить функцию или отменить ее при событии отпускания.</p></li></ol>",
  "_STEP_9_2_5_2_HOW_CHECKED_6_": "<h3 id=\"_3_hinweise\">3. Примечания</h3>",
  "_STEP_9_2_5_2_HOW_CHECKED_7_": "<p>Обычно не нужно вызывать каждый отдельный элемент управления, если выборочная проверка показывает, что реализация однородна. Например, для меню достаточно протестировать один элемент каждого типа пункта меню (например, пункты главного и подменю). То же самое относится к ссылкам в текствые блоки.</p>",
  "_STEP_9_2_5_2_HOW_CHECKED_8_": "<p>Во время проверки могут быть вызваны функции браузера (например, отображается контекстное меню). Это не является частью проверки и должно игнорироваться.</p>",
  "_STEP_9_2_5_2_HOW_CHECKED_9_": "<p>К событиям нажатия относятся <code>mousedown</code>, <code>touchstart</code> и <code>pointerdown</code>.</p>",
  "_STEP_9_2_5_2_HOW_CHECKED_10_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_2_5_2_HOW_CHECKED_11_": "<h4 id=\"_prüfschritt_erfüllt\">Этап проверки выполнен</h4>",
  "_STEP_9_2_5_2_HOW_CHECKED_12_": "<ul><li><p>Функции не активируются событием нажатия.</p></li><li><p>Функции, активируемые событием нажатия, могут быть отменены, откачены или возвращены в исходное состояние при событии отпускания.</p></li></ul>",
  "_STEP_9_2_5_2_SOURCES_1_": "<ul><li><p>Bookmarklet <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste/bookmarklets.html\">Активация событий нажатия</a> от проверочного центра T-Systems MMS может быть использован дополнительно для последовательной активации событий нажатия на всех элементах. При этом необходимо тщательно наблюдать за изменениями на странице. Скорость (интервал в миллисекундах) можно настроить в начале.</p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/pointer-cancellation\">Понимание критерия успеха 2.5.2: Отмена указателя</a> (в настоящее время доступно только на английском)</p></li><li><p>Спецификация PointerEvents (<a href=\"https://www.w3.org/TR/pointerevents/\" class=\"bare\">https://www.w3.org/TR/pointerevents/</a>)</p></li><li><p>Спецификация TouchEvents (<a href=\"https://www.w3.org/TR/touch-events/\" class=\"bare\">https://www.w3.org/TR/touch-events/</a>)</p></li><li><p>Спецификация UIEvents (<a href=\"https://www.w3.org/TR/uievents/\" class=\"bare\">https://www.w3.org/TR/uievents/</a>)</p></li></ul>",
  "_STEP_9_2_5_2_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация этапа проверки по WCAG 2.1</h3>",
  "_STEP_9_2_5_2_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Рекомендация</h4>",
  "_STEP_9_2_5_2_CLASSIFICATION_3_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#input-modalities\">Рекомендация 2.5 Ввод: Облегчение использования функциональности через различные входные данные помимо клавиатуры</a></p></li></ul>",
  "_STEP_9_2_5_2_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Критерий успеха</h4>",
  "_STEP_9_2_5_2_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#pointer-cancellation\">2.5.2 Отмена указателя</a> (Уровень A)</p></li></ul>",
  "_STEP_9_2_5_2_CLASSIFICATION_6_": "<h4 id=\"_sufficient_techniques\">Достаточные техники</h4>",
  "_STEP_9_2_5_2_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G210\">G210: Обеспечение возможности отмены действий перетаскивания</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G212\">G212: Использование нативных контролов для обеспечения активации функции на событии отпускания.</a></p></li></ul>",
  "_STEP_9_2_5_2_CLASSIFICATION_8_": "<h4 id=\"_failures\">Неудачи</h4>",
  "_STEP_9_2_5_2_CLASSIFICATION_9_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F101\">F101: Неудача критерия успеха 2.5.2 из-за активации управления на событии нажатия</a></p></li></ul>"
}