{
  "_STEP_9_1_3_4_NAME_": "Нет ограничений по ориентации экрана",
  "_STEP_9_1_3_4_NAME_MENU_": "9.1.3.4 Нет ограничений по ориентации экрана",
  "_STEP_9_1_3_4_WHAT_CHECKED_1_": "<p>Веб-контент должен адаптироваться к ориентации устройства, выбранной пользователем. Контент должен отображаться и быть доступным как в портретной, так и в ландшафтной ориентации, если только определенная ориентация контента не является необходимой.</p>",
  "_STEP_9_1_3_4_WHAT_CHECKED_2_": "<p>Примеры контента, для которого необходима определенная ориентация, включают банковский чек, онлайн-клавиатуру пианино, слайды презентации для проектора или экрана, или контент приложения виртуальной реальности, где нет двойной ориентации (то есть не только портретная или ландшафтная).</p>",
  "_STEP_9_1_3_4_WHAT_CHECKED_3_": "<p>Не требуется, чтобы контент и функциональность предлагались в одинаковой форме в обеих ориентациях. Таким образом, в другой ориентации контент может быть доступен только после активации скрытых разделов или через ссылки на другие страницы.</p>",
  "_STEP_9_1_3_4_WHY_CHECKED_1_": "<p>Для людей с ограниченными возможностями часто важно иметь возможность использовать устройство (например, смартфон) в определенной ориентации. Например, при значительном увеличении текста использование ландшафтной ориентации часто обеспечивает лучший опыт чтения, поскольку позволяет разместить больше слов в строке.</p>",
  "_STEP_9_1_3_4_WHY_CHECKED_2_": "<p>Кроме того, некоторые пользователи монтируют свои устройства в фиксированной ориентации (например, на руке электрического инвалидного кресла). Следовательно, веб-сайты и приложения не должны ограничивать отображение контента только одной ориентацией.</p>",
  "_STEP_9_1_3_4_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_9_1_3_4_HOW_CHECKED_2_": "<p>Проверка изменения ориентации экрана всегда должна быть применима, за исключением случаев, когда есть специальный контент, который работает только в одной ориентации.</p>",
  "_STEP_9_1_3_4_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_1_3_4_HOW_CHECKED_4_": "<ol><li><p>Использовать современное мобильное устройство (например, iPhone или Android-смартфон) для тестирования.</p></li><li><p>Убедиться, что ориентация на мобильном тестовом устройстве не зафиксирована на уровне оборудования или операционной системы.</p></li><li><p>Сначала загрузить тестируемый контент в браузере Chrome (Android) или Safari (iOS) в одной ориентации.</p></li><li><p>Проверить, отображается ли контент и доступен ли он.</p></li><li><p>Повернуть устройство на 90 градусов. Загрузить тестируемый контент в другой ориентации.</p></li><li><p>Проверить, отображается ли контент также в другой ориентации и доступен ли он. Возникают ли ограничения при смене ориентации, например, сообщения, призывающие использовать другую ориентацию?</p></li><li><p>Если поддерживается только одна ориентация и в другой ориентации контент не отображается, отображается повернутым на 90 градусов, или выдается сообщение о необходимости использовать другую ориентацию: проверить, необходима ли поддерживаемая ориентация для контента, и не может ли содержание быть плохо представлено в не поддерживаемой ориентации.</p></li></ol>",
  "_STEP_9_1_3_4_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Примечания</h3>",
  "_STEP_9_1_3_4_HOW_CHECKED_6_": "<p>Не требуется, чтобы изменение ориентации динамически адаптировало контент (хотя это желательно и обычно имеет место в адаптивных приложениях). Таким образом, контент может потребовать перезагрузки в каждой ориентации.</p>",
  "_STEP_9_1_3_4_HOW_CHECKED_7_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_1_3_4_HOW_CHECKED_8_": "<h4 id=\"_prüfschritt_erfüllt\">Этап проверки выполнен</h4>",
  "_STEP_9_1_3_4_HOW_CHECKED_9_": "<ul><li><p>Поддерживаются обе ориентации.</p></li><li><p>Если предложена только одна ориентация, она абсолютно необходима для контента.</p></li></ul>",
  "_STEP_9_1_3_4_SOURCES_1_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/orientation.html\"> Понимание критерия успеха 1.3.4: Ориентация</a> (на данный момент доступно только на английском)</p></li></ul>",
  "_STEP_9_1_3_4_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Отличие от других этапов проверки</h3>",
  "_STEP_9_1_3_4_CLASSIFICATION_2_": "<p>Этот этап проверки касается адаптации ориентации экрана, но не касается изменений в доступности контента или функциональности, вызванных сменой ориентации. Это предмет проверки шага 9.1.4.4 \"Текст увеличиваемый до 200%\" и 9.1.4.10 \"Содержимое переносится\".</p>",
  "_STEP_9_1_3_4_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация этапа проверки по WCAG 2.1</h3>",
  "_STEP_9_1_3_4_CLASSIFICATION_4_": "<h4 id=\"_guideline\">Руководство</h4>",
  "_STEP_9_1_3_4_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#adaptable\"> Руководство 1.3 Адаптируемость: Создание контента, который можно представить различными способами (например, более простой макет) без потери информации или структуры.</a></p></li></ul>",
  "_STEP_9_1_3_4_CLASSIFICATION_6_": "<h4 id=\"_success_criterion\">Критерий успеха</h4>",
  "_STEP_9_1_3_4_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#orientation\"> 1.3.4 Ориентация</a> (Уровень AA)</p></li></ul>",
  "_STEP_9_1_3_4_CLASSIFICATION_8_": "<h4 id=\"_sufficient_techniques\">Достаточные методики</h4>",
  "_STEP_9_1_3_4_CLASSIFICATION_9_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G214\"> G214: Использование элемента управления для доступа к контенту в различных ориентациях, которые иначе ограничены</a></p></li></ul>",
  "_STEP_9_1_3_4_CLASSIFICATION_10_": "<h4 id=\"_failures\">Неудачи</h4>",
  "_STEP_9_1_3_4_CLASSIFICATION_11_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F97.html\"> F97: Неудача из-за блокировки ориентации в альбомный или портретный вид</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F100\"> F100: Неудача критерия успеха 1.3.4 из-за показа сообщения с просьбой изменить ориентацию устройства</a></p></li></ul>"
}