{
  "_STEP_6_2_1_2_NAME_": "Одновременная речь и текст",
  "_STEP_6_2_1_2_NAME_MENU_": "6.2.1.2 Одновременная речь и текст",
  "_STEP_6_2_1_2_WHAT_CHECKED_1_": "<p>Если веб-приложение предлагает двустороннюю коммуникацию и текстовую коммуникацию в реальном времени (RTT, Real-Time Text), оно также должно обеспечивать возможность одновременной коммуникации с использованием речи и текста в реальном времени.</p>",
  "_STEP_6_2_1_2_WHY_CHECKED_1_": "<p>Люди, которые предпочитают использовать ввод текста в реальном времени вместо речи, должны быть равноправны. Функции, такие как становление в очередь на вклад через цифровой жест 'поднятия руки', должны быть доступны пользователям всех типов одинаково.</p>",
  "_STEP_6_2_1_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_6_2_1_2_HOW_CHECKED_2_": "<p>Этап проверки применим, если веб-приложение позволяет двустороннюю коммуникацию и дополнительно текстовую коммуникацию в реальном времени. Двусторонняя коммуникация включает, например, голосовую и видеотелефонию. Реальное время здесь означает, что уже ввод каждого символа передается и пользователю не нужно отправлять введенный текст активно.</p>",
  "_STEP_6_2_1_2_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_6_2_1_2_HOW_CHECKED_4_": "<ol><li><p>Открыть веб-приложение.</p></li><li><p>Проверить, возможна ли равноправная коммуникация с помощью текста в реальном времени и речи, и доступны ли функции, такие как цифровое 'поднятие руки', как пользователям голосовой связи, так и пользователям текста в реальном времени. Если есть очередь на вклады, пользователи голоса и текста должны оказаться в одной очереди.</p></li></ol>",
  "_STEP_6_2_1_2_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Примечания</h3>",
  "_STEP_6_2_1_2_HOW_CHECKED_6_": "<ul><li><p>При текстовой коммуникации в реальном времени (RTT, Real-Time Text) текст появляется у получателя динамично уже во время ввода отправителем. RTT не то же самое, что, например, чат, где сообщения явно отправляются и появляются у получателя только после отправки.</p></li><li><p>В конференциях, то есть в коммуникации с участием более двух лиц, текстовая коммуникация в реальном времени должна быть равноправна голосовой коммуникации. Это означает, например, что если программное обеспечение предлагает функции поочередной коммуникации (например, только один активный оратор), эти функции также должны быть доступны для текстовой коммуникации в реальном времени.</p></li><li><p>На конференциях, где также предлагается обычная функция чата, чат и текстовая коммуникация в реальном времени должны быть разделены, например, в отдельных окнах программы, чтобы эти разные виды коммуникации не мешали друг другу и не вызывали путаницы.</p></li></ul>",
  "_STEP_6_2_1_2_SOURCES_1_": "<ul><li><p><a href=\"https://labs.etsi.org/rep/HF/en301549/uploads/272bede3724c5c99efe777f778201f70/tr_103708v010101p.pdf\">Human Factors (HF); Real-Time Text (RTT) in Multiparty Conference Calling / ETSI TR 103 708 V1.1.1 (2022-08)</a></p></li></ul>",
  "_STEP_6_2_1_2_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_6_2_1_2_CLASSIFICATION_2_": "<h4 id=\"_6_2_1_2_concurrent_voice_and_text\">6.2.1.2 Одновременная речь и текст</h4>",
  "_STEP_6_2_1_2_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where ICT provides a means for two-way voice communication and for users to communicate by RTT, it shall allow concurrent voice and text through a single user connection.</p><p>NOTE 1: With many-party communication, as in a conference system, it is allowed (but not required or necessarily recommended) that RTT be handled in a single display field and that \"turn-taking\" be necessary to avoid confusion (in the same way that turn-taking is required for those presenting/talking with voice).</p><p>NOTE 2: With many-party communication, best practice is for hand-raising for voice users and RTT users to be handled in the same way, so that voice and RTT users are in the same queue.</p><p>NOTE 3: With a many-party conference system that has chat as one of its features - the RTT (like the voice) would typically be separate from the chat so that RTT use does not interfere with chat (i.e. people can be messaging in the chat field while the person is presenting/talking with RTT - in the same manner that people message using the chat feature while people are talking with voice). RTT users would then use RTT for presenting and use the Chat feature to message while others are presenting (via Voice or RTT).</p><p>NOTE 4: The availability of voice and RTT running concurrently (and separately from chat) can also allow the RTT field to support text captioning when someone is speaking (and it is therefore not being used for RTT since it is not the RTT user’s turn to speak).</p><p>NOTE 5: Where both server-side software and local hardware and software are required to provide voice communication, where neither part can support voice communication without the other and are sold as a unit for the voice communication function, the local and server-side components are considered a single product.</p></div></div>"
}