{
  "_STEP_9_1_4_13_NAME_": "Eingeblendete Inhalte bedienbar",
  "_STEP_9_1_4_13_WHAT_CHECKED_1_": "<p>Zusätzliche Inhalte, die angezeigt werden, wenn Elemente den Zeiger- oder Tastaturfokus erhalten, z. B. benutzerdefinierte Tooltips oder Ausklapp-Menüs, sollten drei Anforderungen erfüllen:</p>",
  "_STEP_9_1_4_13_WHAT_CHECKED_2_": "<ul><li><p>Wenn zusätzliche Inhalte durch Darüberfahren mit dem Zeiger erscheinen, können Benutzer den Zeiger über diesen Inhalt bewegen, ohne dass er verschwindet.</p></li><li><p>Es gibt die Möglichkeit, einen eingeblendeten Inhalt zu schließen, ohne den Fokus zu verschieben (z. B. durch Drücken der Escape-Taste oder durch Aktivieren des Elements, dessen Fokussierung den Inhalt einblendet).</p></li><li><p>Der Inhalt schließt nicht selbsttätig nach einer gewissen Zeitspanne.</p></li></ul>",
  "_STEP_9_1_4_13_WHAT_CHECKED_3_": "<p>Hinweis: Die Anforderung gilt nicht für eingeblendete Inhalte, deren Verhalten durch den Nutzer-Agenten bestimmt wird (etwa native <code>title</code>-Attribute).</p>",
  "_STEP_9_1_4_13_WHY_CHECKED_1_": "<p>Für sehbehinderte Nutzer, die mit starker Zoomvergrößerung arbeiten, sind zusätzliche Inhalte, die bei Zeiger- oder Tastatur-Fokussierung eingeblendet werden, aus mehreren Gründen problematisch:</p>",
  "_STEP_9_1_4_13_WHY_CHECKED_2_": "<ul><li><p>Inhalte sind wegen des starken Zoomfaktors oft nur teilweise sichtbar. Nutzer müssen in der Lage sein, den Zeiger von dem auslösenden Element über   den eingeblendeten Inhalt zu bewegen (was meist den sichtbaren Ausschnitt   verschiebt), ohne dass der eingeblendete Inhalt schließt.</p></li><li><p>Eingeblendete Inhalte verdecken häufig andere Inhalte. Nutzer müssen in der Lage sein, den eingeblendeten Inhalt wieder zu schließen, ohne den Fokus zu bewegen (was passieren würde, wenn etwa nach einem Schließen-Element gesucht werden müsste). Die Escape-Taste oder ein Aktivieren des auslösenden Elements, das zur Zeit den Fokus hat, sollte den eingeblendeten Inhalt schließen.</p></li><li><p>Sehbehinderte Nutzer brauchen ggf. mehr Zeit, Inhalte zu lesen. Eingeblendete Inhalte sollten deshalb solange zur Verfügung stehen, bis sie vom Nutzer geschlossen werden (etwa über Weiter-Tabben, Wegbewegen des Zeigers von auslösenden Element und eingeblendetem Inhalt, oder explizites Schließen über die Tastatur).</p></li></ul>",
  "_STEP_9_1_4_13_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_1_4_13_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn die Seite zusätzliche Inhalte enthält, die bei Fokussierung mittels Tastatur oder Zeiger eingeblendet werden, etwa Custom-Tooltips oder Ausklapp-Menüs, die bereits bei Fokussierung ausklappen.</p>",
  "_STEP_9_1_4_13_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_1_4_13_HOW_CHECKED_4_": "<h4 id=\"_2_1_zeiger_hover_prüfung\">2.1 Zeiger-Hover-Prüfung</h4>",
  "_STEP_9_1_4_13_HOW_CHECKED_5_": "<p>Wenn sich zusätzliche Inhalte sich durch Hinüberbewegen des Zeigers (z. B. Maus-Hover) über ein Element einblenden lassen:</p>",
  "_STEP_9_1_4_13_HOW_CHECKED_6_": "<ol><li><p>Inhalt durch Hover über dem Element einblenden Abwarten, ob der eingeblendete Inhalt sichtbar bleibt, also nicht nach kurzer Zeit selbsttätig schließt. Ausgenommen sind Fälle, bei denen der eingeblendete Inhalt nicht länger gültig ist.</p></li><li><p>Prüfen, ob sich der eingeblendete Inhalt durch die Escape-Taste oder ein Aktivieren des Einblendung auslösenden Elements (Klicken, Tippen) schließen lässt. Ausgenommen sind hier Fälle, bei denen der eingeblendete Inhalt eine Fehlermeldung ist oder keine anderen Inhalte verdeckt oder ersetzt.</p></li><li><p>Inhalt erneut über Hover einblenden und den Zeiger über den neu eingeblendeten Inhalt bewegen. Der Inhalt sollte weiter sichtbar sein.</p></li></ol>",
  "_STEP_9_1_4_13_HOW_CHECKED_7_": "<h4 id=\"_2_2_tastaturfokus_prüfung\">2.2 Tastaturfokus-Prüfung</h4>",
  "_STEP_9_1_4_13_HOW_CHECKED_8_": "<p>Wenn sich zusätzliche Inhalte durch die Tastaturfokussierung von Elementen einblenden lassen:</p>",
  "_STEP_9_1_4_13_HOW_CHECKED_9_": "<ol><li><p>Inhalt durch Tastaturfokussierung des Elements einblenden.</p></li><li><p>Prüfen, ob der eingeblendete Inhalt sichtbar bleibt, also nicht nach kurzer Zeit selbsttätig schließt. Ausgenommen sind Fällebei denen der eingeblendete Inhalt nicht länger gültig ist.</p></li><li><p>Prüfen, ob sich der eingeblendete Inhalt über die Escape-Taste oder ein Aktivieren des Einblendung auslösenden Elements (Enter) schließen lässt. Ausgenommen sind hier Fälle, bei denen der eingeblendete Inhalt eine Fehlermeldung ist oder keine anderen Inhalte verdeckt oder ersetzt.</p></li></ol>",
  "_STEP_9_1_4_13_HOW_CHECKED_10_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_9_1_4_13_HOW_CHECKED_11_": "<p>Bei Inhalten, die durch Tastaturfokussierung von Elementen eingeblendet werden, wird nicht verlangt, dass hier Mauszeiger über die eingeblendeten Inhalte bewegt werden kann, ohne dass diese sich schließen.</p>",
  "_STEP_9_1_4_13_HOW_CHECKED_12_": "<p>Wenn Aktivierung des Elements, dass den Inhalt einblendet, zum Schließen des eingeblendeten Inhalts benutzt wird, soll der Nutzer-Kontext bestehen bleiben (also nicht eine weitere Aktion, die den Kontext ändert, ausgelöst werden, etwa das Aktivieren eines Links).</p>",
  "_STEP_9_1_4_13_HOW_CHECKED_13_": "<p>Wenn Inhalte durch Hover eingeblendet werden, sollten sie in der Regel auch bei Tastaturfokus eingeblendet werden, falls sie nicht alternativ zur Verfügung gestellt werden. Dies wird in Prüfschritt 9.2.1.1 \"Ohne Maus nutzbar\" geprüft.</p>",
  "_STEP_9_1_4_13_SOURCES_1_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/content-on-hover-or-focus\"> Understanding Success Criterion 1.4.13: Content on Hover or Focus</a> (zur Zeit nur auf Englisch verfügbar)</p></li></ul>",
  "_STEP_9_1_4_13_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_1_4_13_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Guideline</h4>",
  "_STEP_9_1_4_13_CLASSIFICATION_3_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#distinguishable\"> Guideline 1.4 Distinguishable: Make it easier for users to see and hear content including separating foreground from background</a></p></li></ul>",
  "_STEP_9_1_4_13_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Success criterion</h4>",
  "_STEP_9_1_4_13_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#content-on-hover-or-focus\"> 1.4.13 Content on Hover or Focus</a> (Level AA)</p></li></ul>",
  "_STEP_9_1_4_13_CLASSIFICATION_6_": "<h4 id=\"_sufficient_techniques\">Sufficient Techniques</h4>",
  "_STEP_9_1_4_13_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/client-side-script/SCR39\"> SCR39: Making content on focus or hover hoverable, dismissible, and persistent</a></p></li></ul>",
  "_STEP_9_1_4_13_CLASSIFICATION_8_": "<h4 id=\"_failures\">Failures</h4>",
  "_STEP_9_1_4_13_CLASSIFICATION_9_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F95\"> F95: Failure of Success Criterion 1.4.13 due to content shown on hover not being hoverable</a></p></li></ul>"
}
