{
  "_STEP_9_1_4_13_NAME_": "Всплывающие элементы управляемы",
  "_STEP_9_1_4_13_NAME_MENU_": "9.1.4.13 Всплывающие элементы управляемы",
  "_STEP_9_1_4_13_WHAT_CHECKED_1_": "<p>Дополнительное содержимое, которое отображается при получении элементами фокуса указателя или клавиатуры, например, пользовательские всплывающие подсказки или выпадающие меню, должно соответствовать трем требованиям:</p>",
  "_STEP_9_1_4_13_WHAT_CHECKED_2_": "<ul><li><p>Если дополнительное содержимое появляется при наведении курсора, пользователи могут перемещать курсор по этому содержимому без его исчезновения.</p></li><li><p>Существует возможность закрыть всплывающее содержимое без перемещения фокуса (например, нажатием клавиши Escape или активацией элемента, вызывающего фокусировку).</p></li><li><p>Содержимое не закрывается автоматически после определенного времени.</p></li></ul>",
  "_STEP_9_1_4_13_WHAT_CHECKED_3_": "<p>Примечание: Требование не относится к всплывающему содержимому, поведение которого определяется агентом пользователя (например, к атрибутам title).</p>",
  "_STEP_9_1_4_13_WHY_CHECKED_1_": "<p>Для пользователей с нарушениями зрения, которые работают с сильным увеличением, всплывающее содержимое, появляющееся при фокусировке указателем или клавиатурой, может быть проблематичным по нескольким причинам:</p>",
  "_STEP_9_1_4_13_WHY_CHECKED_2_": "<ul><li><p>Содержимое часто видно только частично из-за сильного масштабирования. Пользователи должны иметь возможность перемещать указатель с активного элемента на всплывающее содержимое (что обычно сдвигает видимый фрагмент), без того чтобы содержимое исчезло.</p></li><li><p>Всплывающее содержимое часто перекрывает другие элементы. Пользователи должны иметь возможность закрыть всплывающее содержимое без перемещения фокуса (что произошло бы, если бы потребовалось искать элемент для закрытия). Клавиша Escape или активация элемента, который в данный момент находится в фокусе, должна закрывать всплывающее содержимое.</p></li><li><p>Пользователям с нарушениями зрения может потребоваться больше времени для чтения содержимого. Поэтому всплывающее содержимое должно оставаться доступным до тех пор, пока пользователь не закроет его (например, перейдя дальше, убрав указатель с активного элемента и всплывающего содержимого, или явно закрыв его с помощью клавиатуры).</p></li></ul>",
  "_STEP_9_1_4_13_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость проверки</h3>",
  "_STEP_9_1_4_13_HOW_CHECKED_2_": "<p>Этап проверки применим, если на странице есть дополнительное содержимое, которое отображается при фокусировке элементов с помощью клавиатуры или указателя, например, пользовательские всплывающие подсказки или выпадающие меню, которые раскрываются уже при фокусировке.</p>",
  "_STEP_9_1_4_13_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_1_4_13_HOW_CHECKED_4_": "<h4 id=\"_2_1_zeiger_hover_prüfung\">2.1 Проверка наведения указателя</h4>",
  "_STEP_9_1_4_13_HOW_CHECKED_5_": "<p>Если дополнительное содержимое отображается при наведении указателя (например, при наведении мыши) на элемент:</p>",
  "_STEP_9_1_4_13_HOW_CHECKED_6_": "<ol><li><p>Отобразить содержимое, наведя указатель на элемент, и подождать, остается ли всплывающее содержимое видимым, т.е. не закрывается ли оно автоматически через короткое время. Исключения составляют случаи, когда всплывающее содержимое больше не актуально.</p></li><li><p>Проверить, можно ли закрыть всплывающее содержимое с помощью клавиши Escape или активацией элемента, вызывающего его появление (нажатием, касанием). Исключения составляют случаи, когда всплывающее содержимое представляет собой сообщение об ошибке или не перекрывает или не заменяет другие содержимое.</p></li><li><p>Снова отобразить содержимое через наведение и переместить указатель на вновь появившееся содержимое. Содержимое должно оставаться видимым.</p></li></ol>",
  "_STEP_9_1_4_13_HOW_CHECKED_7_": "<h4 id=\"_2_2_tastaturfokus_prüfung\">2.2 Проверка фокуса клавиатуры</h4>",
  "_STEP_9_1_4_13_HOW_CHECKED_8_": "<p>Если дополнительное содержимое отображается при фокусировке элементов с помощью клавиатуры:</p>",
  "_STEP_9_1_4_13_HOW_CHECKED_9_": "<ol><li><p>Отобразить содержимое, фокусируя элемент с клавиатуры.</p></li><li><p>Проверить, остается ли всплывающее содержимое видимым, т.е. не закрывается ли оно автоматически через короткое время. Исключения составляют случаи, когда всплывающее содержимое больше не актуально.</p></li><li><p>Проверить, можно ли закрыть всплывающее содержимое с помощью клавиши Escape или активацией элемента, вызывающего его появление (клавиша Enter). Исключения составляют случаи, когда всплывающее содержимое представляет собой сообщение об ошибке или не перекрывает или не заменяет другие содержимое.</p></li></ol>",
  "_STEP_9_1_4_13_HOW_CHECKED_10_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_9_1_4_13_HOW_CHECKED_11_": "<p>Не требуется, чтобы содержимое, отображаемое при фокусировке элементов клавиатурой, можно было перемещать указатель мыши без его закрытия.</p>",
  "_STEP_9_1_4_13_HOW_CHECKED_12_": "<p>Если активация элемента, вызывающего отображение содержимого, используется для его закрытия, контекст пользователя должен оставаться неизменным (т.е. не должно быть запущено дополнительное действие, изменяющее контекст, например, активация ссылки).</p>",
  "_STEP_9_1_4_13_HOW_CHECKED_13_": "<p>Если содержимое отображается при наведении, оно обычно должно отображаться и при фокусе клавиатуры, если только оно не предоставляется альтернативно. Это проверяется на этапе 9.2.1.1 \"Использование без мыши\".</p>",
  "_STEP_9_1_4_13_SOURCES_1_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/content-on-hover-or-focus\"> Понимание критерия успеха 1.4.13: Содержимое при наведении или фокусе</a> (на данный момент доступно только на английском)</p></li></ul>",
  "_STEP_9_1_4_13_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация этапа проверки по WCAG 2.1</h3>",
  "_STEP_9_1_4_13_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Руководство</h4>",
  "_STEP_9_1_4_13_CLASSIFICATION_3_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#distinguishable\"> Руководство 1.4 Отличимость: Упрощение восприятия и слушания содержимого, включая разделение переднего и заднего плана</a></p></li></ul>",
  "_STEP_9_1_4_13_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Критерий успеха</h4>",
  "_STEP_9_1_4_13_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#content-on-hover-or-focus\"> 1.4.13 Содержимое при наведении или фокусе</a> (Уровень AA)</p></li></ul>",
  "_STEP_9_1_4_13_CLASSIFICATION_6_": "<h4 id=\"_sufficient_techniques\">Достаточные техники</h4>",
  "_STEP_9_1_4_13_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/client-side-script/SCR39\"> SCR39: Создание содержимого, которое можно наводить, закрывать и которое является постоянным</a></p></li></ul>",
  "_STEP_9_1_4_13_CLASSIFICATION_8_": "<h4 id=\"_failures\">Недостатки</h4>",
  "_STEP_9_1_4_13_CLASSIFICATION_9_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F95\"> F95: Нарушение критерия успеха 1.4.13 из-за того, что содержимое, показанное при наведении, нельзя навести</a></p></li></ul>"
}