{
  "_STEP_9_1_3_1A_NAME_": "HTML-структурные элементы для заголовков",
  "_STEP_9_1_3_1A_NAME_MENU_": "9.1.3.1a HTML-структурные элементы для заголовков",
  "_STEP_9_1_3_1A_WHAT_CHECKED_1_": "<p>Заголовки должны быть корректно обозначены с помощью HTML-структурных элементов <code>h1</code> до <code>h6</code> или эквивалентных ARIA-ролей и атрибутов, и должны раскрывать содержание страницы.</p>",
  "_STEP_9_1_3_1A_WHY_CHECKED_1_": "<p>Визуально контент на веб-страницах структурирован с помощью заголовков. Благодаря этой структуризации пользователи знают, что связано друг с другом, могут легко ориентироваться в содержании веб-страницы и целенаправленно доступать интересующие их содержания.</p>",
  "_STEP_9_1_3_1A_WHY_CHECKED_2_": "<p>Пользователи, которые не могут использовать эту визуальную организацию, например, из-за слепоты или потому что видят только маленькую часть страницы, зависят от того, чтобы структура была доступна независимо от отображения на экране. Использование элементов заголовков является для этого основным условием.</p>",
  "_STEP_9_1_3_1A_WHY_CHECKED_3_": "<p>Так пользователи могут использовать элементы заголовков:</p>",
  "_STEP_9_1_3_1A_WHY_CHECKED_4_": "<ul><li><p>Показать только заголовки – как оглавление для быстрой ориентации (особенно важно для слепых пользователей)</p></li><li><p>Переходить от заголовка к заголовку (для слепых пользователей)</p></li><li><p>Выделять заголовки иначе, если выделение, предусмотренное авторами веб-страниц, не подходит (например, другой цвет или голос)</p></li></ul>",
  "_STEP_9_1_3_1A_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_9_1_3_1A_HOW_CHECKED_2_": "<p>Этап проверки применим, если на странице есть контент, который можно структурировать с помощью заголовков. Обычно это так для информационно ориентированных страниц.</p>",
  "_STEP_9_1_3_1A_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_1_3_1A_HOW_CHECKED_4_": "<ol><li><p>Загрузить страницу в <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\">Firefox</a>.</p></li><li><p>Использовать <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#webdeveloper\">Web Developer Toolbar</a> для отображения страницы без стилей (<em>CSS &gt; Отключить все стили</em>), затем вызвать <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#gegliedert\">Bookmarklet \"Структурированные содержания\"</a>. В качестве альтернативы использовать <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#headingsmap\">плагин браузера HeadingsMap</a> для отображения иерархии заголовков.</p></li><li><p>Проверить, обозначены ли содержания, которые визуально распознаются как заголовки, с помощью HTML-структурных элементов <code>h1</code> до <code>h6</code></p></li><li><p>Если нативная разметка заголовков не используется, проверить, обозначены ли визуальные заголовки альтернативно с помощью <code>role=\"heading\"</code> и соответствующих <code>aria-level</code> атрибутов для определения уровня заголовков. Иерархия используемых HTML-элементов заголовков должна соответствовать структуре содержания.</p></li><li><p>Проверить, используются ли HTML-структурные элементы <code>h1</code> до <code>h6</code> исключительно для создания различных размеров шрифтов.</p></li></ol>",
  "_STEP_9_1_3_1A_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_9_1_3_1A_HOW_CHECKED_6_": "<ul><li><p>Этот этап проверки не предназначен для оценки, соответствуют ли выбор слов или стиль заголовков содержанию.</p></li><li><p>Заголовки должны быть правильно вложены (<code>h1</code> за которым следует <code>h2</code>, затем <code>h3</code> и так далее, или соответствующие <code>aria-level</code> атрибуты на элементах с <code>role=\"heading\"</code>), чтобы отражать структуру текстового содержания. Пропуск уровней иерархии сам по себе не является ошибкой, пока логическая последовательность заголовков остается логичной.</p></li><li><p>Первое правило использования WAI-ARIA рекомендует использовать нативные HTML-элементы, если это возможно. Смотрите <a href=\"https://www.w3.org/TR/using-aria/\">Использование ARIA, Первое правило использования ARIA</a>. Если это невозможно, семантику можно предоставить с помощью <code>role=\"heading\"</code> и атрибута <code>aria-level</code>.</p></li><li><p>Содержимое iframe проверяется так же, как и другие страницы. Для этого может потребоваться загрузить iframe в новом окне.</p></li></ul>",
  "_STEP_9_1_3_1A_HOW_CHECKED_7_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_1_3_1A_HOW_CHECKED_8_": "<h4 id=\"_erfüllt\">Выполнено</h4>",
  "_STEP_9_1_3_1A_HOW_CHECKED_9_": "<ul><li><p>Визуальные заголовки на странице обозначены с помощью семантической разметки (HTML-структурные элементы или ARIA-роли и атрибуты) и правильно вложены, таким образом они также доступны невизуально.</p></li></ul>",
  "_STEP_9_1_3_1A_HOW_CHECKED_10_": "<h4 id=\"_teilweise_erfüllt\">Частично выполнено</h4>",
  "_STEP_9_1_3_1A_HOW_CHECKED_11_": "<ul><li><p>Используется семантическая разметка для заголовков, но вложение уровней иерархии вводит в заблуждение, не соответствует структуре содержания.</p></li></ul>",
  "_STEP_9_1_3_1A_HOW_CHECKED_12_": "<h4 id=\"_nicht_erfüllt\">Не выполнено</h4>",
  "_STEP_9_1_3_1A_HOW_CHECKED_13_": "<ul><li><p>На странице есть структурированные содержания, для обозначения заголовков не используется семантическая разметка.</p></li><li><p>На странице есть чётко разграниченные содержания с видимыми заголовками, но обозначен только формально один главный заголовок.</p></li></ul>",
  "_STEP_9_1_3_1A_SOURCES_1_": "<h3 id=\"_überschriften_zur_abbildung_der_struktur_verwenden\">Использование заголовков для отображения структуры</h3>",
  "_STEP_9_1_3_1A_SOURCES_2_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>Long documents are often divided into a variety of chapters, chapters have subtopics and subtopics are divided into various sections, sections into paragraphs, etc. These semantic chunks of information make up the structure of the document.</p><p>Sections should be introduced with the HTML heading elements (H1-H6)Other markup may complement these elements to improve presentation (e.g., the <a href=\"http://www.w3.org/TR/WCAG10-HTML-TECHS/#edef-HR\"> HR</a> element to create a horizontal dividing line), but visual presentation is not sufficient to identify document sections.</p></blockquote></div>",
  "_STEP_9_1_3_1A_SOURCES_3_": "<p>(<a href=\"http://www.w3.org/TR/WCAG10-HTML-TECHS/#document-headers\" class=\"bare\">http://www.w3.org/TR/WCAG10-HTML-TECHS/#document-headers</a>)</p>",
  "_STEP_9_1_3_1A_SOURCES_4_": "<h3 id=\"_überschriften_richtig_schachteln\">Правильно вложенные заголовки</h3>",
  "_STEP_9_1_3_1A_SOURCES_5_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>To facilitate navigation and understanding of overall document structure, authors should use headings that are properly nested (e.g., <code>h1</code> followed by <code>h2</code>, <code>h2</code> followed by <code>h2</code> or <code>h3</code>, <code>h3</code> followed by <code>h3</code> or <code>h4</code>, etc.)..</p></blockquote></div>",
  "_STEP_9_1_3_1A_SOURCES_6_": "<p>(Техника WCAG 2.0 <a href=\"http://www.w3.org/TR/WCAG20-TECHS/G141.html\"> G141: Организация страницы с использованием заголовков</a>)</p>",
  "_STEP_9_1_3_1A_SOURCES_7_": "<h3 id=\"_überschriften_elemente_und_css_auszeichnungen_nicht_missbrauchen\">Не злоупотреблять элементами заголовков и CSS-разметками</h3>",
  "_STEP_9_1_3_1A_SOURCES_8_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>Using headings merely to change the appearance of text does not convey the organization of the content, and may confuse users who use headings to perceive structure or rely on them for navigation. Conversely, while applying bold format, or even <code>class=\"heading\"</code>, can result in the visual display of a heading, assistive technologies will not recognize such text as headings.</p></blockquote></div>",
  "_STEP_9_1_3_1A_SOURCES_9_": "<p>(Техника WCAG 2.0 <a href=\"http://www.w3.org/TR/WCAG20-TECHS/H42.html\"> H42: Использование <code>h1-h6</code> для обозначения заголовков</a>)</p>",
  "_STEP_9_1_3_1A_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Разграничение с другими этапами проверки</h3>",
  "_STEP_9_1_3_1A_CLASSIFICATION_2_": "<p>На этом этапе проверяется использование заголовков для структурирования <strong>содержимого</strong> страницы, чтобы оно было легко усваиваемо и можно было легко переходить по нему с помощью таких средств, как скринридеры.</p>",
  "_STEP_9_1_3_1A_CLASSIFICATION_3_": "<p>На этапе проверки 9.2.4.1 \"Переходы между разделами\" рассматривается структурирование <strong>разделов</strong> страницы с помощью заголовков, атрибутов WAI-Aria или ссылок для пропуска.</p>",
  "_STEP_9_1_3_1A_CLASSIFICATION_4_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация этапа проверки по WCAG 2.1</h3>",
  "_STEP_9_1_3_1A_CLASSIFICATION_5_": "<h4 id=\"_guidelines\">Руководства</h4>",
  "_STEP_9_1_3_1A_CLASSIFICATION_6_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#adaptable\">Руководство 1.3 Адаптивность: Создавайте контент, который можно представить разными способами (например, в более простом макете) без потери информации или структуры</a></p></li></ul>",
  "_STEP_9_1_3_1A_CLASSIFICATION_7_": "<h4 id=\"_success_criterion\">Критерии успеха</h4>",
  "_STEP_9_1_3_1A_CLASSIFICATION_8_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#info-and-relationships\">1.3.1 Информация и отношения</a> (Уровень A)</p></li></ul>",
  "_STEP_9_1_3_1A_CLASSIFICATION_9_": "<h4 id=\"_techniques\">Техники</h4>",
  "_STEP_9_1_3_1A_CLASSIFICATION_10_": "<h5 id=\"_general_techniques\">Общие техники</h5>",
  "_STEP_9_1_3_1A_CLASSIFICATION_11_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G115.html\">G115: Использование семантических элементов для обозначения структуры</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G140.html\">G140: Разделение информации и структуры от презентации для обеспечения различных презентаций</a></p></li></ul>",
  "_STEP_9_1_3_1A_CLASSIFICATION_12_": "<h5 id=\"_html_techniques\">HTML техники</h5>",
  "_STEP_9_1_3_1A_CLASSIFICATION_13_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H42.html\">H42: Использование h1-h6 для идентификации заголовков</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H69.html\">H69: Предоставление элементов заголовков в начале каждого раздела контента</a></p></li></ul>",
  "_STEP_9_1_3_1A_CLASSIFICATION_14_": "<h5 id=\"_aria_techniques\">Техники ARIA</h5>",
  "_STEP_9_1_3_1A_CLASSIFICATION_15_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA12.html\">ARIA12: Использование role=heading для идентификации заголовков</a></p></li></ul>",
  "_STEP_9_1_3_1A_CLASSIFICATION_16_": "<h5 id=\"_failures\">Неудачи</h5>",
  "_STEP_9_1_3_1A_CLASSIFICATION_17_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F43.html\"> F43: Неудача критерия успеха 1.3.1 из-за использования структурной разметки таким образом, что она не представляет отношения в контенте</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F92.html\"> F92: Неудача критерия успеха 1.3.1 из-за использования роли presentation на контенте, который передает семантическую информацию</a></p></li></ul>",
  "_STEP_9_1_3_1A_QUESTIONS_1_": "<h3 id=\"_kann_es_mehrere_h1_überschriften_auf_einer_seite_geben\">Может ли на одной странице быть несколько заголовков <code>h1</code>?</h3>",
  "_STEP_9_1_3_1A_QUESTIONS_2_": "<p>Главный заголовок, обозначенный <code>h1</code>, должен говорить, о чем идет речь на странице. Если все содержимое страницы относится к одной общей теме, то должен быть только один заголовок <code>h1</code>.</p>",
  "_STEP_9_1_3_1A_QUESTIONS_3_": "<p>Может быть, на странице также есть две темы, которые не имеют много общего. Если в таком случае есть только один главный заголовок, он либо невыразителен, либо просто перечисляет обе темы. Его полезность сомнительна, поэтому может быть разумным обозначить несколько заголовков на одной странице как <code>h1</code>.</p>",
  "_STEP_9_1_3_1A_QUESTIONS_4_": "<h3 id=\"_warum_sind_die_anforderungen_des_prüfschritts_so_allgemein_gehalten\">Почему требования этапа проверки так обобщены?</h3>",
  "_STEP_9_1_3_1A_QUESTIONS_5_": "<p>Ведь есть четкие формальные требования для правильной структуризации с помощью заголовков!</p>",
  "_STEP_9_1_3_1A_QUESTIONS_6_": "<p>Формальные правила для структуризации с помощью заголовков полезны и могут быть полезными. Часто их проверка дает подсказки о неправильном или злоупотреблении использовании заголовков или других структурных элементов.</p>",
  "_STEP_9_1_3_1A_QUESTIONS_7_": "<p>Однако обратное невозможно, формально корректные структуры заголовков не обязательно полезны. Главное, чтобы заголовки раскрывали содержание страницы. Следовательно, необходимо рассмотреть содержание, составленное из заголовков, и подумать:</p>",
  "_STEP_9_1_3_1A_QUESTIONS_8_": "<ul><li><p>Полное ли это содержание?</p></li><li><p>Показывает ли оно мне все важные содержания страницы?</p></li><li><p>Полезно ли это содержание?</p></li><li><p>Могу ли я без больших усилий получить доступ ко всем важным содержаниям страницы?</p></li></ul>",
  "_STEP_9_1_3_1A_QUESTIONS_9_": "<p>Это решающие вопросы, структура должна быть полезной для пользователей. Соблюдение различных технических правил тогда будет следовать автоматически.</p>",
  "_STEP_9_1_3_1A_QUESTIONS_10_": "<h3 id=\"_muss_für_die_oberste_überschrift_immer_h1_verwendet_werden\">Должен ли для верхнего заголовка всегда использоваться <code>h1</code>?</h3>",
  "_STEP_9_1_3_1A_QUESTIONS_11_": "<p>Вопрос в том, есть ли приемлемая причина для пропуска заголовка <code>h1</code>. Например, может быть использован <code>h2</code>, потому что лицо, реализующее, считало заголовок <code>h1</code> слишком большим и не знало, как изменить размер. Это не является приемлемой причиной, так как содержание и форма должны быть разделены.</p>",
  "_STEP_9_1_3_1A_QUESTIONS_12_": "<p>Другая причина начать с более низкого уровня заголовка: веб-приложение является составным документом, отдельные страницы, например, являются отдельными главами этого документа. Это приемлемая причина.</p>",
  "_STEP_9_1_3_1A_QUESTIONS_13_": "<p>Однако для полезности заголовков не имеет значения, стоит ли <code>h1</code> на верхнем месте.</p>",
  "_STEP_9_1_3_1A_QUESTIONS_14_": "<h3 class=\"Heading Heading--h5\" id=\"_kann_man_auch_grafische_schriften_als_überschriften_auszeichnen\">Можно ли также использовать графические шрифты в качестве заголовков?</h3>",
  "_STEP_9_1_3_1A_QUESTIONS_15_": "<p>Использование графических шрифтов для заголовков в целом проблематично. Поскольку пользователи не могут легко адаптировать графику к своим потребностям.</p>",
  "_STEP_9_1_3_1A_QUESTIONS_16_": "<p>Однако они могут быть обозначены как заголовки. Этап проверки 9.1.3.1.A считается выполненным, если графические заголовки обозначены как заголовки должным образом.</p>",
  "_STEP_9_1_3_1A_QUESTIONS_17_": "<h3 id=\"_was_ist_der_unterschied_zwischen_dem_dokumenttitel_und_der_h1_überschrift\">В чем разница между заголовком документа и заголовком <code>h1</code>?</h3>",
  "_STEP_9_1_3_1A_QUESTIONS_18_": "<p><strong>Заголовок документа</strong> используется как заголовок окна или для закладок. Если у вас в списке много закладок или открыто несколько окон, то заголовок документа должен помочь выбрать правильную страницу. Что должно быть в заголовке документа, чтобы это было возможно? Заголовок документа имеет две части.</p>",
  "_STEP_9_1_3_1A_QUESTIONS_19_": "<p>Первая часть говорит вам, о чем идет речь на странице. Она обычно различается для всех документов веб-приложения. Потому что она нужна, чтобы различать разные страницы одного и того же веб-приложения.</p>",
  "_STEP_9_1_3_1A_QUESTIONS_20_": "<p>Вторая часть говорит, к какому веб-приложению принадлежит страница. Она обычно одинакова для всех документов веб-приложения, она нужна, чтобы отличать страницу от тематически похожих страниц других веб-приложений.</p>",
  "_STEP_9_1_3_1A_QUESTIONS_21_": "<p>Что касается <strong>главной заголовки</strong>, то речь идет скорее о внутренней структуризации страницы. Снаружи я главную заголовку не вижу, она показывается мне только после того, как я выбрал и открыл страницу.</p>",
  "_STEP_9_1_3_1A_QUESTIONS_22_": "<p>Главный заголовок затем повторяет основную тему страницы или, если главных заголовок несколько, две или три основные темы.</p>",
  "_STEP_9_1_3_1A_QUESTIONS_23_": "<p>Поскольку заголовок документа также должен указывать основную тему страницы, может быть хорошо, если главный заголовок просто повторяет \"индивидуальную\" часть заголовка документа.</p>",
  "_STEP_9_1_3_1A_QUESTIONS_24_": "<p>Вот можно было бы сказать: Зачем мне тогда вообще нужен главный заголовок. Что я выбрал через заголовок документа или через навигационную систему веб-приложения, я уже знаю. Некоторые веб-страницы поэтому отказываются от главной заголовки и сразу начинают со списка \"точек входа\", которые указывают на темы страницы. Это логично, но можно также занять позицию, что главный заголовок должен все же стоять на самой странице.</p>"
}