{
  "_STEP_7_1_4_NAME_": "Настройка субтитров",
  "_STEP_7_1_4_NAME_MENU_": "7.1.4 Настройка субтитров",
  "_STEP_7_1_4_WHAT_CHECKED_1_": "<p>Если веб-приложение включает видео с субтитрами, субтитры можно настроить, например, изменить размер шрифта.</p>",
  "_STEP_7_1_4_WHY_CHECKED_1_": "<p>Для видео с субтитрами полезно, если пользователи субтитров могут настраивать их визуальное отображение, например, увеличивать шрифт или повышать контраст текста.</p>",
  "_STEP_7_1_4_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_7_1_4_HOW_CHECKED_2_": "<p>Этап проверки применим, если веб-приложение содержит видео с субтитрами и их можно включить (closed captions). На постоянно видимые субтитры, которые являются частью изображения видео (open captions), этап проверки не применим.</p>",
  "_STEP_7_1_4_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_7_1_4_HOW_CHECKED_4_": "<ol><li><p>Открыть веб-приложение.</p></li><li><p>Воспроизвести видео с субтитрами.</p></li><li><p>Если субтитры включаемые: проверить, есть ли возможности настройки отображения субтитров, например, для изменения размера шрифта, шрифта (Font), цвета переднего и заднего плана или прозрачности области субтитров.</p></li></ol>",
  "_STEP_7_1_4_HOW_CHECKED_5_": "<p>Примечания к этому этапу проверки вы можете оставить на GitHub <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">в виде вопроса</a>.</p>",
  "_STEP_7_1_4_HOW_CHECKED_6_": "<h3 id=\"_3_hinweise\">3. Примечания</h3>",
  "_STEP_7_1_4_HOW_CHECKED_7_": "<ul><li><p>Арт и объем возможностей настройки не нормативно определены. Стандарты в качестве примера называют цвет переднего и заднего плана субтитров, шрифт, размер, прозрачность области субтитров и контур шрифта.</p></li><li><p>Этап проверки также считается выполненным, если настройка отображения субтитров не производится через настройки видеоплеера, а через настройки браузера или системы (например, если увеличение размера шрифта или адаптированные цветовые схемы в настройках браузера влияют на отображение субтитров).</p></li></ul>",
  "_STEP_7_1_4_HOW_CHECKED_8_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_7_1_4_HOW_CHECKED_9_": "<h4 id=\"_nicht_erfüllt\">Не выполнено:</h4>",
  "_STEP_7_1_4_HOW_CHECKED_10_": "<ul><li><p>Для включаемых субтитров (closed captions) нет никаких возможностей настройки положения, размера текста, цвета текста переднего и заднего плана, стиля текста или шрифта текста.</p></li></ul>",
  "_STEP_7_1_4_SOURCES_1_": "<ul><li><p>На данный момент нет источников.</p></li></ul>",
  "_STEP_7_1_4_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v_3_2_1\">Классификация этапа проверки по EN 301 549 v.3.2.1</h3>",
  "_STEP_7_1_4_CLASSIFICATION_2_": "<h4 id=\"_7_1_4_captions_characteristics\">7.1.4 Характеристики субтитров</h4>",
  "_STEP_7_1_4_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where ICT displays captions, it shall provide a way for the user to adapt the displayed characteristics of captions to their individual requirements, except where the captions are displayed as unmodifiable characters.</p><p>NOTE 1: Defining the background and foreground colour of subtitles, font type, size opacity of the background box of subtitles, and the contour or border of the fonts can contribute to meeting this requirement.</p><p>NOTE 2: Subtitles that are bitmap images are examples of unmodifiable characters.</p></div></div>"
}