{
  "_STEP_12_2_4_NAME_": "Vom Support bereitgestellte Dokumentation",
  "_STEP_12_2_4_NAME_MENU_": "12.2.4 Vom Support bereitgestellte Dokumentation",
  "_STEP_12_2_4_WHAT_CHECKED_1_": "<p>Wird durch den technischen Support eines Angebots eine Dokumentation bereitgestellt, wird diese in mindestens einem der folgenden Formate barrierefrei angeboten:</p>",
  "_STEP_12_2_4_WHAT_CHECKED_2_": "<ul><li><p>Als Web-Dokument, das die Kriterien der EN 301 549 Kapitel 9 erfüllt</p></li><li><p>Als Nicht-Web-Dokument (z. B. ein PDF oder eine Word-Datei), dass die Kriterien der EN 301 549 Kapitel 10 erfüllt</p></li></ul>",
  "_STEP_12_2_4_WHAT_CHECKED_3_": "<p>Weitere gegebenenfalls nicht barrierefreie Versionen der Dokumentation werden nicht bewertet.</p>",
  "_STEP_12_2_4_WHY_CHECKED_1_": "<p>Die technische Dokumentation ist ein wichtiger Bestandteil vieler Angebote, besonders bei komplexeren Web-Anwendungen. Damit auch Menschen mit Behinderungen sie gut nutzen können, sollte sie alle Anforderungen der Barrierefreiheit erfüllen.</p>",
  "_STEP_12_2_4_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_12_2_4_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn Support Services eine technische Dokumentation zur Nutzung des Angebots bereitstellen, etwa HTML-basierte Hilfe-Systeme, PDF-Handbücher, oder Anleitungen. Im BIK BITV-Test können lediglich Dokumente auf Basis von Web-Technologien getestet werden.</p>",
  "_STEP_12_2_4_HOW_CHECKED_3_": "<p>Falls von Support Services eine webbasierte Dokumentation bereitgestellt wird, sollte dies vorab mit dem Anbieter geklärt werden, damit diese Dokumentation bereits bei der Seitenauswahl berücksichtigt werden kann. Für andere Formate (etwa PDF) muss gegebenenfalls ein getrennter Prüfauftrag erteilt werden, da sich diese Formate im BITV-Test nicht prüfen lassen.</p>",
  "_STEP_12_2_4_HOW_CHECKED_4_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_12_2_4_HOW_CHECKED_5_": "<p>Gibt es eine Support-Dienstleistung, die eine technische Dokumentation zur Nutzung bzw. zum Verständnis der Funktionen eines Angebots bereitstellt?</p>",
  "_STEP_12_2_4_HOW_CHECKED_6_": "<p>Beispiele wären:</p>",
  "_STEP_12_2_4_HOW_CHECKED_7_": "<ul><li><p>Ein Datenbank-Anbieter schickt auf Anfrage den Link zu einer HTML-Anwendung mit einer Erklärung der angebotenen Such- und Filter-Funktionen.</p></li><li><p>Ein Dokumenten-Management-System schickt auf Anfrage eine HTML-Referenzseite zu unterstützten Tastaturbefehlen.</p></li><li><p>Der Anbieter eines web-basierten Drucker-Management-Systems schickt auf Anfrage ein PDF-Handbuch mit einer vollständigen Liste der verfügbaren Touch-Displays eines Druckers mit Dokumentation aller angebotenen Funktionen (dieses Handbuch wäre nicht im Test zu prüfen, der Auftraggeber wird darauf hingewiesen, hier ggf. einen Zusatzauftrag für eine PDF-Prüfung zu erteilen).</p></li></ul>",
  "_STEP_12_2_4_HOW_CHECKED_8_": "<p>Wenn eine zusätzliche technische Dokumentation im HTML-Format bereitgestellt wird, wird diese in der Seitenauswahl des Tests berücksichtigt und mitgetestet.</p>",
  "_STEP_12_2_4_HOW_CHECKED_9_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_12_2_4_HOW_CHECKED_10_": "<p>Dokumentation bezieht sich in diesem Prüfschritt auf alle Dokumente, die dem Nutzer auf Anfrage <strong>durch den Support</strong> zur Verfügung gestellt werden.</p>",
  "_STEP_12_2_4_HOW_CHECKED_11_": "<p>Der Prüfschritt schließt nicht die Möglichkeit aus, alternative Formate anzubieten, die die Bedürfnisse einer bestimmten Nutzergruppe erfüllen (z. B. Braille-Dokumente für blinde Menschen oder Informationen in leichter Sprache für Personen mit eingeschränkter Kognition, Sprache und Lernfähigkeit).</p>",
  "_STEP_12_2_4_HOW_CHECKED_12_": "<p>Wie dieser Prüfschritt in der Praxis berücksichtigt werden kann, ist noch nicht vollständig geklärt. Für Hinweise zu diesem Prüfschritt können Sie auf GitHub <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">ein Issue eröffnen</a>.</p>",
  "_STEP_12_2_4_HOW_CHECKED_13_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_12_2_4_HOW_CHECKED_14_": "<h4 id=\"_erfüllt\">Erfüllt</h4>",
  "_STEP_12_2_4_HOW_CHECKED_15_": "<p>Die webbasierte Dokumentation erfüllt alle Anforderungen aus Kapitel 9 (Web) der EN.</p>",
  "_STEP_12_2_4_HOW_CHECKED_16_": "<h4 id=\"_nicht_erfüllt\">Nicht erfüllt</h4>",
  "_STEP_12_2_4_HOW_CHECKED_17_": "<p>Die webbasierte Dokumentation erfüllt eine oder mehrere Anforderungen aus Kapitel 9 (Web) nicht.</p>",
  "_STEP_12_2_4_SOURCES_1_": "<ul><li><p>Zurzeit keine Quellen.</p></li></ul>",
  "_STEP_12_2_4_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Einordnung des Prüfschritts nach EN 301 549 V3.2.1</h3>",
  "_STEP_12_2_4_CLASSIFICATION_2_": "<h4 id=\"_12_2_4_accessible_documentation\">12.2.4 Accessible documentation</h4>",
  "_STEP_12_2_4_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Documentation provided by support services shall be made available in at least one of the following electronic formats: * a Web format that conforms to clause 9; or * a non-web format that conforms to clause 10.</p><p>NOTE 1: This does not preclude the possibility of also providing the documentation in other formats (electronic or printed) that are not accessible.</p><p>NOTE 2: It also does not preclude the possibility of providing alternate formats that meet the needs of some specific type of users (e.g. Braille documents for blind people or easy-to-read information for persons with limited cognitive, language and learning abilities).</p><p>NOTE 3: Where the support documentation is incorporated into the ICT, the documentation falls under the requirements for accessibility in the present document.</p><p>NOTE 4: A user agent that supports automatic media conversion would be beneficial to enhancing accessibility.</p></div></div>"
}