{
  "_STEP_12_2_4_NAME_": "Документация, предоставляемая поддержкой",
  "_STEP_12_2_4_NAME_MENU_": "12.2.4 Документация, предоставляемая поддержкой",
  "_STEP_12_2_4_WHAT_CHECKED_1_": "<p>Если техническая поддержка предлагает документацию, она должна быть доступна по крайней мере в одном из следующих форматов:</p>",
  "_STEP_12_2_4_WHAT_CHECKED_2_": "<ul><li><p>Как веб-документ, соответствующий критериям EN 301 549 главы 9</p></li><li><p>Как не веб-документ (например, PDF или Word-файл), соответствующий критериям EN 301 549 главы 10</p></li></ul>",
  "_STEP_12_2_4_WHAT_CHECKED_3_": "<p>Другие возможные версии документации, не соответствующие критериям доступности, не оцениваются.</p>",
  "_STEP_12_2_4_WHY_CHECKED_1_": "<p>Техническая документация является важной частью многих предложений, особенно при более сложных веб-приложениях. Для того чтобы люди с ограниченными возможностями могли её хорошо использовать, она должна соответствовать всем требованиям доступности.</p>",
  "_STEP_12_2_4_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость проверки</h3>",
  "_STEP_12_2_4_HOW_CHECKED_2_": "<p>Этап проверки применим, если службы поддержки предоставляют техническую документацию для использования предложения, например, HTML-системы помощи, PDF-руководства или инструкции. В тесте BIK BITV могут быть проверены только документы на основе веб-технологий.</p>",
  "_STEP_12_2_4_HOW_CHECKED_3_": "<p>Если службы поддержки предоставляют веб-базированную документацию, это должно быть заранее согласовано с провайдером, чтобы эта документация была учтена при выборе страниц. Для других форматов (например, PDF) может потребоваться отдельное задание на проверку, поскольку эти форматы не могут быть проверены в рамках теста BIK BITV.</p>",
  "_STEP_12_2_4_HOW_CHECKED_4_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_12_2_4_HOW_CHECKED_5_": "<p>Есть ли служба поддержки, предоставляющая техническую документацию для использования или понимания функций предложения?</p>",
  "_STEP_12_2_4_HOW_CHECKED_6_": "<p>Примеры:</p>",
  "_STEP_12_2_4_HOW_CHECKED_7_": "<ul><li><p>Поставщик баз данных по запросу отправляет ссылку на HTML-приложение с объяснением предлагаемых функций поиска и фильтрации.</p></li><li><p>Система управления документами по запросу отправляет HTML-страницу справки по поддерживаемым клавишам быстрого доступа.</p></li><li><p>Поставщик веб-базированной системы управления принтерами по запросу отправляет PDF-руководство с полным списком доступных сенсорных дисплеев принтера с документацией всех предлагаемых функций (это руководство не подлежит проверке в тесте, заказчик будет проинформирован о возможности размещения дополнительного заказа на проверку PDF).</p></li></ul>",
  "_STEP_12_2_4_HOW_CHECKED_8_": "<p>Если дополнительная техническая документация в формате HTML предоставляется, она учитывается при выборе страниц для тестирования и проверяется вместе с ними.</p>",
  "_STEP_12_2_4_HOW_CHECKED_9_": "<h3 id=\"_3_hinweise\">3. Примечания</h3>",
  "_STEP_12_2_4_HOW_CHECKED_10_": "<p>Документация в этом этапе проверки относится ко всем документам, которые предоставляются пользователю по запросу <strong>через поддержку</strong>.</p>",
  "_STEP_12_2_4_HOW_CHECKED_11_": "<p>Этап проверки не исключает возможность предложения альтернативных форматов, которые удовлетворяют потребности определенной группы пользователей (например, документы шрифтом Брайля для слепых людей или информация на простом языке для лиц с ограниченными возможностями когнитивного, языкового и обучающего характера).</p>",
  "_STEP_12_2_4_HOW_CHECKED_12_": "<p>Как этот этап проверки может быть учтен на практике, еще не полностью выяснено. Для получения рекомендаций по этому этапу проверки вы можете оставить сообщение на GitHub <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">создать Issue</a>.</p>",
  "_STEP_12_2_4_HOW_CHECKED_13_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_12_2_4_HOW_CHECKED_14_": "<h4 id=\"_erfüllt\">Выполнено</h4>",
  "_STEP_12_2_4_HOW_CHECKED_15_": "<p>Веб-базированная документация соответствует всем требованиям главы 9 (Веб) EN.</p>",
  "_STEP_12_2_4_HOW_CHECKED_16_": "<h4 id=\"_nicht_erfüllt\">Не выполнено</h4>",
  "_STEP_12_2_4_HOW_CHECKED_17_": "<p>Веб-базированная документация не соответствует одному или нескольким требованиям главы 9 (Веб).</p>",
  "_STEP_12_2_4_SOURCES_1_": "<ul><li><p>В настоящее время нет источников.</p></li></ul>",
  "_STEP_12_2_4_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки согласно EN 301 549 V3.2.1</h3>",
  "_STEP_12_2_4_CLASSIFICATION_2_": "<h4 id=\"_12_2_4_accessible_documentation\">12.2.4 Доступная документация</h4>",
  "_STEP_12_2_4_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Documentation provided by support services shall be made available in at least one of the following electronic formats: * a Web format that conforms to clause 9; or * a non-web format that conforms to clause 10.</p><p>NOTE 1: This does not preclude the possibility of also providing the documentation in other formats (electronic or printed) that are not accessible.</p><p>NOTE 2: It also does not preclude the possibility of providing alternate formats that meet the needs of some specific type of users (e.g. Braille documents for blind people or easy-to-read information for persons with limited cognitive, language and learning abilities).</p><p>NOTE 3: Where the support documentation is incorporated into the ICT, the documentation falls under the requirements for accessibility in the present document.</p><p>NOTE 4: A user agent that supports automatic media conversion would be beneficial to enhancing accessibility.</p></div></div>"
}