{
  "_STEP_9_2_2_2_NAME_": "Отключаемое движение контента",
  "_STEP_9_2_2_2_NAME_MENU_": "9.2.2.2 Отключаемое движение контента",
  "_STEP_9_2_2_2_WHAT_CHECKED_1_": "<p>Раздражение от мигающих или движущихся элементов должно быть исключено, ограничено пятью секундами или отключаемо.</p>",
  "_STEP_9_2_2_2_WHAT_CHECKED_2_": "<p>Движущийся или автоматически обновляемый контент, например, периодически изменяющиеся заголовки новостей (телеграфы) должны быть остановлены для чтения.</p>",
  "_STEP_9_2_2_2_WHY_CHECKED_1_": "<p>Многие пользователи испытывают трудности с использованием страниц, которые содержат мигающие или движущиеся элементы (например, реклама). Такие элементы отвлекают. Пользователь может не сосредоточиться на других элементах веб-страницы.</p>",
  "_STEP_9_2_2_2_WHY_CHECKED_2_": "<p>Многие пользователи также испытывают трудности с чтением мигающего или движущегося контента, например, новостных лент.</p>",
  "_STEP_9_2_2_2_WHY_CHECKED_3_": "<p>Интерактивный движущийся контент может быть проблематичным для пользователей с нарушениями моторики.</p>",
  "_STEP_9_2_2_2_WHY_CHECKED_4_": "<p>Автоматически обновляемые новостные заголовки (телеграфы) изменяют отображаемый контент без предупреждения, нарушая восприятие и ориентацию. Это особенно затрудняет увеличение экрана пользователям и тем, кто нуждается в большем времени для чтения. У пользователей скринридера может происходить непредвиденное перемещение фокуса.</p>",
  "_STEP_9_2_2_2_WHY_CHECKED_5_": "<p>Некоторые движения (например, анимированные gif) можно остановить нажатием клавиши esc, но большинство пользователей не знают об этой функции. Также отключение JavaScript в некоторых случаях прекращает движение, например, у скриптовых тикеров или переменчивых телеграфов. Но такое отключение становится все более проблематичным, так как все больше веб-сайтов зависят от активного JavaScript. Даже если веб-сайт продолжает работать, пользователи не знают, что они теряют без JavaScript.</p>",
  "_STEP_9_2_2_2_WHY_CHECKED_6_": "<p>Кнопки для остановки движения проблематичны в использовании. Их нужно сначала найти, прежде чем пользователи смогут остановить движение. Поскольку они используются очень редко, пользователи часто их не знают и не узнают.</p>",
  "_STEP_9_2_2_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость проверки</h3>",
  "_STEP_9_2_2_2_HOW_CHECKED_2_": "<p>Этот шаг проверки всегда применим, когда движущийся контент отображается одновременно с другими недвижимыми содержимым (например, навигацией или статическим контентом).</p>",
  "_STEP_9_2_2_2_HOW_CHECKED_3_": "<p>Этот шаг проверки не применим к существенно важным обновлениям содержимого, например, когда отсчитывается оставшееся время сессии или динамически обновляется размер ставки на аукционе.</p>",
  "_STEP_9_2_2_2_HOW_CHECKED_4_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_2_2_2_HOW_CHECKED_5_": "<p>Если страница содержит мигающий, движущийся или автоматически обновляемый контент, например, новостные заголовки (телеграфы), бегущие строки или анимированную рекламу:</p>",
  "_STEP_9_2_2_2_HOW_CHECKED_6_": "<ol><li><p>Проверить, прекращается ли движение само по себе в течение 5 секунд после отображения страницы.</p></li><li><p>Если это не так: Определить, есть ли на странице кнопка, с помощью которой можно остановить движение, загрузить эквивалентную неанимированную версию страницы, или есть ли четкая инструкция о том, как можно остановить движение с помощью клавиатуры.</p></li><li><p>Проверить, действительно ли активация кнопки или сочетания клавиш останавливает движение и оно не начинается снова само по себе.</p></li></ol>",
  "_STEP_9_2_2_2_HOW_CHECKED_7_": "<p>Кроме того, следует проверить, возобновляется ли движение после повторной активации кнопки, и начинается ли оно (в случае видео или анимаций) с того момента, который был достигнут при последней остановке. Если это не так, это следует отметить. Но этот недостаток не следует понимать как нарушение требований этого шага проверки.</p>",
  "_STEP_9_2_2_2_HOW_CHECKED_8_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_9_2_2_2_HOW_CHECKED_9_": "<p>Кнопка или инструкция, с помощью которой можно остановить движение, должна быть четко обозначена и явно видима в начале страницы или непосредственно в контексте движущегося содержимого.</p>",
  "_STEP_9_2_2_2_HOW_CHECKED_10_": "<p>Все содержимое должно оставаться доступным после остановки движения.</p>",
  "_STEP_9_2_2_2_HOW_CHECKED_11_": "<p>Не имеет значения, являются ли мигающие или движущиеся содержимое рекламой или редакционным материалом.</p>",
  "_STEP_9_2_2_2_HOW_CHECKED_12_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_2_2_2_HOW_CHECKED_13_": "<h4 id=\"_nicht_voll_erfüllt\">Не полностью выполнено</h4>",
  "_STEP_9_2_2_2_HOW_CHECKED_14_": "<ul><li><p>Движение не прекращается само по себе, движущийся и автоматически обновляемый контент не может быть остановлен, скрыт или настроен на изменение частоты обновления.</p></li><li><p>Элемент для остановки движения не находится в непосредственном контексте движущегося элемента или в начале просмотра, или не выполняет все требования доступности.</p></li></ul>",
  "_STEP_9_2_2_2_SOURCES_1_": "<h3 id=\"_die_wcag_2_1_zum_anhalten_und_fortsetzen_bei_aufgezeichneten_inhalten_und_echtzeit_inhalten\">WCAG 2.1 об остановке и продолжении в записанных и реальных контентах</h3>",
  "_STEP_9_2_2_2_SOURCES_2_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>Контент, который был приостановлен, может либо возобновиться в реальном времени, либо продолжиться с того момента, на котором пользователь остановился.</p><p>Приостановка и продолжение с места остановки лучше всего подходит пользователям, которые хотят приостановить чтение содержимого и лучше всего работает, когда содержимое не связано с реальным событием или статусом.</p><p><em>Примечание</em>: Смотрите <a href=\"https://www.w3.org/WAI/WCAG21/Understanding/timing-adjustable.html\">Понимание критерия успеха 2.2.1 Регулируемое время</a> для дополнительных требований, связанных с временными ограничениями для чтения. Приостановка и переход к текущему дисплею (при снятии паузы) лучше для информации, которая является реальной или \"статусной\" по своей природе. Например, радар погоды, биржевой тикер, трафик-камера или таймер аукциона, могли бы предоставить вводящую в заблуждение информацию, если пауза заставила бы их отображать старую информацию, когда содержимое было возобновлено.</p><p><em>Примечание</em>: Скрытие контента имело бы такой же результат, как приостановка и переход к текущему дисплею (при снятии паузы).</p></blockquote></div>",
  "_STEP_9_2_2_2_SOURCES_3_": "<p>(<a href=\"https://www.w3.org/WAI/WCAG21/Understanding/pause-stop-hide.html\">Пауза, Остановка, Скрытие: Понимание SC 2.2.2</a>)</p>",
  "_STEP_9_2_2_2_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_der_prüfschritte_9_2_2_1_und_9_2_2_2\">Различие между шагами проверки 9.2.2.1 и 9.2.2.2</h3>",
  "_STEP_9_2_2_2_CLASSIFICATION_2_": "<p>Этот шаг проверки 9.2.2.2 касается движущихся контентов, которые отвлекают пользователей или из-за своей предопределенной временной последовательности трудно воспринимаются определенными пользователями. Здесь проверяется, могут ли пользователи останавливать или скрывать движущиеся контенты.</p>",
  "_STEP_9_2_2_2_CLASSIFICATION_3_": "<p>Шаг проверки 9.2.2.1 'Регулируемые временные ограничения' касается временных ограничений, которые затрагивают всю страницу, независимо от того, движутся ли ограниченные контенты (то есть отвлекают) или нет. Проверяется, можно ли такие временные ограничения отключить или продлить.</p>",
  "_STEP_9_2_2_2_CLASSIFICATION_4_": "<p>Для различия между миганием и мерцанием смотрите раздел 'Источники' в шаге проверки 9.2.3.1 'Отказ от мерцания'.</p>",
  "_STEP_9_2_2_2_CLASSIFICATION_5_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация шага проверки по WCAG 2.1</h3>",
  "_STEP_9_2_2_2_CLASSIFICATION_6_": "<h4 id=\"_guideline\">Руководство</h4>",
  "_STEP_9_2_2_2_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#enough-time\"> Руководство 2.2 Достаточно времени: обеспечить пользователям достаточно времени для чтения и использования контента.</a></p></li></ul>",
  "_STEP_9_2_2_2_CLASSIFICATION_8_": "<h4 id=\"_success_criterion\">Критерии успеха</h4>",
  "_STEP_9_2_2_2_CLASSIFICATION_9_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#pause-stop-hide\"> 2.2.2 Пауза, Остановка, Скрытие</a> (Уровень A)</p></li></ul>",
  "_STEP_9_2_2_2_CLASSIFICATION_10_": "<h4 id=\"_techniques\">Техники</h4>",
  "_STEP_9_2_2_2_CLASSIFICATION_11_": "<h5 id=\"_general_techniques\">Общие техники</h5>",
  "_STEP_9_2_2_2_CLASSIFICATION_12_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G4\"> G4: Позволяет содержимому приостанавливаться и перезапускаться с места, где оно было приостановлено</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G11.html\"> G11: Создание контента, который мигает менее 5 секунд</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G152.html\"> G152: Установка анимированных gif изображений для прекращения мигания после n циклов (в течение 5 секунд)</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G186.html\"> G186: Использование элемента управления на веб-странице, который останавливает движение, мигание или автообновление контента</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G191.html\"> G191: Предоставление ссылки, кнопки или другого механизма, который перезагружает страницу без мигающего контента</a></p></li></ul>",
  "_STEP_9_2_2_2_CLASSIFICATION_13_": "<h5 id=\"_scripting_techniques\">Техники скриптования</h5>",
  "_STEP_9_2_2_2_CLASSIFICATION_14_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/client-side-script/SCR22.html\"> SCR22: Использование скриптов для контроля мерцания и его остановки в течение пяти секунд или менее</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/client-side-script/SCR33.html\"> SCR33: Использование скрипта для прокрутки содержимого и предоставление механизма для его паузы</a></p></li></ul>",
  "_STEP_9_2_2_2_CLASSIFICATION_15_": "<h5 id=\"_failures\">Неудачи</h5>",
  "_STEP_9_2_2_2_CLASSIFICATION_16_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F4.html\"> F4: Нарушение критерия успеха 2.2.2 из-за использования text-decoration:blink без механизма для его остановки менее чем за пять секунд</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F7.html\"> F7: Нарушение критерия успеха 2.2.2 из-за использования <code>object</code> или <code>applet</code>, например Java или Flash, которые содержат мигающий контент без механизма для паузы содержимого, мигающего более пяти секунд</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F16.html\"> F16: Нарушение критерия успеха 2.2.2 из-за включения прокручиваемого содержимого, движение которого не является существенным для активности, без также включения механизма для паузы и перезапуска содержимого</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F47.html\"> F47: Нарушение критерия успеха 2.2.2 из-за использования элемента blink</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F50.html\"> F50: Нарушение критерия успеха 2.2.2 из-за скрипта, вызывающего эффект мерцания без механизма для остановки мерцания в течение 5 секунд или менее</a></p></li></ul>"
}