{
  "_STEP_9_2_4_5_NAME_": "Альтернативные пути доступа",
  "_STEP_9_2_4_5_NAME_MENU_": "9.2.4.5 Альтернативные пути доступа",
  "_STEP_9_2_4_5_WHAT_CHECKED_1_": "<p>Должно быть предоставлено по крайней мере два различных способа доступа к содержимому предложения.</p>",
  "_STEP_9_2_4_5_WHY_CHECKED_1_": "<p>Пользователи предпочитают различные способы доступа к содержимому. Некоторые ориентируются на иерархические меню навигации, другие используют оглавление (карту сайта), третьи предпочитают поисковую функцию. Особенно для пользователей с нарушениями зрения часто быстрее найти нужное содержимое через поиск.</p>",
  "_STEP_9_2_4_5_WHY_CHECKED_2_": "<p>Поэтому предложение должно предоставлять различные пути доступа к содержимому.</p>",
  "_STEP_9_2_4_5_HOW_CHECKED_1_": "<h3 id=\"_anwendbarkeit_des_prüfschritts\">Применимость этапа проверки</h3>",
  "_STEP_9_2_4_5_HOW_CHECKED_2_": "<p>Этап проверки применим, если веб-предложение ориентировано на информацию и состоит более чем из одной страницы.</p>",
  "_STEP_9_2_4_5_HOW_CHECKED_3_": "<h3 id=\"_prüfung\">Проверка</h3>",
  "_STEP_9_2_4_5_HOW_CHECKED_4_": "<ol class=\"arabic\"><li><p>Рассмотреть предложение на наличие существующих путей доступа. Типичные пути доступа включают:</p><ul><li><p>Постоянно доступные меню навигации</p></li><li><p>Оглавление (карта сайта)</p></li><li><p>Поисковая функция (непосредственно через поле для поиска или через ссылку на центральную страницу поиска)</p></li><li><p>Все страницы предложения связаны со стартовой страницей или связаны на каждой странице предложения (только для маленьких сайтов)</p></li><li><p>Последовательная связь всех страниц (только для маленьких сайтов или для сайтов, где восприятие страниц в определенном порядке имеет смысл)</p></li><li><p>Страницы, созданные в рамках процесса (например, в результате транзакции)</p></li></ul></li><li><p>Существует ли по крайней мере два пути доступа, например, иерархическое навигационное меню и поисковая функция, или навигационное меню и оглавление (карта сайта)?</p></li><li><p>Выборочно проверить пути доступа на их функциональность</p></li></ol>",
  "_STEP_9_2_4_5_HOW_CHECKED_5_": "<h3 id=\"_hinweise\">Примечания</h3>",
  "_STEP_9_2_4_5_HOW_CHECKED_6_": "<ul><li><p>Не требуется, чтобы иерархические навигационные меню полностью отображали глубокие уровни предложения.</p></li><li><p>Для этого этапа проверки не имеет значения, ориентированы ли навигационные меню вертикально или горизонтально. Однако они должны быть различимы как самостоятельные области.</p></li><li><p>Комбинация из иерархического главного меню и подчиненных областных меню считается <strong>одним</strong> путем доступа.</p></li><li><p>Иерархический навигационный путь (хлебные крошки) полезен, но не считается самостоятельным путем доступа, так как он позволяет навигацию только к высшим уровням иерархии страниц, а не к нижележащим уровням.</p></li><li><p>Для маленьких предложений с немногими страницами, все связанные со стартовой страницей, она одновременно может считаться картой сайта, если на всех подстраницах предложения ясно предложена ссылка на стартовую страницу.</p></li><li><p>В последовательных процессах может быть целесообразно, чтобы кроме навигации к следующим и предыдущим этапам процесса не предлагалось других опций навигации. Поскольку страницы (или инстансы) процесса имеют смысл только в рамках общего процесса и не должны быть доступны отдельно. Здесь отсутствие дополнительных опций навигации не должно оцениваться отрицательно.</p></li></ul>",
  "_STEP_9_2_4_5_SOURCES_1_": "<h3 id=\"_multiple_ways_specific_benefits_of_success_criterion_2_4_5\">Различные пути - конкретные преимущества критерия успеха 2.4.5</h3>",
  "_STEP_9_2_4_5_SOURCES_2_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><ul><li><p>Providing an opportunity to navigate sites in more than one manner can help people find information faster. Users with visual impairments may find it easier to navigate to the correct part of the site by using a search, rather than scrolling through a large navigation bar using a screen magnifier or screen reader. A person with cognitive disabilities may prefer a table of contents or site map that provides an overview of the site rather than reading and traversing through several Web pages. Some users may prefer to explore the site in a sequential manner, moving from Web page to Web page in order to best understand the concepts and layout.</p></li><li><p>Individuals with cognitive limitations may find it easier to use search features than to use a hierarchical navigation scheme that be difficult to understand.</p></li></ul></blockquote></div>",
  "_STEP_9_2_4_5_SOURCES_3_": "<p>(<a href=\"https://www.w3.org/WAI/WCAG21/Understanding/multiple-ways.html\"> Различные способы: Понимание SC 2.4.5</a>)</p>",
  "_STEP_9_2_4_5_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация этапа проверки по WCAG 2.1</h3>",
  "_STEP_9_2_4_5_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Руководство</h4>",
  "_STEP_9_2_4_5_CLASSIFICATION_3_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#navigable\"> Руководство 2.4 Навигация: Обеспечение способов помочь пользователям ориентироваться, находить содержимое и определять, где они находятся.</a></p></li></ul>",
  "_STEP_9_2_4_5_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Критерий успеха</h4>",
  "_STEP_9_2_4_5_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#multiple-ways\"> 2.4.5 Множественные пути</a> (Уровень AA)</p></li></ul>",
  "_STEP_9_2_4_5_CLASSIFICATION_6_": "<h4 id=\"_techniques\">Техники</h4>",
  "_STEP_9_2_4_5_CLASSIFICATION_7_": "<h5 id=\"_general_techniques\">Общие техники</h5>",
  "_STEP_9_2_4_5_CLASSIFICATION_8_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G63.html\"> G63: Предоставление карты сайта</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G64.html\"> G64: Предоставление оглавления</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G125.html\"> G125: Предоставление ссылок для навигации по связанным веб-страницам</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G126.html\"> G126: Предоставление списка ссылок на все другие веб-страницы</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G161.html\"> G161: Предоставление функции поиска для помощи пользователям в поиске контента</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G185.html\"> G185: Ссылка на все страницы сайта со стартовой страницы</a></p></li></ul>"
}