{
  "_STEP_7_1_1_NAME_": "Wiedergabe von Untertiteln",
  "_STEP_7_1_1_NAME_MENU_": "7.1.1 Wiedergabe von Untertiteln",
  "_STEP_7_1_1_WHAT_CHECKED_1_": "<p>Sind Videos mit synchroner Bild- und Tonspur vorhanden und werden dynamisch zuschaltbare, textbasierte Untertitel (closed captions) angeboten, bietet der Videoplayer die Möglichkeit, diese ein- und auszublenden.</p>",
  "_STEP_7_1_1_WHY_CHECKED_1_": "<p>Filme sind in der Regel ohne den Ton nicht zu verstehen. Daher muss für Menschen mit Höreinschränkung der Inhalt der Tonspur durch Untertitel bereitgestellt werden.</p>",
  "_STEP_7_1_1_WHY_CHECKED_2_": "<p>Untertitel können auf unterschiedliche Arten eingebunden werden: Manche Player unterstützen nur die dauerhaft sichtbaren „open captions“, die meisten jedoch sogenannte textbasierte „closed captions“, die über ein Bedienelement am Player flexibel zuschaltbar sind.</p>",
  "_STEP_7_1_1_WHY_CHECKED_3_": "<p>Damit closed captions (dynamisch zuschaltbare Untertitel) von den Nutzenden wahrgenommen werden können, ist es erforderlich, dass der Videoplayer die Möglichkeit bietet, diese ein- und auszublenden. Bei open captions handelt es sich hingegen um immer sichtbare Untertitel, d.h. der Videoplayer wird hier nicht geprüft.</p>",
  "_STEP_7_1_1_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_7_1_1_HOW_CHECKED_2_": "<ul><li><p>Der Prüfschritt ist anwendbar, wenn die Webseite aufgezeichnete Videos mit synchroner Bild- und Tonspur anbietet und Untertitel vorhanden sind. Zuschaltbare Untertitel sind in der Regel innerhalb des <code>video</code>-Elements als getrennte <code>track</code>-Datei verfügbar.</p></li><li><p>Aufgezeichnete Videos ohne Tonspur (stumme Videos) brauchen keine Untertitelung, der Prüfschritt ist für sie nicht anwendbar.</p></li></ul>",
  "_STEP_7_1_1_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_7_1_1_HOW_CHECKED_4_": "<ol><li><p>Text-Dateien für Untertitelungen werden meist über das HTML 5 <code>track</code>-Element eingebunden. Im Quellcode prüfen, ob über das <code>track</code>-Element eine Untertitel-Datei eingebunden ist. Das <code>kind</code>-Attribut legt die Art der Texteinblendung fest. Der Wert <code>subtitles</code> zeigt an, dass es sich um Untertitel handelt (Transkription oder Übersetzung des Dialogs). Der Wert <code>captions</code> zeigt an, dass es sich um Untertitel für hörgeschädigte und gehörlose Menschen handelt.</p></li><li><p>Manche Player binden Untertitel-Dateien auch außerhalb des <code>video</code>-Elements ein.</p></li><li><p>Wenn eine Untertitel-Datei eingebunden ist, prüfen, ob der Videoplayer eine Möglichkeit bietet, diese ein- und auszublenden.</p></li></ol>",
  "_STEP_7_1_1_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_7_1_1_HOW_CHECKED_6_": "<ul><li><p>Empfehlenswert wäre, wenn der Videoplayer eine Funktion zur Verfügung stellt, um die Untertitel auf einer Braillezeile anzuzeigen.</p></li><li><p>Nicht negativ bewertet wird, wenn ein alternatives Video mit open captions bei Aktivierung eines Bedienelements im Player neu geladen wird, oder wenn das Video mit open captions über einen zweiten Player angezeigt wird.</p></li></ul>",
  "_STEP_7_1_1_HOW_CHECKED_7_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_7_1_1_HOW_CHECKED_8_": "<h4 id=\"_erfüllt\">Erfüllt</h4>",
  "_STEP_7_1_1_HOW_CHECKED_9_": "<p>Sind Videos mit synchroner Bild- und Tonspur vorhanden, werden Untertitel als fester Bestandteil des Videos angezeigt (open captions) oder können über ein Bedienelement des Videoplayers ein- und ausgeblendet werden (closed captions).</p>",
  "_STEP_7_1_1_HOW_CHECKED_10_": "<h4 id=\"_nicht_voll_erfüllt\">Nicht voll erfüllt</h4>",
  "_STEP_7_1_1_HOW_CHECKED_11_": "<p>Es wird eine Untertitel-Datei angeboten, der Player bietet jedoch keine Möglichkeit, diese anzuzeigen.</p>",
  "_STEP_7_1_1_SOURCES_1_": "<ul><li><p><a href=\"https://developer.mozilla.org/en-US/docs/Web/Guide/Audio_and_video_delivery/Adding_captions_and_subtitles_to_HTML5_video\">Adding captions and subtitles to HTML video</a> (Mozilla Foundation, mdn web docs)</p></li></ul>",
  "_STEP_7_1_1_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Abgrenzung zu anderen Prüfschritten</h3>",
  "_STEP_7_1_1_CLASSIFICATION_2_": "<p>Bei diesem Prüfschritt geht es um den eigentlichen Prozess der Anzeige von Untertiteln während der Wiedergabe sowie um die Bedienelemente zum Ein- und Ausschalten von Untertiteln im Videoplayer.</p>",
  "_STEP_7_1_1_CLASSIFICATION_3_": "<p>9.1.2.2 \"Aufgezeichnete Videos mit Untertiteln\" bezieht sich hingegen auf den Inhalt der Untertitel. Es geht darum, dass der Autor bei der Erstellung der Untertitel sicherstellen muss, dass Audioinhalt korrekt transkribiert wurde und in einem Format erfasst werden, das für die Bereitstellung synchronisierter Untertitel verwendet werden kann.</p>",
  "_STEP_7_1_1_CLASSIFICATION_4_": "<p>Anforderungen der Video-Bedienelemente bezüglich Kontrast, zugänglichem Namen, Tastaturbedienbarkeit, Fokushervorhebung usw. werden in den entsprechenden Prüfschritten geprüft.</p>",
  "_STEP_7_1_1_CLASSIFICATION_5_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Einordnung des Prüfschritts nach EN 301 549 V3.2.1</h3>",
  "_STEP_7_1_1_CLASSIFICATION_6_": "<h4 id=\"_7_1_1_captioning_playback\">7.1.1 Captioning playback</h4>",
  "_STEP_7_1_1_CLASSIFICATION_7_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where ICT displays video with synchronized audio, it shall have a mode of operation to display the available captions. Where closed captions are provided as part of the content, the ICT shall allow the user to choose to display the captions.</p><p>NOTE 1: Captions may contain information about timing, colour and positioning. This caption data is necessary for caption users. Timing is used for caption synchronization. Colour can be used for speaker identification. Position can be used to avoid obscuring important information.</p><p>NOTE 2: If a Braille device is connected, the ICT should provide an option to display captions on the Braille device.</p></div></div>"
}