{
  "_STEP_7_1_1_NAME_": "Воспроизведение субтитров",
  "_STEP_7_1_1_WHAT_CHECKED_1_": "<p>Если видео с синхронизированной видео- и звуковой дорожкой присутствуют и предлагаются динамически подключаемые текстовые субтитры (closed captions), видеоплеер должен предоставлять возможность включать и выключать их.</p>",
  "_STEP_7_1_1_WHY_CHECKED_1_": "<p>Фильмы обычно нельзя понять без звука. Поэтому для людей с нарушениями слуха контент звуковой дорожки должен быть предоставлен через субтитры.</p>",
  "_STEP_7_1_1_WHY_CHECKED_2_": "<p>Субтитры могут быть включены разными способами: некоторые плееры поддерживают только постоянно видимые «open captions», большинство же поддерживает текстовые «closed captions», которые можно гибко включать через элемент управления в плеере.</p>",
  "_STEP_7_1_1_WHY_CHECKED_3_": "<p>Чтобы закрытые субтитры (динамически подключаемые субтитры) могли быть восприняты пользователями, необходимо, чтобы видеоплеер предоставлял возможность включать и выключать их. В случае открытых субтитров они всегда видимы, и видеоплеер здесь не проверяется.</p>",
  "_STEP_7_1_1_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_7_1_1_HOW_CHECKED_2_": "<ul><li><p>Этап проверки применим, если веб-сайт предлагает записанные видео с синхронной видео- и звуковой дорожкой и присутствуют субтитры. Подключаемые субтитры обычно доступны внутри элемента <code>video</code> как отдельный файл <code>track</code>.</p></li><li><p>Записанные видео без звуковой дорожки (немые видео) не нуждаются в субтитрах, этап проверки для них не применим.</p></li></ul>",
  "_STEP_7_1_1_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Этап проверки</h3>",
  "_STEP_7_1_1_HOW_CHECKED_4_": "<ol><li><p>Текстовые файлы для субтитров обычно включаются через HTML5 элемент <code>track</code>. Проверьте в исходном коде, подключен ли файл субтитров через элемент <code>track</code>. Атрибут <code>kind</code> определяет тип текстовой вставки. Значение <code>subtitles</code> указывает на субтитры (транскрипция или перевод диалога). Значение <code>captions</code> указывает на субтитры для людей с нарушениями слуха.</p></li><li><p>Некоторые плееры также могут включать файлы субтитров вне элемента <code>video</code>.</p></li><li><p>Если файл субтитров подключен, проверьте, предоставляет ли видеоплеер возможность включать и выключать их.</p></li></ol>",
  "_STEP_7_1_1_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Примечания</h3>",
  "_STEP_7_1_1_HOW_CHECKED_6_": "<ul><li><p>Было бы желательно, если бы видеоплеер предоставлял функцию отображения субтитров на брайлевской строке.</p></li><li><p>Не будет отрицательно оценено, если при активации элемента управления в плеере загружается альтернативное видео с открытыми субтитрами или если видео с открытыми субтитрами отображается во втором плеере.</p></li></ul>",
  "_STEP_7_1_1_HOW_CHECKED_7_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_7_1_1_HOW_CHECKED_8_": "<h4 id=\"_erfüllt\">Выполнено</h4>",
  "_STEP_7_1_1_HOW_CHECKED_9_": "<p>Если видео с синхронной видео- и звуковой дорожкой присутствуют, субтитры отображаются как неотъемлемая часть видео (открытые субтитры) или могут быть включены и выключены через элемент управления видеоплеером (закрытые субтитры).</p>",
  "_STEP_7_1_1_HOW_CHECKED_10_": "<h4 id=\"_nicht_voll_erfüllt\">Не полностью выполнено</h4>",
  "_STEP_7_1_1_HOW_CHECKED_11_": "<p>Предлагается файл субтитров, но плеер не предоставляет возможности их отображения.</p>",
  "_STEP_7_1_1_SOURCES_1_": "<ul><li><p><a href=\"https://developer.mozilla.org/en-US/docs/Web/Guide/Audio_and_video_delivery/Adding_captions_and_subtitles_to_HTML5_video\">Добавление субтитров и титров к HTML-видео</a> (Mozilla Foundation, mdn web docs)</p></li></ul>",
  "_STEP_7_1_1_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Отличие от других этапов проверки</h3>",
  "_STEP_7_1_1_CLASSIFICATION_2_": "<p>Этот этап проверки касается собственно процесса отображения субтитров во время воспроизведения, а также элементов управления для включения и выключения субтитров в видеоплеере.</p>",
  "_STEP_7_1_1_CLASSIFICATION_3_": "<p>9.1.2.2 «Записанные видео с субтитрами» относится к содержанию субтитров. Здесь речь идет о том, что автор при создании субтитров должен убедиться, что аудиоконтент был правильно транскрибирован и зафиксирован в формате, подходящем для предоставления синхронизированных субтитров.</p>",
  "_STEP_7_1_1_CLASSIFICATION_4_": "<p>Требования к элементам управления видео, касающиеся контраста, доступности названий, управления с клавиатуры, выделения фокуса и т. д., проверяются в соответствующих этапах проверки.</p>",
  "_STEP_7_1_1_CLASSIFICATION_5_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки согласно EN 301 549 V3.2.1</h3>",
  "_STEP_7_1_1_CLASSIFICATION_6_": "<h4 id=\"_7_1_1_captioning_playback\">7.1.1 Воспроизведение субтитров</h4>",
  "_STEP_7_1_1_CLASSIFICATION_7_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where ICT displays video with synchronized audio, it shall have a mode of operation to display the available captions. Where closed captions are provided as part of the content, the ICT shall allow the user to choose to display the captions.</p><p>NOTE 1: Captions may contain information about timing, colour and positioning. This caption data is necessary for caption users. Timing is used for caption synchronization. Colour can be used for speaker identification. Position can be used to avoid obscuring important information.</p><p>NOTE 2: If a Braille device is connected, the ICT should provide an option to display captions on the Braille device.</p></div></div>"
}