{
  "_STEP_12_2_2_NAME_": "Technischer Support",
  "_STEP_12_2_2_WHAT_CHECKED_1_": "<p>Wird ein technischer Support (etwa über Telefon, Mail oder Chat) angeboten, so soll dieser Informationen zu Barrierefreiheitsfunktionen des Webangebots und Kompatibilität zu assistiven Technologien bereitstellen können. Die Informationen dazu sollen mindestens so umfassend sein wie in der Dokumentation des Webangebots (siehe auch Prüfschritt 12.1.1 \"Dokumentation von Kompatibilität und Barrierefreiheit\" ).</p>",
  "_STEP_12_2_2_WHY_CHECKED_1_": "<p>Hinweise zu Barrierefreiheits-Funktionen sind nicht immer verständlich genug. Hinweise zur Hilfsmittel-Kompatibilität können schnell veraltet sein. Es ist wichtig, dass der technische Support auf Kunden-Fragen eingehen und Hilfe bereitstellen kann.</p>",
  "_STEP_12_2_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_12_2_2_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn das Webangebot (meist eine Web-Anwendung)</p>",
  "_STEP_12_2_2_HOW_CHECKED_3_": "<ul><li><p>technische Dokumentation für das Webangebot anbietet, und</p></li><li><p>Barrierefreiheits-Funktionen und Hinweise auf Hilfsmittel-Kompatibilität in dieser Dokumentation eingeschlossen sind.</p></li></ul>",
  "_STEP_12_2_2_HOW_CHECKED_4_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_12_2_2_HOW_CHECKED_5_": "<ol><li><p>Den technischen Support kontaktieren und stichprobenartig Fragen zu den in der Dokumentation genannten Barrierefreiheits-Funktionen oder zur Hilfsmittel-Kompatibilität stellen.</p></li><li><p>Ist der technische Support in der Lage, mündlich oder schriftlich zusätzliche Informationen und Hilfestellungen zu geben?</p></li></ol>",
  "_STEP_12_2_2_HOW_CHECKED_6_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_12_2_2_HOW_CHECKED_7_": "<p>Der Prüfschritt bewertet nicht die Qualität der übermittelten Information und auch nicht die Zugänglichkeit von übersandten Dokumenten. Er prüft lediglich, ob der technische Support des Anbieters darauf eingerichtet ist, mit weitergehenden Fragen zu Barrierefreiheits-Funktionen oder Hilfsmittel-Kompatibilität umzugehen.</p>",
  "_STEP_12_2_2_HOW_CHECKED_8_": "<p>Ein allgemeiner Kontakt zum Anbieter des Webangebots wird im Sinne des Prüfschritts noch nicht als Support verstanden. Es sollte sich um einen technischen Support handeln, dies sollte aus der Formulierung des Kontakts hervorgehen (z. B. \"Technischer Support\", \"Support\", \"Hilfe bei technischen Fragen\" oder ähnliches).</p>",
  "_STEP_12_2_2_HOW_CHECKED_9_": "<p>Wie dieser Prüfschritt in der Praxis getestet werden kann, ist noch nicht vollständig geklärt. Hinweise dazu können Sie in einem GitHub <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">Issue hinterlassen</a>.</p>",
  "_STEP_12_2_2_SOURCES_1_": "<ul><li><p>Zurzeit keine Quellen.</p></li></ul>",
  "_STEP_12_2_2_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Abgrenzung zu anderen Prüfschritten</h3>",
  "_STEP_12_2_2_CLASSIFICATION_2_": "<p>In diesem Prüfschritt wird ermittelt, ob der technische Support zu dokumentierten Barrierefreiheits-Funktionen oder zur Hilfsmittel-Kompatibilität weitere Informationen liefern kann. Davon ist abzugrenzen:</p>",
  "_STEP_12_2_2_CLASSIFICATION_3_": "<ul><li><p>Der Prüfschritt 12.2.3 \"Effektive Kommunikation\" prüft, ob mit dem technischen Support auf verschiedene Weise kommuniziert werfen kann (z.B. per Telefon, Kontaktformular, E-Mail oder Chat).</p></li><li><p>Der Prüfschritt 12.2.4 \"Vom Support bereitgestellte Dokumentation\" prüft die Barrierefreiheit der vom Support bereitgestellten web-basierten Dokumentation.</p></li></ul>",
  "_STEP_12_2_2_CLASSIFICATION_4_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Einordnung des Prüfschritts nach EN 301 549 V3.2.1</h3>",
  "_STEP_12_2_2_CLASSIFICATION_5_": "<h4 id=\"_12_2_2_information_on_accessibility_and_compatibility_features\">12.2.2 Information on accessibility and compatibility features</h4>",
  "_STEP_12_2_2_CLASSIFICATION_6_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>ICT support services shall provide information on the accessibility and compatibility features that are mentioned in the product documentation.</p><p>NOTE: Accessibility and compatibility features include accessibility features that are built-in and accessibility features that provide compatibility with assistive technology.</p></div></div>"
}