{

  "_STEP_12_2_2_NAME_": "Техническая поддержка",
  "_STEP_12_2_2_NAME_MENU_": "12.2.2 Техническая поддержка",
  "_STEP_12_2_2_WHAT_CHECKED_1_": "<p>Если веб-приложение включает техническую поддержку (например, по телефону, почте или чату), она должна предоставлять информацию о функциях доступности веб-приложения и совместимости с вспомогательными технологиями. Информация должна быть по крайней мере такой же полной, как и в документации веб-приложения (см. также шаг проверки 12.1.1 \"Документация совместимости и доступности\").</p>",
  "_STEP_12_2_2_WHY_CHECKED_1_": "<p>Сведения о функциях доступности не всегда достаточно понятны. Сведения о совместимости с вспомогательными технологиями могут быстро устаревать. Важно, чтобы техническая поддержка могла отвечать на вопросы клиентов и предоставлять помощь.</p>",
  "_STEP_12_2_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_12_2_2_HOW_CHECKED_2_": "<p>Этап проверки применим, если веб-приложение (чаще всего веб-приложение)</p>",
  "_STEP_12_2_2_HOW_CHECKED_3_": "<ul><li><p>предлагает техническую документацию для веб-приложения, и</p></li><li><p>функции доступности и сведения о совместимости с вспомогательными технологиями включены в эту документацию.</p></li></ul>",
  "_STEP_12_2_2_HOW_CHECKED_4_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_12_2_2_HOW_CHECKED_5_": "<ol><li><p>Связаться с технической поддержкой и задать выборочные вопросы о функциях доступности или совместимости с вспомогательными технологиями, упомянутых в документации.</p></li><li><p>Способна ли техническая поддержка устно или письменно предоставить дополнительную информацию и помощь?</p></li></ol>",
  "_STEP_12_2_2_HOW_CHECKED_6_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_12_2_2_HOW_CHECKED_7_": "<p>Этап проверки не оценивает качество предоставленной информации и доступность предоставленных документов. Он лишь проверяет, готова ли техническая поддержка поставщика обращаться с более сложными вопросами о функциях доступности или совместимости с вспомогательными технологиями.</p>",
  "_STEP_12_2_2_HOW_CHECKED_8_": "<p>Общий контакт с поставщиком веб-приложения в смысле этапа проверки еще не понимается как поддержка. Это должна быть техническая поддержка, что должно следовать из формулировки контакта (например, 'Техническая поддержка', 'Поддержка', 'Помощь по техническим вопросам' или что-то подобное).</p>",
  "_STEP_12_2_2_HOW_CHECKED_9_": "<p>Как этот этап проверки может быть протестирован на практике, еще не полностью ясно. Вы можете оставить свои замечания в GitHub <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">Issue</a>.</p>",
  "_STEP_12_2_2_SOURCES_1_": "<ul><li><p>На данный момент нет источников.</p></li></ul>",
  "_STEP_12_2_2_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Различие с другими этапами проверки</h3>",
  "_STEP_12_2_2_CLASSIFICATION_2_": "<p>В этом этапе проверки определяется, может ли техническая поддержка предоставить дополнительную информацию о документированных функциях доступности или совместимости с вспомогательными технологиями. Это следует отличать от:</p>",
  "_STEP_12_2_2_CLASSIFICATION_3_": "<ul><li><p>Этап проверки 12.2.3 'Эффективная коммуникация' проверяет, можно ли общаться с технической поддержкой различными способами (например, по телефону, через контактную форму, по электронной почте или через чат).</p></li><li><p>Этап проверки 12.2.4 'Документация, предоставляемая поддержкой' проверяет доступность веб-базированной документации, предоставляемой поддержкой.</p></li></ul>",
  "_STEP_12_2_2_CLASSIFICATION_4_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки согласно EN 301 549 V3.2.1</h3>",
  "_STEP_12_2_2_CLASSIFICATION_5_": "<h4 id=\"_12_2_2_information_on_accessibility_and_compatibility_features\">12.2.2 Информация о функциях доступности и совместимости</h4>",
  "_STEP_12_2_2_CLASSIFICATION_6_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>ICT support services shall provide information on the accessibility and compatibility features that are mentioned in the product documentation.</p><p>NOTE: Accessibility and compatibility features include accessibility features that are built-in and accessibility features that provide compatibility with assistive technology.</p></div></div>"
}