{
  "_STEP_9_2_4_6_NAME_": "Aussagekräftige Überschriften und Beschriftungen",
  "_STEP_9_2_4_6_WHAT_CHECKED_1_": "<p>Überschriften beschreiben den folgenden Inhalt, Beschriftungen sind aussagekräftig.</p>",
  "_STEP_9_2_4_6_WHY_CHECKED_1_": "<p>Visuell werden Webseiten-Inhalte durch Überschriften strukturiert. Dank dieser Strukturierung wissen Nutzende, was zusammengehört, können die Inhalte der Webseite leicht überblicken und gezielt auf Inhalte zugreifen, die sie interessieren.</p>",
  "_STEP_9_2_4_6_WHY_CHECKED_2_": "<p>Wenn Formularelemente aussagekräftig beschriftet sind, können Sie von Nutzenden als solche erkannt und bedient werden.</p>",
  "_STEP_9_2_4_6_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_2_4_6_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn es auf der Seite Inhalte gibt, die durch Überschriften strukturiert werden und wenn die Seite Formularelemente enthält.</p>",
  "_STEP_9_2_4_6_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_2_4_6_HOW_CHECKED_4_": "<ol><li><p>Seite im <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\"> Firefox</a> laden.</p></li><li><p>Prüfen, ob die Überschriften im Zusammenhang mit den durch sie strukturierten Inhalten aussagekräftig sind.</p></li><li><p>Prüfen, ob Beschriftungen von Formularelementen aussagekräftig sind.</p></li><li><p>Prüfen, ob programmatisch hinterlegte Beschriftungen aussagekräftig sind - etwa bei visuellen Linktexten, die mittels <code>aria-label</code> überschrieben werden, und hinterlegte Beschriftungen von grafischen Bedienelementen. Dazu gehört auch die Nutzung der richtigen Sprache.</p></li><li><p>Wenn zur Gruppen-Beschriftung <code>fieldset</code> mit <code>legend</code> eingesetzt wird: Ist die Ausgabe von <code>legend</code> und <code>label</code> im Zusammenhang aussagekräftig?</p></li></ol>",
  "_STEP_9_2_4_6_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_9_2_4_6_HOW_CHECKED_6_": "<h4 id=\"_3_1_hinweise_zu_fachausdrücken\">3.1 Hinweise zu Fachausdrücken</h4>",
  "_STEP_9_2_4_6_HOW_CHECKED_7_": "<p>Besonders in Fachanwendungen gibt es häufiger Beschriftungen und Überschriften mit Fachausdrücken, Abkürzungen oder Codes, die nicht allgemeinverständlich sind, aber der Zielgruppe bekannt sind. Die Verwendung diese Fachausdrücke bringt Vorteile mit sich (Wiedererkennbarkeit, Präzision, Kürze), kann aber auch dazu führen, dass sie nicht allgemein aussagekräftig sind: sie müssen erlernt werden. Das ist bei Fachanwendungen vertretbar und sollte nicht zu einer negativen Bewertung führen.</p>",
  "_STEP_9_2_4_6_HOW_CHECKED_8_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_9_2_4_6_HOW_CHECKED_9_": "<h4 id=\"_erfüllt\">Erfüllt:</h4>",
  "_STEP_9_2_4_6_HOW_CHECKED_10_": "<ul><li><p>Überschriften passen zu den ihnen folgenden Inhalten, Beschriftungen von Formularelementen sind aussagekräftig.</p></li></ul>",
  "_STEP_9_2_4_6_HOW_CHECKED_11_": "<h4 id=\"_nicht_voll_erfüllt\">Nicht voll erfüllt:</h4>",
  "_STEP_9_2_4_6_HOW_CHECKED_12_": "<ul><li><p>Überschriften oder Beschriftungen sind obskur oder schwer verständlich (z.B. unübersetzt)</p></li><li><p>Durch Flüchtigkeits- oder Kopierfehler haben Formularelemente unrichtige, nicht zutreffende Beschriftungen</p></li><li><p>Bestimmte Eingabeformate sind für valide Eingaben erforderlich, werden aber nicht über zusätzliche Beschriftungen vermittelt</p></li><li><p>Besonders in Fachanwendungen gibt es Labels und Überschriften, die in dem betreffenden Nutzerkreis bestimmten, etablierten Vokabularen entsprechen (einschließlich viel genutzter Abkürzungen). Die Verwendung fachspezifischer Beschriftungen bringt Vorteile mit sich (Wiedererkennbarkeit, Präzision, Kürze), kann aber auch dazu führen, dass sie nicht unbedingt für jeden aussagekräftig oder anschaulich sind, was aber nicht zu einer negativen Bewertung führen soll.</p></li><li><p>Bei Angeboten, die Komponenten aus Frameworks einsetzen, finden sich häufig englischsprachige hinterlegte Beschriftungen, die nicht übersetzt wurden, etwa ein Schließen-Icon mit <code>aria-label=\"close\"</code>. In solchen Fällen kann der Prüfschritt 9.1.1.1a \"Alternativtexte für Bedienelemente\" mit \"erfüllt\" bewertet werden, der Mangel liegt in der mangelnden Aussagekraft, die hier bewertet wird.</p></li></ul>",
  "_STEP_9_2_4_6_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_von_anderen_prüfschritten\">Abgrenzung von anderen Prüfschritten</h3>",
  "_STEP_9_2_4_6_CLASSIFICATION_2_": "<ul><li><p>In diesem Prüfschritt geht es um die Aussagekraft von Überschriften und Beschriftungen, auch wenn diese visuell versteckt sind. Die programmatische Ermittelbarkeit durch Assistive Technologien ist den Prüfkriterien 9.1.3.1a \"HTML-Strukturelemente für Überschriften\" und 9.1.3.1h \"Beschriftung von Formularelementen programmatisch ermittelbar\" zugeordnet.</p></li><li><p>Alternativtexte von Bildern, etwa Teaser-Grafiken (Vorschaubildern) werden in Prüfschritt <a href=\"9.1.1.1a Alternativtexte für Bedienelemente.html\">9.1.1.1a Alternativtexte für Bedienelemente.adoc</a> bewertet. Hier wird nur die Aussagekraft hinterlegter Beschriftungen von grafischen Bedienelementen bzw. Icons bewertet, falls <strong>überhaupt</strong> eine Beschriftung vorhanden ist. Ist bei grafischen Bedienelementen <strong>keine</strong> programmatisch ermittelbare Beschriftung vorhanden, ist dies bei 9.1.1.1a zu bewerten.</p></li></ul>",
  "_STEP_9_2_4_6_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_2_4_6_CLASSIFICATION_4_": "<h4 id=\"_guideline\">Guideline</h4>",
  "_STEP_9_2_4_6_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#navigable\"> Guideline 2.4 Navigable: Provide ways to help users navigate, find content, and determine where they are.</a></p></li></ul>",
  "_STEP_9_2_4_6_CLASSIFICATION_6_": "<h4 id=\"_success_criterion\">Success criterion</h4>",
  "_STEP_9_2_4_6_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#headings-and-labels\"> 2.4.6 Headings and Labels</a> (Level A)</p></li></ul>",
  "_STEP_9_2_4_6_CLASSIFICATION_8_": "<h4 id=\"_techniques\">Techniques</h4>",
  "_STEP_9_2_4_6_CLASSIFICATION_9_": "<h5 id=\"_general_techniques\">General Techniques</h5>",
  "_STEP_9_2_4_6_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G130.html\"> G130: Providing descriptive headings</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G131.html\"> G131: Providing descriptive labels</a></p></li></ul>"
}
