{
  "_STEP_9_1_2_3_NAME_": "Audiodeskription oder Volltext-Alternative für Videos",
  "_STEP_9_1_2_3_WHAT_CHECKED_1_": "<p>Für informationstragende visuelle Videoinhalte muss eine Audiodeskription oder Volltext-Alternative bereitgestellt werden.</p>",
  "_STEP_9_1_2_3_WHY_CHECKED_1_": "<p>Die Handlung von Videos kann oft auch ohne Bild recht gut verfolgt werden. Den Sprecher einer Nachrichtensendung muss man zum Beispiel nicht sehen, um zu verstehen, worum es geht.</p>",
  "_STEP_9_1_2_3_WHY_CHECKED_2_": "<p>Spielfilme und Reportagen enthalten dagegen oft Passagen, in denen wenig gesprochen wird und Inhalte über das Bild vermittelt werden. Blinden oder seheingeschränkten Menschen kann der Zugang zu solchen Videos über eine der beiden Umsetzungen ermöglicht werden:</p>",
  "_STEP_9_1_2_3_WHY_CHECKED_3_": "<ol><li><p>Es wird das Verfahren der Audiodeskription eingesetzt: In den vorhandener Dialogpausen werden Passagen beschrieben, die Inhalte nur über Bilder vermitteln und die nicht in der Haupttonspur enthalten sind.</p></li><li><p>Alternativ wird eine Volltext-Alternative angeboten: Alle Informationen werden in Textform bereitgestellt. Im Gegensatz zur Audiodeskription beschränkt sich die Beschreibung des Videoteils nicht nur auf die Pausen im vorhandenen Dialog. Es werden vollständige Beschreibungen aller visuellen Informationen bereitgestellt, einschließlich des visuellen Kontexts, der Handlungen und Ausdrücke der Schauspieler. Darüber hinaus werden nichtsprachliche Geräusche (Lachen, Stimmen aus dem Off usw.) beschrieben, und es werden Transkripte aller Dialoge mitgeliefert.</p></li></ol>",
  "_STEP_9_1_2_3_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_1_2_3_HOW_CHECKED_2_": "<ul><li><p>Der Prüfschritt ist anwendbar, wenn Videos mit synchroner Bild- und Tonspur vorhanden sind und Informationen über das Bildgeschehen für das Verständnis erforderlich sind.</p></li><li><p>Videos brauchen keine Audiodeskription oder Volltext-Alternative, wenn der Fortgang des Bildgeschehens nicht in Worte gefasst werden kann. Der Prüfschritt ist dann nicht anwendbar.</p></li><li><p>Verzichtbar ist die Audiodeskription oder Volltext-Alternative, wenn die synchrone Wahrnehmung von Bild und Ton für das Verständnis des Videos nicht erforderlich ist oder   wenn das Video keine Tonspur hat (siehe Prüfschritt 9.1.2.1 \"Alternativen für Audiodateien und stumme Videos\").</p></li><li><p>Verzichtbar ist die Audiodeskription oder Volltext-Alternative auch für Videos, die lediglich als Medienalternative zu einem textbasierten Inhalt dienen, das heißt ergänzend zu einem Text angeboten werden, um den Textinhalt zusätzlich in anderer Form zu vermitteln. Dies gilt nur für Videos, die keine über den Textinhalt hinausgehende Informationen bieten und die klar als Medienalternative zum Text erkennbar sind.</p></li><li><p>Gebärdensprachvideos brauchen keine Audiodeskription.</p></li></ul>",
  "_STEP_9_1_2_3_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_1_2_3_HOW_CHECKED_4_": "<h4 id=\"_2_1_audiodeskription_prüfen\">2.1 Audiodeskription prüfen</h4>",
  "_STEP_9_1_2_3_HOW_CHECKED_5_": "<p>Es wird eine Sicht- und Hörprüfung vorgenommen:</p>",
  "_STEP_9_1_2_3_HOW_CHECKED_6_": "<ol><li><p>Art der Einbindung feststellen. Die Audiodeskription kann auf verschiedenem Wege angeboten werden:</p><ul><li><p>Die Audiodeskription ist bereits in der normalen Tonspur enthalten.</p></li><li><p>Eine weitere Version des Videos mit Audiodeskription wird angeboten. Diese Version wird geprüft. Ein funktionierender Link zu dieser Version muss im unmittelbaren Kontext des Videos angeboten werden, ebenso wie ein Zurück-Link (oder das Zurückspringen funktioniert über den Zurück-Button des Browsers).</p></li><li><p>Das Video hat eine zuschaltbare Tonspur mit der Audiodeskription. Diese Spur wird zusätzlich geschaltet.</p></li></ul></li><li><p>Das Video im auf der Website eingebundenen Player abspielen.</p></li><li><p>Wenn eine Audiodeskription vorhanden ist, wird eine kurze Sequenz der Deskription angehört, um stichprobenartig festzustellen, ob sie nutzbar ist.</p></li><li><p>Gibt es wichtige informationstragende Bildinhalte, die nicht in der Tonspur auftauchen und für die es keine zusätzliche Audiodeskription gibt?</p></li></ol>",
  "_STEP_9_1_2_3_HOW_CHECKED_7_": "<h4 id=\"_2_2_volltextalternative_prüfen\">2.2 Volltextalternative prüfen</h4>",
  "_STEP_9_1_2_3_HOW_CHECKED_8_": "<p>Es wird eine Sicht- und Hörprüfung vorgenommen:</p>",
  "_STEP_9_1_2_3_HOW_CHECKED_9_": "<ol><li><p>Das Video im auf der Website eingebundenen Player abspielen.</p></li><li><p>Volltextalternative prüfen, diese sollte folgende Informationen enthalten:</p><ul><li><p>Eine fortlaufende Beschreibung des Geschehens</p></li><li><p>Alle visuellen Information, eingeschlossen Beschreibungen des visuellen Kontexts, Aktionen und der Ausdruck der Schauspieler.</p></li><li><p>Geräusche (Gelächter, off-Screen-Stimmen etc.)</p></li><li><p>Transkriptionen aller Dialoge</p></li></ul></li><li><p>Prüfen, ob die Abfolge der Beschreibung und Dialoge der Abfolge im Video entsprechen.</p></li><li><p>Falls interaktive Elemente vorkommen (z. B. „Aktivieren Sie jetzt, um die Frage zu beantworten“), sollte die Volltextalternative Links oder ähnliches vorsehen, um dieselbe Funktionalität zu gewährleisten.</p></li></ol>",
  "_STEP_9_1_2_3_HOW_CHECKED_10_": "<h3 id=\"_3_hinweis\">3. Hinweis</h3>",
  "_STEP_9_1_2_3_HOW_CHECKED_11_": "<p>Die Anforderung 9.1.2.3 Audiodeskription oder Volltextalternative ist in den WCAG der Konformitätsstufe A zugeordnet. Auf Konformitätstufe AA gibt es ein Erfolgskriterium, das  die Volltext-Alternative nicht akzeptiert. Der BITV-Test prüft dieses Erfolgskriterium der Stufe AA im Prüfschritt 9.1.2.5 Audiodeskription für Videos</p>",
  "_STEP_9_1_2_3_HOW_CHECKED_12_": "<p>Bietet die Website eine Volltextalternative, so ist zwar 9.1.2.3 (A) erfüllt, nicht aber 9.1.2.5 (AA). Da der BITV-Test Konformität auf Stufe AA prüft, wird dann die Seite in der Auswertung des Tests als \"nicht konform\" bewertet. Eine Audiodeskription ist also für eine konforme Bewertung der Seite im BITV-Test gefordert, sofern der Prüfschritt anwendbar ist.</p>",
  "_STEP_9_1_2_3_HOW_CHECKED_13_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_9_1_2_3_HOW_CHECKED_14_": "<h4 id=\"_nicht_voll_erfüllt\">Nicht voll erfüllt</h4>",
  "_STEP_9_1_2_3_HOW_CHECKED_15_": "<p>Es wird keine Audiodeskription angeboten, informationstragende Bildinhalte sind nicht vollständig in der angebotenen Volltextalternative enthalten.</p>",
  "_STEP_9_1_2_3_HOW_CHECKED_16_": "<h4 id=\"_nicht_erfüllt\">Nicht erfüllt</h4>",
  "_STEP_9_1_2_3_HOW_CHECKED_17_": "<p>Das informationstragende, visuelle Video hat weder eine Audiodeskription noch eine Volltextalternative.</p>",
  "_STEP_9_1_2_3_HOW_CHECKED_18_": "<h4 id=\"_abwertung_des_gesamtergebnisses\">Abwertung des Gesamtergebnisses</h4>",
  "_STEP_9_1_2_3_HOW_CHECKED_19_": "<p>Die Abwertung ist erforderlich, wenn Bildinhalte eines Videos ohne Audiodeskription für die Nutzung des Webauftritts von zentraler Bedeutung sind: der Webauftritt kann wegen Unzugänglichkeit des Videos von blinden oder sehbehinderten Menschen nicht genutzt werden.</p>",
  "_STEP_9_1_2_3_SOURCES_1_": "<h3 id=\"_bik_für_alle_leitfaden_barrierefreie_online_videos\">BIK für Alle: Leitfaden barrierefreie Online-Videos</h3>",
  "_STEP_9_1_2_3_SOURCES_2_": "<ul><li><p><a href=\"http://www.bik-fuer-alle.de/fuer-webentwickler-einbindung-in-die-internetseite.html\">   Für Webentwickler: Einbindung in die Internetseite</a><br> Hinweise zur Wahl von Mediaelementen.</p></li><li><p><a href=\"http://www.bik-fuer-alle.de/audiodeskription.html\"> Audiodeskription</a></p></li></ul>",
  "_STEP_9_1_2_3_SOURCES_3_": "<h3 id=\"_blogartikel_von_sprungmarker_zur_barrierefreiheit_von_media_playern_stand_092014\">Blogartikel von 'Sprungmarker' zur Barrierefreiheit von Media-Playern (Stand 09/2014):</h3>",
  "_STEP_9_1_2_3_SOURCES_4_": "<ul><li><p><a href=\"http://sprungmarker.de/2010/barrierefreiheit_mediaplayer_eine_kurzuebersicht/\"> Barrierefreiheit &amp; Media Player: eine Kurzübersicht - Teil 1</a></p></li></ul>",
  "_STEP_9_1_2_3_SOURCES_5_": "<h3 id=\"_blogartikel_von_terrill_thompson_zu_audio_description_stand_032017\">Blogartikel von Terrill Thompson zu Audio Description (Stand 03/2017):</h3>",
  "_STEP_9_1_2_3_SOURCES_6_": "<ul><li><p><a href=\"http://terrillthompson.com/blog/813\"> My Audio Description Talk @ CSUN</a></p></li></ul>",
  "_STEP_9_1_2_3_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_1_2_3_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Guideline</h4>",
  "_STEP_9_1_2_3_CLASSIFICATION_3_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#time-based-media\"> Guideline 1.2 Time-based Media: Provide alternatives for time-based media</a></p></li></ul>",
  "_STEP_9_1_2_3_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Success criterion</h4>",
  "_STEP_9_1_2_3_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#audio-description-or-media-alternative-prerecorded\"> 1.2.3 Audio Description or Media Alternative (Prerecorded)</a> (Level A)</p></li></ul>",
  "_STEP_9_1_2_3_CLASSIFICATION_6_": "<h4 id=\"_techniques\">Techniques</h4>",
  "_STEP_9_1_2_3_CLASSIFICATION_7_": "<h5 id=\"_general_techniques\">General Techniques</h5>",
  "_STEP_9_1_2_3_CLASSIFICATION_8_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G58\"> G58: Placing a link to the alternative for time-based media immediately next to the non-text content</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G69\"> G69: Providing an alternative for time based media</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G78\"> G78: Providing a second, user-selectable, audio track that includes audio descriptions</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G173\"> G173: Providing a version of a movie with audio descriptions</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G203\"> G203: Using a static text alternative to describe a talking head video</a></p></li></ul>",
  "_STEP_9_1_2_3_CLASSIFICATION_9_": "<h5 id=\"_smil_techniques\">SMIL Techniques</h5>",
  "_STEP_9_1_2_3_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/smil/SM1\"> SM1: Adding extended audio description in SMIL 1.0</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/smil/SM2\"> SM2: Adding extended audio description in SMIL 2.0</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/smil/SM6\"> SM6: Providing audio description in SMIL 1.0</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/smil/SM7\"> SM7: Providing audio description in SMIL 2.0</a></p></li></ul>",
  "_STEP_9_1_2_3_QUESTIONS_1_": "<h3 id=\"_was_sind_wichtige_informationstragende_bildinhalte\">Was sind \"wichtige informationstragende Bildinhalte\"?</h3>",
  "_STEP_9_1_2_3_QUESTIONS_2_": "<ul><li><p>Sehr häufig tauchen in Videos eingeblendete Texte auf, die etwa Sprecher oder Sprecherin bzw. deren Rolle benennen. Ohne diese Information ist für nicht-visuelle Nutzer unklar, wer da eigentlich spricht oder interviewt wird. Wenn es eher unwichtig ist, wie die Person heißt, die spricht (z.B. in Passantenbefragungen) sind solche Einblendungen nicht als \"wichtige informationstragende Bildinhalte\" zu betrachten.</p></li><li><p>Oft sind Videos auch über visuelle Zwischentitel oder eingeblendete Fragen strukturiert. Hier ist zu prüfen, inwieweit die Informationen auch ohne Audiodeskription oder Transkription der Bildinhalte sinnvoll und verständlich sind - zum Beispiel weil ein Sprecherton in der Folge ausreichend Kontext liefert.</p></li></ul>"
}