{
  "_STEP_6_2_1_1_NAME_": "Текстовая коммуникация в реальном времени",
  "_STEP_6_2_1_1_NAME_MENU_": "6.2.1.1 Текстовая коммуникация в реальном времени",
  "_STEP_6_2_1_1_WHAT_CHECKED_1_": "<p>Если веб-приложение позволяет двустороннюю коммуникацию (связь в обе стороны, например, голосовая и видеотелефония), оно также должно предоставлять текстовую коммуникацию в реальном времени (RTT, Real-Time Text). Реальное время здесь означает, что уже ввод каждого символа передается и отображается получателю. Пользователям не нужно специально отправлять введенный текст.</p>",
  "_STEP_6_2_1_1_WHY_CHECKED_1_": "<p>Люди, которые не могут или не хотят использовать голос, должны иметь возможность участвовать в коммуникации на равных правах с помощью текстовой коммуникации в реальном времени (RTT, Real-Time Text).</p>",
  "_STEP_6_2_1_1_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_6_2_1_1_HOW_CHECKED_2_": "<p>Этап проверки применим, если предлагаемое веб-приложение позволяет двустороннюю коммуникацию. Это включает, например, веб-базированную голосовую и видеотелефонию.</p>",
  "_STEP_6_2_1_1_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_6_2_1_1_HOW_CHECKED_4_": "<ol><li><p>Открыть веб-приложение.</p></li><li><p>Если предлагается функция двусторонней коммуникации, проверить, поддерживается ли также текстовая коммуникация в реальном времени (RTT, Real-time Text).</p></li></ol>",
  "_STEP_6_2_1_1_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Примечания</h3>",
  "_STEP_6_2_1_1_HOW_CHECKED_6_": "<p>При текстовой коммуникации в реальном времени (RTT, Real-Time Text) текст появляется у получателя динамично во время ввода отправителем. RTT не то же самое, что чат, где сообщения явно отправляются и только потом появляются у получателя.</p>",
  "_STEP_6_2_1_1_SOURCES_1_": "<ul><li><p><a href=\"https://labs.etsi.org/rep/HF/en301549/uploads/272bede3724c5c99efe777f778201f70/tr_103708v010101p.pdf\">Human Factors (HF); Real-Time Text (RTT) in Multiparty Conference Calling / ETSI TR 103 708 V1.1.1 (2022-08)</a></p></li><li><p><a href=\"https://medevel.com/free-tts/\">11 More Free Open-source Text-To-Speech Apps</a> (MEDevel.com: Open-source Guide to Healthcare and Medical Software)</p></li><li><p><a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Web_Speech_API\">Web Speech API</a> (Mozilla Foundation, mdm web docs)</p></li><li><p><a href=\"https://www.rfc-editor.org/rfc/rfc8865.pdf\">RFC 8865 T.140 Real-Time Text Conversation over WebRTC Data Channels (PDF)</a></p></li><li><p><a href=\"https://w3c.github.io/webrtc-pc/\">WebRTC 1.0: Real-Time Communication Between Browsers.</a> W3C Editor’s Draft 06 February 2023</p></li></ul>",
  "_STEP_6_2_1_1_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_6_2_1_1_CLASSIFICATION_2_": "<h4 id=\"_6_2_1_1_rtt_communication\">6.2.1.1 Коммуникация RTT</h4>",
  "_STEP_6_2_1_1_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where ICT is in a mode that provides a means for two-way voice communication, the ICT shall provide a means for two-way RTT communication, except where this would require design changes to add input or output hardware to the ICT.</p><p>NOTE 1: This requirement includes those products which do not have physical display or text entry capabilities but have the capability to connect to devices that do have such capabilities. It also includes intermediate ICT between the endpoints of the communication.</p><p>NOTE 2: There is no requirement to add: a hardware display, a hardware keyboard, or hardware to support the ability to connect to a display or keyboard, wired or wirelessly, if this hardware would not normally be provided.</p><p>NOTE 3: For the purposes of interoperability, support of Recommendation ITU-T T.140 [i.36] is widely used.</p></div></div>"
}