{
  "_STEP_9_1_4_3_NAME_": "Kontraste von Texten ausreichend",
  "_STEP_9_1_4_3_NAME_MENU_": "9.1.4.3 Kontraste von Texten ausreichend",
  "_STEP_9_1_4_3_WHAT_CHECKED_1_": "<p>Alle Texte der Seite sollen in allen Zuständen ausreichende Helligkeitskontraste haben.</p>",
  "_STEP_9_1_4_3_WHY_CHECKED_1_": "<p>Wenn Vordergrund- und Hintergrundfarbe sich in der Helligkeit ähneln, haben Texte unter Umständen zu wenig Kontrast. Gute Kontraste sorgen dafür, dass Nutzende Texte leichter lesen können. Insbesondere Menschen, die aufgrund einer verringerten Sehschärfe, einer Farbfehlsichtigkeit oder aufgrund des Alters eine verminderte Kontrastempfindlichkeit haben, profitieren von guten Kontrasten.</p>",
  "_STEP_9_1_4_3_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_1_4_3_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn die Seite Text enthält. Grafische Schriften sind ebenfalls Gegenstand des Prüfschritts.</p>",
  "_STEP_9_1_4_3_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_1_4_3_HOW_CHECKED_4_": "<h4 id=\"_2_1_prüfung_der_textkontraste_der_standardversion\">2.1 Prüfung der Textkontraste der Standardversion</h4>",
  "_STEP_9_1_4_3_HOW_CHECKED_5_": "<h5 id=\"_prüfung_nicht_festgelegter_farben\">Prüfung nicht festgelegter Farben</h5>",
  "_STEP_9_1_4_3_HOW_CHECKED_6_": "<ul><li><p>Über das Bookmarklet <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#vorderhintergrundfarbebm\"> \"Vorder-und Hintergrundfarbe definiert\"</a> oder ein User Stylesheet (<code>html {background-color:black;color:white}</code>) prüfen, ob für jedes Element, für das eine Vordergrundfarbe festgelegt wurde, auch eine Hintergrundfarbe festgelegt ist und umgekehrt.</p></li></ul>",
  "_STEP_9_1_4_3_HOW_CHECKED_7_": "<h5 id=\"_sichtprüfung\">Sichtprüfung</h5>",
  "_STEP_9_1_4_3_HOW_CHECKED_8_": "<ul><li><p>Sind die Schriftkontraste stark genug?</p></li><li><p>Im Zweifel den <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#cca\"> Contrast Analyser</a> öffnen.</p></li><li><p>Im Bereich <em>Vordergrund</em> mit der Pipette die Vordergrundfarbe auswählen, dann im Bereich <em>Hintergrund</em> die Hintergrundfarbe.</p></li><li><p>Falls unklar ist, ob für Schrift der Wert für große Schrift (3:1) oder für kleine Schrift (4,5:1) gilt: In der <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#webdeveloper\"> Web Developer Toolbar</a> die Funktion <em>Informationen &gt; Elementinformationen einblenden</em> aktivieren. Text, der überprüft werden soll, anklicken. Im eingeblendeten Fenster \"Elementinformationen\" im Bereich \"Text\" wird die jeweilige Schriftgröße in Pixeln angegeben. Alternativ über die Firefox Web Developer Tools mit dem Cursor das fragliche Element aktivieren und unterm Reiter <em>Inspektor</em> im Bereich CSS im Tab <em>Berechnet</em> die tatsächliche Schriftgröße (font-size) ablesen.</p></li><li><p>Für Schriftgrößen unter 24 px (beziehungsweise 18,7 px bei fetter Schrift) prüfen, ob das Kontrastverhältnis bei 4,5:1 oder größer liegt.</p></li><li><p>Für große Schriften prüfen, ob das Kontrastverhältnis bei 3:1 oder größer liegt.</p></li></ul>",
  "_STEP_9_1_4_3_HOW_CHECKED_9_": "<h4 id=\"_2_2_styleswitcher_prüfung_prüfung_der_textkontraste_der_alternativen_ansicht\">2.2 Styleswitcher-Prüfung, Prüfung der Textkontraste der alternativen Ansicht</h4>",
  "_STEP_9_1_4_3_HOW_CHECKED_10_": "<p>Wenn die Kontraste der Standardversion nicht die Sollwerte erfüllen und die Seite eine kontrastreichere Ansicht über einen Styleswitcher anbietet:</p>",
  "_STEP_9_1_4_3_HOW_CHECKED_11_": "<ol><li><p>Textkontrast des Styleswitcher-Schaltelements prüfen.</p></li><li><p>Das Kontrastverhältnis muss 4,5:1 oder besser sein, sofern der Schalter mit Hilfe von Text beschriftet ist (bei grafischen Schaltern gilt ein Mindestkontrast von 3,0:1, vergl. Prüfschritt 9.1.4.11). Auch alle anderen Anforderungen müssen erfüllt sein (zum Beispiel Tastaturbedienbarkeit), sonst Prüfung der alternativen Ansicht abbrechen.</p></li><li><p>Alternative kontrastreichere Ansicht über den Styleswitcher aufrufen.</p></li><li><p>Textkontraste der alternativen Ansicht prüfen (wie in <a href=\"#_2_1_prüfung_der_textkontraste_der_standardversion\">2.1 Prüfung der Textkontraste der Standardversion</a>).</p></li></ol>",
  "_STEP_9_1_4_3_HOW_CHECKED_12_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_9_1_4_3_HOW_CHECKED_13_": "<h4 id=\"_3_1_allgemeine_hinweise\">3.1 Allgemeine Hinweise</h4>",
  "_STEP_9_1_4_3_HOW_CHECKED_14_": "<ul><li><p>Elemente, die unterschiedliche Zustände haben können, sollen in allen Zuständen immer ausreichend Kontrast zum Hintergrund haben. So muss auch die Hervorhebung des Maus- bzw. des Tastaturfokus den allgemeinen Kontrast-Grenzwert von 4,5:1 (bei großen Schriften 3,0:1) erfüllen.</p></li><li><p>Schwache Kontraste können zweckmäßig sein, sie können den Umgang mit einer Webseite erleichtern. Ein Beispiel dafür: Funktionen, die prinzipiell vorgesehen, aktuell aber nicht verfügbar sind, werden schwach kontrastierend dargestellt. Das ist akzeptabel, wenn das ausgeblendete Element für die Orientierung und Bedienung nicht erforderlich ist. Der Prüfschritt ist daher auf die Beschriftungen ausgeblendeter, deaktivierter Bedienelemente in der Regel nicht anwendbar</p></li><li><p>Bei Bereichen, die mit Farbwechseln auf den Mauszeiger reagieren, kann ein   Screenshot helfen, den Farbwert im \"Ruhezustand\" zu ermitteln. Alternativ kann man den Fokuszustand über Tastaturbedienung erzeugen und dann   den Kontrast mit der Pipette des Contrast Analyzers messen.</p></li><li><p>Wenn Kontraste dünner Schriften zu prüfen sind, gegebenenfalls Schrift vergrößern und die Schriftenglättung ausschalten.</p></li><li><p>Sollen die Farbwerte sehr kleiner Bereiche (feine Schriften oder kleine Icons) ermittelt werden, ist es unter Umständen einfacher, ein Screenshot zu machen und die leistungsfähigeren Zoom- und Pipettenwerkzeuge eines Bildbearbeitungsprogramms zu nutzen.</p></li><li><p>Der Farbkontrast von Textvorbelegungen von Formularfeldern muss die Mindest-Anforderung von 4,5:1 erfüllen. Ausgenommen sind Textvorbelegungen, wenn eine redundante sichtbare Beschriftung die Kontrastanforderung erfüllt. Als Beschriftung zählt bei Suchfeldern auch ein konventionelles Icon, das die Anforderung für Grafikkontraste erfüllt (vergl. Prüfschritt 9.1.4.11). Wenn zusätzliche Informationen (etwa Datumsformat) im Platzhalter-Text stehen, gilt diese Ausnahme nicht, der Platzhalter-Text muss dann den Kontrast von 4,5:1 erfüllen.</p></li></ul>",
  "_STEP_9_1_4_3_HOW_CHECKED_15_": "<h4 id=\"_3_2_hinweise_zur_prüfung_von_seiten_mit_styleswitcher\">3.2 Hinweise zur Prüfung von Seiten mit Styleswitcher</h4>",
  "_STEP_9_1_4_3_HOW_CHECKED_16_": "<p>Die Kontrastprüfung auf durch Styleswitcher aufgerufenen kontrastreicheren Ansicht erfolgt nur unter folgenden Bedingungen:</p>",
  "_STEP_9_1_4_3_HOW_CHECKED_17_": "<ul><li><p>Das Styleswitcher-Schaltelement (oder der direkte Link zu einer Styleswitcher-Seite) ist deutlich sichtbar am Seitenbeginn platziert.</p></li><li><p>Das Schaltelement hat ein Kontrastverhältnis von mindestens 4.5:1 sofern mit Text beschriftet (bei grafischen Schaltern gilt ein Mindestkontrast von 3,0:1, vergl. Prüfschritt 9.1.4.11). Es erfüllt auch alle anderen Anforderungen an Barrierefreiheit (z. B. Tastaturbedienbarkeit)</p></li><li><p>Die alternative kontrastreichere Ansicht muss dieselben Informationen und dieselbe Funktionalität aufweisen wie die Ausgangsansicht.</p></li></ul>",
  "_STEP_9_1_4_3_HOW_CHECKED_18_": "<h4 id=\"_3_3_hinweise_zur_messung_des_kontrastverhältnisses\">3.3 Hinweise zur Messung des Kontrastverhältnisses</h4>",
  "_STEP_9_1_4_3_HOW_CHECKED_19_": "<ul><li><p>Für die Bewertung zählt das Kontrastverhältnis (<em>relative luminosity</em>) nach einer in den WCAG 2.1 definierten Formel.</p></li><li><p>Die Prüfung der Kontraste für normalen Text und großen Text orientiert sich an den gemessenen Werten der Schriftgröße in Pixel (<a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#webdeveloper\">Web Developer Toolbar</a>, <em>Funktion Elementinformationen einblenden</em>), denn eine Messung der tatsächlich dargestellten Punktgröße auf dem Bildschirm mit einem Typometer ist nicht praktikabel. Bei einer Bildschirmauflösung von 96 dpi entsprechen 18 Punkt etwa 24 Pixeln, 14 Punkt entsprechen etwa 18,7 Pixeln.</p></li><li><p>Die Messung des Pixel-Äquivalents ist dadurch gerechtfertigt, dass die bisher getesteten <em>User Agents</em> die Auszeichnung in Pixel und Punkt analog behandeln (im Verhältnis 4:3), also unabhängig von der Bildschirmauflösung, unter der der Text angezeigt wird. Richtiger wäre es, wenn <em>User Agents</em> die Bildschirmauflösung auswerten würden, um die Ausgabegröße zu berechnen (also mehr Pixel pro Punkt bei höher auflösenden Bildschirmen). Für die Prüfung maßgeblich ist der Referenzwert von 96 dpi Bildschirmauflösung, für den die Entsprechung auf jeden Fall gilt.</p></li></ul>",
  "_STEP_9_1_4_3_HOW_CHECKED_20_": "<h4 id=\"_3_4_hinweise_zu_mangelnden_text_kontrasten_nativer_elemente_in_browsern_z_b_select_datepicker_widgets\">3.4 Hinweise zu mangelnden Text-Kontrasten nativer Elemente in Browsern (z.B. <code>select</code>, datepicker widgets)</h4>",
  "_STEP_9_1_4_3_HOW_CHECKED_21_": "<p>Abhängig vom genutzten Browser sind in manchen Zuständen die Kontrastwerte nicht ausreichend. So wird etwa bei <code>select</code>-Elementen in der Darstellung im Chrome-Browser die jeweils ausgewählte Option durch weiße Schrift auf blauem Hintergrund mit einem Kontrast von nur 3,2:1 dargestellt. Formal gesehen wäre deshalb bei der Verwendung nativer Elemente mit Kontrastmängeln dieser Prüfschritt in manchen Browsern nicht erfüllt.</p>",
  "_STEP_9_1_4_3_HOW_CHECKED_22_": "<p>Autoren haben auf die Darstellung von manchen nativen Elementen und Widgets zurzeit keine ausreichenden Einflussmöglichkeiten, um für guten Kontrast in allen Zuständen zu sorgen. Würden sie deshalb native Elemente durch kontrastreichere Custom-Elemente ersetzen, entstünden ggf. andere Probleme: die korrekte Darstellung ist von JavaScript abhängig, es treten umgebungsabhängig Probleme bei der Nutzung mit Screenreadern auf, der Code ist umfangreicher und dadurch fehleranfälliger, usw. Da die Nutzung nativer Elemente große Vorteile gegenüber dem Einsatz von Custom-Elementen bietet, gilt dieser Prüfschritt deshalb trotzdem als erfüllt, wenn die Kontrast-Mängel ausschließlich auf die Darstellung von nativen Elementen durch den jeweiligen Browser zurückzuführen sind.</p>",
  "_STEP_9_1_4_3_HOW_CHECKED_23_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_9_1_4_3_HOW_CHECKED_24_": "<h4 id=\"_erfüllt\">Erfüllt</h4>",
  "_STEP_9_1_4_3_HOW_CHECKED_25_": "<ul><li><p>Das Kontrastverhältnis (<em>contrast ratio</em>) zwischen Vorder- und Hintergrundfarbe liegt für Texte unter 18 Punkt (beziehungsweise für fette Texte unter 14 Punkt) bei mindestens 4,5:1.</p></li><li><p>Das Kontrastverhältnis (<em>contrast ratio</em>) zwischen Vorder- und Hintergrundfarbe liegt bei Texten in großer Schriftgröße (18 Punkt und größer, 14 Punkt und größer bei fetter Schrift) bei mindestens 3:1.</p></li><li><p>Wenn die Anforderung nur über eine alternative Ansicht erfüllt wird, erfüllt der Styleswicher selbst die Kontrastforderung von 4,5:1 und andere Anforderungen an Barrierefreiheit.</p></li></ul>",
  "_STEP_9_1_4_3_SOURCES_1_": "<h3 id=\"_w3c_zum_zusammenhang_zwischen_px_und_pt\">W3C zum Zusammenhang zwischen <code>px</code> und <code>pt</code></h3>",
  "_STEP_9_1_4_3_SOURCES_2_": "<p><a href=\"https://www.w3.org/TR/css3-values/#absolute-lengths\"> CSS Values and Units Module Level 3: 5.2 Absolute Lengths</a></p>",
  "_STEP_9_1_4_3_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Abgrenzung zu anderen Prüfschritten</h3>",
  "_STEP_9_1_4_3_CLASSIFICATION_2_": "<ul><li><p>Prüfschritt 9.1.4.11 \"Kontraste von Grafiken und grafischen Bedienelementen ausreichend\" behandelt den Kontrast von Grafiken</p></li><li><p>Schriftgrafiken (zur Definition vergleiche auch Prüfschritt 9.1.4.5 \"Verzicht auf Schriftgrafiken\"</p></li></ul>",
  "_STEP_9_1_4_3_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_1_4_3_CLASSIFICATION_4_": "<h4 id=\"_guideline\">Guideline</h4>",
  "_STEP_9_1_4_3_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#distinguishable\"> Guideline 1.4 Distinguishable: Make it easier for users to see and hear content including separating foreground from background</a></p></li></ul>",
  "_STEP_9_1_4_3_CLASSIFICATION_6_": "<h4 id=\"_success_criterion\">Success criterion</h4>",
  "_STEP_9_1_4_3_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#contrast-minimum\"> 1.4.3 Contrast (Minimum)</a> (Level AA)</p></li></ul>",
  "_STEP_9_1_4_3_CLASSIFICATION_8_": "<h4 id=\"_techniques\">Techniques</h4>",
  "_STEP_9_1_4_3_CLASSIFICATION_9_": "<h5 id=\"_general_techniques\">General Techniques</h5>",
  "_STEP_9_1_4_3_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G18.html\"> G18: Ensuring that a contrast ratio of at least 4.5:1 exists between text (and images of text) and background behind the text</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G145.html\"> G145: Ensuring that a contrast ratio of at least 3:1 exists between text (and images of text) and background behind the text</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G148.html\"> G148: Not specifying background color, not specifying text color, and not using technology features that change those defaults</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G174.html\"> G174: Providing a control with a sufficient contrast ratio that allows users to switch to a presentation that uses sufficient contrast</a></p></li></ul>",
  "_STEP_9_1_4_3_CLASSIFICATION_11_": "<h4 id=\"_failures\">Failures</h4>",
  "_STEP_9_1_4_3_CLASSIFICATION_12_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F83.html\"> F83: Failure of Success Criterion 1.4.3 and 1.4.6 due to using background images that do not provide sufficient contrast with foreground text (or images of text)</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F24.html\"> F24: Failure of Success Criterion 1.4.3, 1.4.6 and 1.4.8 due to specifying foreground colors without specifying background colors or vice versa</a></p></li></ul>",
  "_STEP_9_1_4_3_QUESTIONS_1_": "<h3 id=\"_subjektiver_eindruck_bei_kontrastmessungen\">Subjektiver Eindruck bei Kontrastmessungen</h3>",
  "_STEP_9_1_4_3_QUESTIONS_2_": "<p>Das Ergebnis der <a href=\"http://www.w3.org/TR/UNDERSTANDING-WCAG20/visual-audio-contrast-contrast.html#visual-audio-contrast-contrast-69-head\"> WCAG 2.1 Formel zur Messung des Kontrastverhältnisses</a> entspricht oft nicht dem subjektiven Eindruck. Wie zuverlässig ist es?</p>",
  "_STEP_9_1_4_3_QUESTIONS_3_": "<p>Zwei Punkte sind hier zu beachten:</p>",
  "_STEP_9_1_4_3_QUESTIONS_4_": "<p>Der Helligkeitskontrast ist nur einer von drei Einflussgrößen für den Gesamtkontrast. Insofern ist klar, dass das Ergebnis für den Helligkeitskontrast nicht dem subjektiven Eindruck entspricht. Es soll gar nicht dem subjektiven Gesamteindruck entsprechen, denn schließlich geht es darum, ob die Helligkeitsunterschiede der Farben für sich genommen ausreichend kontrastieren. Wenn man normalsichtig ist, entspricht der subjektive Eindruck der Graustufenansicht dagegen schon eher dem Formelergebnis. Farben benachbarter Flächen beeinflussen die Wahrnehmung, kleine und dünne Schriften erscheinen kontrastärmer, es gibt Überstrahleffekte, möglicherweise werden die Kontraste durch Schriftenglättung abgeschwächt. Die Formel berücksichtigt all diese Faktoren nicht. Zumindest wenn es um Texte geht, ist dies auch angemessen. Denn die genannten Einflüsse stehen nicht fest, sie hängen zum Beispiel von der gewählten Schriftgröße ab.</p>",
  "_STEP_9_1_4_3_QUESTIONS_5_": "<p>Für die Prüfung bedeutet das: Wer mit der formelbasierten Bewertung von Helligkeitskontrasten noch keine Erfahrungen hat, kann sich nicht auf seinen subjektiven Eindruck verlassen. Er muss die Formel fast auf alle Farbkombinationen anwenden.</p>"
}
