{
  "_STEP_9_1_4_3_NAME_": "Достаточный контраст текста",
  "_STEP_9_1_4_3_NAME_MENU_": "9.1.4.3 Достаточный контраст текста",
  "_STEP_9_1_4_3_WHAT_CHECKED_1_": "<p>Все тексты на странице должны иметь достаточный уровень контрастности яркости во всех состояниях.</p>",
  "_STEP_9_1_4_3_WHY_CHECKED_1_": "<p>Если цвет переднего плана и фона похожи по яркости, тексты могут иметь недостаточный контраст. Хороший контраст облегчает чтение текстов пользователям, особенно людям с ухудшенным зрением, дальтонизмом или сниженной чувствительностью к контрасту из-за возраста.</p>",
  "_STEP_9_1_4_3_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость проверки</h3>",
  "_STEP_9_1_4_3_HOW_CHECKED_2_": "<p>Этот шаг проверки применим, если на странице присутствует текст. Графические шрифты также являются объектом проверки.</p>",
  "_STEP_9_1_4_3_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_1_4_3_HOW_CHECKED_4_": "<h4 id=\"_2_1_prüfung_der_textkontraste_der_standardversion\">2.1 Проверка контрастности текста стандартной версии</h4>",
  "_STEP_9_1_4_3_HOW_CHECKED_5_": "<h5 id=\"_prüfung_nicht_festgelegter_farben\">Проверка неустановленных цветов</h5>",
  "_STEP_9_1_4_3_HOW_CHECKED_6_": "<ul><li><p>Использование Bookmarklet <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#vorderhintergrundfarbebm\">\"Определённые цвета переднего и заднего плана\"</a> или пользовательского стилевого листа (<code>html {background-color:black;color:white}</code>) для проверки, установлены ли для каждого элемента цвета переднего и заднего плана.</p></li></ul>",
  "_STEP_9_1_4_3_HOW_CHECKED_7_": "<h5 id=\"_sichtprüfung\">Визуальная проверка</h5>",
  "_STEP_9_1_4_3_HOW_CHECKED_8_": "<ul><li><p>Достаточно ли контрастны тексты?</p></li><li><p>В случае сомнений открыть <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#cca\">Contrast Analyser</a>.</p></li><li><p>Выбрать цвет переднего плана в разделе <em>Передний план</em> с помощью пипетки, затем выбрать цвет фона в разделе <em>Фон</em>.</p></li><li><p>Если неясно, применяется ли значение для крупного текста (3:1) или для мелкого текста (4,5:1): использовать функцию <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#webdeveloper\">Web Developer Toolbar</a> <em>Показать информацию элемента</em>. Кликнуть по тексту, который нужно проверить. В появившемся окне \"Информация элемента\" в разделе \"Текст\" будет указан размер шрифта в пикселях. Альтернативно, можно активировать интересующий элемент в инструментах разработчика Firefox и под вкладкой <em>Инспектор</em> в разделе CSS во вкладке <em>Вычислено</em> посмотреть реальный размер шрифта (font-size).</p></li><li><p>Для размеров шрифтов меньше 24 пикселей (или 18,7 пикселей для жирного шрифта) проверить, что контрастность соотношения составляет 4,5:1 или больше.</p></li><li><p>Для крупных шрифтов проверить, что контрастное соотношение составляет 3:1 или больше.</p></li></ul>",
  "_STEP_9_1_4_3_HOW_CHECKED_9_": "<h4 id=\"_2_2_styleswitcher_prüfung_prüfung_der_textkontraste_der_alternativen_ansicht\">2.2 Проверка переключателя стилей, проверка контрастности текста альтернативного вида</h4>",
  "_STEP_9_1_4_3_HOW_CHECKED_10_": "<p>Если контрасты стандартной версии не соответствуют требуемым значениям и страница предлагает контрастный вид через переключатель стилей:</p>",
  "_STEP_9_1_4_3_HOW_CHECKED_11_": "<ol><li><p>Проверить контраст текста элемента управления переключателем стилей.</p></li><li><p>Контрастное соотношение должно быть 4,5:1 или лучше, если элемент управления обозначен текстом (для графических переключателей минимальный контраст 3,0:1, см. шаг проверки 9.1.4.11). Также все другие требования к доступности должны быть выполнены (например, возможность управления с клавиатуры), в противном случае прекратить проверку альтернативного вида.</p></li><li><p>Вызвать контрастный вид через переключатель стилей.</p></li><li><p>Проверить контраст текста альтернативного вида (как в <a href=\"#_2_1_prüfung_der_textkontraste_der_standardversion\">2.1 Проверка контрастности текста стандартной версии</a>).</p></li></ol>",
  "_STEP_9_1_4_3_HOW_CHECKED_12_": "<h3 id=\"_3_hinweise\">3. Советы</h3>",
  "_STEP_9_1_4_3_HOW_CHECKED_13_": "<h4 id=\"_3_1_allgemeine_hinweise\">3.1 Общие советы</h4>",
  "_STEP_9_1_4_3_HOW_CHECKED_14_": "<ul><li><p>Элементы, которые могут иметь разные состояния, должны всегда иметь достаточный контраст с фоном во всех состояниях. Так, выделение фокуса мыши или клавиатуры также должно соответствовать общему порогу контраста 4,5:1 (для крупного текста 3,0:1).</p></li><li><p>Слабые контрасты могут быть целесообразными, они могут упростить использование веб-сайта. Например, функции, которые принципиально предусмотрены, но в настоящее время недоступны, отображаются с низким контрастом. Это приемлемо, если неактивный элемент не требуется для ориентации и управления. Поэтому этот шаг проверки обычно не применяется к маркировке выключенных элементов управления.</p></li><li><p>Для областей, которые реагируют на изменения курсора мыши, скриншот может помочь определить цветовое значение в \"спокойном состоянии\". Альтернативно, можно создать состояние фокуса с помощью клавиатуры и затем измерить контраст с помощью пипетки Contrast Analyzers.</p></li><li><p>Если необходимо проверить контрасты тонких шрифтов, возможно, стоит увеличить шрифт и отключить сглаживание шрифтов.</p></li><li><p>Если необходимо определить цветовые значения очень маленьких областей (тонкие шрифты или маленькие иконки), возможно, проще сделать скриншот и использовать более мощные инструменты увеличения и пипетки программы для редактирования изображений.</p></li><li><p>Цветовой контраст текстовых заглушек форм должен соответствовать минимальным требованиям 4,5:1. Исключение составляют текстовые заглушки, если видимая метка соответствует требованию к контрасту. В качестве метки для поисковых полей также может выступать обычный значок, который соответствует требованию к контрасту графики (см. шаг проверки 9.1.4.11). Если дополнительная информация (например, формат даты) находится в тексте-заполнителе, это исключение не применяется, текст-заполнитель должен соответствовать контрасту 4,5:1.</p></li></ul>",
  "_STEP_9_1_4_3_HOW_CHECKED_15_": "<h4 id=\"_3_2_hinweise_zur_prüfung_von_seiten_mit_styleswitcher\">3.2 Советы по проверке страниц с переключателем стилей</h4>",
  "_STEP_9_1_4_3_HOW_CHECKED_16_": "<p>Проверка контрастности на страницах, вызванных с помощью переключателя стилей для более контрастного вида, проводится только при следующих условиях:</p>",
  "_STEP_9_1_4_3_HOW_CHECKED_17_": "<ul><li><p>Элемент управления переключателем стилей (или прямая ссылка на страницу переключателя стилей) четко видим на начале страницы.</p></li><li><p>Элемент управления имеет контрастное соотношение как минимум 4,5:1, если он обозначен текстом (для графических переключателей минимальный контраст 3,0:1, см. шаг проверки 9.1.4.11). Также должны быть выполнены все другие требования к доступности (например, возможность управления с клавиатуры)</p></li><li><p>Альтернативный контрастный вид должен содержать ту же информацию и функциональность, что и исходный вид.</p></li></ul>",
  "_STEP_9_1_4_3_HOW_CHECKED_18_": "<h4 id=\"_3_3_hinweise_zur_messung_des_kontrastverhältnisses\">3.3 Советы по измерению контрастного соотношения</h4>",
  "_STEP_9_1_4_3_HOW_CHECKED_19_": "<ul><li><p>Для оценки учитывается контрастное соотношение (<em>относительная яркость</em>) согласно формуле, определенной в WCAG 2.1.</p></li><li><p>Проверка контрастов обычного текста и крупного текста основывается на измеренных значениях размера шрифта в пикселях (<a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#webdeveloper\">Web Developer Toolbar</a>, <em>Показать информацию элемента</em>), поскольку измерение фактического размера точек на экране с помощью типометра не практично. При разрешении экрана 96 dpi 18 пунктов соответствует примерно 24 пикселям, 14 пунктов — примерно 18,7 пикселям.</p></li><li><p>Измерение эквивалента в пикселях оправдано тем, что тестируемые <em>User Agents</em> обрабатывают размеры в пикселях и пунктах аналогично (в соотношении 4:3), независимо от разрешения экрана, на котором отображается текст. Правильнее было бы, если бы <em>User Agents</em> учитывали разрешение экрана для расчета размера вывода (то есть использовали бы больше пикселей на пункт на экранах с более высоким разрешением). Для проверки решающим является эталонное значение разрешения экрана 96 dpi, для которого соответствие определенно соблюдается.</p></li></ul>",
  "_STEP_9_1_4_3_HOW_CHECKED_20_": "<h4 id=\"_3_4_hinweise_zu_mangelnden_text_kontrasten_nativer_elemente_in_browsern_z_b_select_datepicker_widgets\">3.4 Советы по недостаточным текстовым контрастам нативных элементов в браузерах (например, <code>select</code>, виджеты выбора даты)</h4>",
  "_STEP_9_1_4_3_HOW_CHECKED_21_": "<p>В зависимости от используемого браузера в некоторых состояниях контрастные значения могут быть недостаточными. Например, при отображении элемента <code>select</code> в браузере Chrome выбранный вариант представлен белым текстом на синем фоне с контрастом всего 3,2:1. Формально, при использовании нативных элементов с недостатками контраста этот шаг проверки в некоторых браузерах не выполняется.</p>",
  "_STEP_9_1_4_3_HOW_CHECKED_22_": "<p>Авторы не имеют достаточного влияния на отображение некоторых нативных элементов и виджетов, чтобы обеспечить хороший контраст во всех состояниях. Если бы они заменили нативные элементы на более контрастные пользовательские элементы, это могло бы привести к другим проблемам: корректное отображение зависит от JavaScript, возникают проблемы с использованием средств чтения экрана в зависимости от окружения, код становится более сложным и подверженным ошибкам и т.д. Поскольку использование нативных элементов предоставляет значительные преимущества по сравнению с использованием пользовательских элементов, этот шаг проверки считается выполненным, если недостатки контраста исключительно связаны с отображением нативных элементов соответствующим браузером.</p>",
  "_STEP_9_1_4_3_HOW_CHECKED_23_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_1_4_3_HOW_CHECKED_24_": "<h4 id=\"_erfüllt\">Выполнено</h4>",
  "_STEP_9_1_4_3_HOW_CHECKED_25_": "<ul><li><p>Контрастное соотношение (<em>contrast ratio</em>) между цветом переднего и заднего плана для текстов меньше 18 пунктов (или для жирных текстов меньше 14 пунктов) составляет как минимум 4,5:1.</p></li><li><p>Контрастное соотношение (<em>contrast ratio</em>) между цветом переднего и заднего плана для текстов крупного размера (18 пунктов и более, 14 пунктов и более для жирного текста) составляет как минимум 3:1.</p></li><li><p>Если требование выполняется только через альтернативный вид, переключатель стилей сам по себе соответствует требованию контраста 4,5:1 и другим требованиям к доступности.</p></li></ul>",
  "_STEP_9_1_4_3_SOURCES_1_": "<h3 id=\"_w3c_zum_zusammenhang_zwischen_px_und_pt\">W3C о взаимосвязи между <code>px</code> и <code>pt</code></h3>",
  "_STEP_9_1_4_3_SOURCES_2_": "<p><a href=\"https://www.w3.org/TR/css3-values/#absolute-lengths\"> CSS Values and Units Module Level 3: 5.2 Absolute Lengths</a></p>",
  "_STEP_9_1_4_3_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Разграничение с другими шагами проверки</h3>",
  "_STEP_9_1_4_3_CLASSIFICATION_2_": "<ul><li><p>Шаг проверки 9.1.4.11 \"Достаточный контраст графики и графических элементов управления\" обрабатывает контраст графики.</p></li><li><p>Графические шрифты (для определения см. также шаг проверки 9.1.4.5 \"Отказ от графических шрифтов\"</p></li></ul>",
  "_STEP_9_1_4_3_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация шага проверки по WCAG 2.1</h3>",
  "_STEP_9_1_4_3_CLASSIFICATION_4_": "<h4 id=\"_guideline\">Руководство</h4>",
  "_STEP_9_1_4_3_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#distinguishable\"> Guideline 1.4 Distinguishable: Облегчение восприятия содержимого пользователем, включая разделение переднего плана от фона</a></p></li></ul>",
  "_STEP_9_1_4_3_CLASSIFICATION_6_": "<h4 id=\"_success_criterion\">Критерии успеха</h4>",
  "_STEP_9_1_4_3_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#contrast-minimum\"> 1.4.3 Contrast (Minimum)</a> (Уровень AA)</p></li></ul>",
  "_STEP_9_1_4_3_CLASSIFICATION_8_": "<h4 id=\"_techniques\">Техники</h4>",
  "_STEP_9_1_4_3_CLASSIFICATION_9_": "<h5 id=\"_general_techniques\">Общие техники</h5>",
  "_STEP_9_1_4_3_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G18.html\"> G18: Обеспечение контрастного соотношения как минимум 4,5:1 между текстом (и изображениями текста) и фоном за текстом</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G145.html\"> G145: Обеспечение контрастного соотношения как минимум 3:1 между текстом (и изображениями текста) и фоном за текстом</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G148.html\"> G148: Не указание цвета фона, не указание цвета текста и не использование технологических возможностей, изменяющих эти умолчания</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G174.html\"> G174: Предоставление элемента управления с достаточным контрастным соотношением, позволяющим пользователям переключаться на представление, использующее достаточный контраст</a></p></li></ul>",
  "_STEP_9_1_4_3_CLASSIFICATION_11_": "<h4 id=\"_failures\">Неудачи</h4>",
  "_STEP_9_1_4_3_CLASSIFICATION_12_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F83.html\"> F83: Неудача критерия успеха 1.4.3 и 1.4.6 из-за использования фоновых изображений, которые не обеспечивают достаточного контраста с передним текстом (или изображениями текста)</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F24.html\"> F24: Неудача критериев успеха 1.4.3, 1.4.6 и 1.4.8 из-за указания цветов переднего плана без указания цветов фона или наоборот</a></p></li></ul>",
  "_STEP_9_1_4_3_QUESTIONS_1_": "<h3 id=\"_subjektiver_eindruck_bei_kontrastmessungen\">Субъективное впечатление при измерении контраста</h3>",
  "_STEP_9_1_4_3_QUESTIONS_2_": "<p>Результат <a href=\"http://www.w3.org/TR/UNDERSTANDING-WCAG20/visual-audio-contrast-contrast.html#visual-audio-contrast-contrast-69-head\">формулы WCAG 2.1 для измерения контрастного соотношения</a> часто не соответствует субъективному впечатлению. Насколько оно надежно?</p>",
  "_STEP_9_1_4_3_QUESTIONS_3_": "<p>Здесь следует учитывать два аспекта:</p>",
  "_STEP_9_1_4_3_QUESTIONS_4_": "<p>Контраст яркости — это только один из трех факторов, влияющих на общий контраст. Поэтому ясно, что результат для контраста яркости не соответствует субъективному впечатлению. Он и не должен соответствовать субъективному общему впечатлению, ведь речь идет о том, достаточно ли контрастируют цвета сами по себе. Если вы нормально видите, то субъективное впечатление в виде оттенков серого уже ближе к результату формулы. Цвета соседних поверхностей влияют на восприятие, мелкие и тонкие шрифты кажутся менее контрастными, есть эффекты перелива, возможно, контрасты ослабляются сглаживанием шрифтов. Формула не учитывает все эти факторы. По крайней мере, если речь идет о текстах, это также разумно. Ведь упомянутые влияния не фиксированы, они зависят, например, от выбранного размера шрифта.</p>",
  "_STEP_9_1_4_3_QUESTIONS_5_": "<p>Для проверки это означает: те, кто не имеет опыта с формульной оценкой контрастов яркости, не могут полагаться на свое субъективное впечатление. Им придется применять формулу практически ко всем цветовым комбинациям.</p>"
}