{
  "_STEP_9_1_1_1C_NAME_": "Leere alt-Attribute für Layoutgrafiken",
  "_STEP_9_1_1_1C_NAME_MENU_": "9.1.1.1c Leere alt-Attribute für Layoutgrafiken",
  "_STEP_9_1_1_1C_WHAT_CHECKED_1_": "<p>Eine Grafik, die keine informative Funktion hat, benötigt keinen Alternativtext. Grafiken ohne informative Funktion sind zum Beispiel Abstandshalter, Farbflächen, Muster, oder rein dekorative Fotos. Solche Grafiken sollen mit einem leeren <code>alt</code>-Attribut (<code>alt=\"\"</code>) ausgezeichnet werden.</p>",
  "_STEP_9_1_1_1C_WHAT_CHECKED_2_": "<p>Thema des Prüfschritts sind auch Icons, die mittels Icon Font eingebunden sind und SVGs.</p>",
  "_STEP_9_1_1_1C_WHY_CHECKED_1_": "<p>Screenreader behandeln Bilder <strong>ohne</strong> <code>alt</code>-Attribut anders als Bilder <strong>mit leerem</strong> <code>alt</code>-Attribut.</p>",
  "_STEP_9_1_1_1C_WHY_CHECKED_2_": "<p>Wenn ein Screenreader auf ein Bild ohne <code>alt</code>-Attribut stößt, liest er normalerweise den Namen der Bilddatei vor. In vielen Fällen muss man für die Benutzung von Seiten unbedingt wissen, was auf Bildern gezeigt wird. Dateinamen können dafür manchmal brauchbare Hinweise liefern.</p>",
  "_STEP_9_1_1_1C_WHY_CHECKED_3_": "<p>Wenn Bilder nur der Dekoration dienen, ist das Vorlesen des Dateinamens dagegen störend. Bei diesen Bildern wäre es besser, wenn der Screenreader sie einfach übergehen würde.</p>",
  "_STEP_9_1_1_1C_WHY_CHECKED_4_": "<p>Das leere <code>alt</code>-Attribut informiert den Screenreader darüber, dass das betreffende Bild nur der Dekoration dient und sein Inhalt unbedeutend ist. Der Screenreader ignoriert das Bild dann komplett, er tut so, als sei es nicht vorhanden.</p>",
  "_STEP_9_1_1_1C_WHY_CHECKED_5_": "<p>Das leere <code>alt</code>-Attribut ist also sehr wichtig. Es stellt sicher, dass der Besucher mit Screenreader nicht durch das dauernde Vorlesen bedeutungsloser Dateinamen an der Nutzung der Seite gehindert wird.</p>",
  "_STEP_9_1_1_1C_WHY_CHECKED_6_": "<p>Icon Fonts sind Schriftarten, die Symbole statt Buchstaben beinhalten. Sie werden per CSS eingebunden. Manche moderne Browser übergeben an den Screenreader ein Unicode-Äquivalent, was bei dekorativen Icons störend ist.</p>",
  "_STEP_9_1_1_1C_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_1_1_1C_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn als <code>img-</code>Element eingebundene Grafiken, Font Icons oder SVGs für Layoutzwecke verwendet werden.</p>",
  "_STEP_9_1_1_1C_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_1_1_1C_HOW_CHECKED_4_": "<h4 id=\"_2_1_leere_alt_attribute_für_layoutgrafiken\">2.1 Leere <code>alt</code>-Attribute für Layoutgrafiken</h4>",
  "_STEP_9_1_1_1C_HOW_CHECKED_5_": "<ol><li><p>Die Seite im Firefox laden.</p></li><li><p>In der <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#webdeveloper\"> Web Developer Toolbar</a>  das Menü <em>Images &gt; Display Alt Attributes</em> aufrufen. Alternativ kann auch das <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#imagesbm\"> Images bookmarklet</a> eingesetzt werden.</p></li><li><p>Prüfen, ob Layoutgrafiken und dekorative Grafiken leere <code>alt</code>-Attribute enthalten. Falls bei solchen Grafiken <code>title</code>-Attribute vergeben sind, müssen auch diese leer sein. Zu bemängeln sind komplett fehlende <code>alt</code>-Attribute (werden durch die Toolbar-Funktion mit \"No Alt!\" gekennzeichnet) und auch Bezeichnungen wie \"Abstandshalter\", \"spacer\", \"leer\" etc. für Layoutgrafiken.</p></li></ol>",
  "_STEP_9_1_1_1C_HOW_CHECKED_6_": "<h4 id=\"_2_2_dekorative_icon_fonts\">2.2 Dekorative Icon Fonts:</h4>",
  "_STEP_9_1_1_1C_HOW_CHECKED_7_": "<p>Beim Einsatz von Icon Fonts ist es nicht möglich, das leere <code>alt</code>-Attribut einzusetzen.</p>",
  "_STEP_9_1_1_1C_HOW_CHECKED_8_": "<p>Ein dekoratives Icon wird von assistiven Technologien ignoriert, wenn es mit einem geeigneten Verfahren vor diesen versteckt wird (z. B. <code>aria-hidden=\"true\"</code>).</p>",
  "_STEP_9_1_1_1C_HOW_CHECKED_9_": "<h5 id=\"_prüfung\">Prüfung</h5>",
  "_STEP_9_1_1_1C_HOW_CHECKED_10_": "<ol><li><p>Seite in <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\"> Firefox</a> aufrufen.</p></li><li><p>Mit den Web Developer Tools prüfen, ob mit der CSS-Eigenschaft <code>content</code> für die Pseudoelemente <code>:before</code> oder <code>:after</code> Inhalt (Font Icons) zu dekorativen Zwecken eingebunden wird.</p></li><li><p>Falls für diese Icons Text ausgegeben wird (z. B. <code>content: \"k\"</code>), prüfen, ob das Icon mit einer geeigneten Technik für Screenreader versteckt wird (z. B. <code>aria-hidden=\"true\"</code>).</p></li></ol>",
  "_STEP_9_1_1_1C_HOW_CHECKED_11_": "<h4 id=\"_2_3_dekorative_svgs\">2.3 Dekorative SVGs</h4>",
  "_STEP_9_1_1_1C_HOW_CHECKED_12_": "<h5 id=\"_prüfung_2\">Prüfung</h5>",
  "_STEP_9_1_1_1C_HOW_CHECKED_13_": "<ol><li><p>Seite in <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\"> Firefox</a> aufrufen.</p></li><li><p>Mit den Web Developer Tools prüfen, ob es sich um eine direkt in HTML eingebundene SVG handelt (Inline SVG).</p></li><li><p>Prüfen, ob die Grafik mit <code>aria-hidden=\"true\"</code> versteckt wird.</p></li></ol>",
  "_STEP_9_1_1_1C_HOW_CHECKED_14_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_9_1_1_1C_HOW_CHECKED_15_": "<p>Bei aus mehreren Teilbildern zusammengesetzten Bildern mit Informationsgehalt sollte eines der Teilbilder einen Alternativtext haben, der über den Inhalt des zusammengesetzten Bildes informiert. Die anderen Teilbilder sollten mit leeren <code>alt</code>-Attributen versehen sein.</p>",
  "_STEP_9_1_1_1C_HOW_CHECKED_16_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_9_1_1_1C_HOW_CHECKED_17_": "<h4 id=\"_nicht_voll_erfüllt\">Nicht voll erfüllt</h4>",
  "_STEP_9_1_1_1C_HOW_CHECKED_18_": "<ul><li><p>Layoutgrafiken haben kein <code>alt</code>-Attribut</p></li><li><p>Layoutgrafiken sind mit Alternativtexten wie \"Platzhalter\" oder \"leer\" versehen</p></li><li><p>Layoutgrafiken haben <code>title</code>-Attribute, die nicht leer sind</p></li></ul>",
  "_STEP_9_1_1_1C_SOURCES_1_": "<p>Die WCAG 2.0-Technik <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H67.html\">H67</a> sieht zusätzlich vor, dass bei Layout-Grafiken auch kein <code>title</code>-Attribut vorhanden sein soll oder dass das <code>title</code>-Attribut leer ist:</p>",
  "_STEP_9_1_1_1C_SOURCES_2_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>For each image that should be ignored:</p><p>Check that <code>title</code> attribute is either absent or empty. Check that <code>alt</code> attribute is present and empty or contains only whitespace (but not )</p></blockquote></div>",
  "_STEP_9_1_1_1C_SOURCES_3_": "<p>(<a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H67.html\">H67: Using null alt text and no title attribute on img elements for images that AT should ignore</a>)</p>",
  "_STEP_9_1_1_1C_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_1_1_1C_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Guideline</h4>",
  "_STEP_9_1_1_1C_CLASSIFICATION_3_": "<ul><li><p><a href=\"http://www.w3.org/TR/WCAG21/#text-alternatives\"> Guideline 1.1 Text Alternatives: Provide text alternatives for any non-text content so that it can be changed into other forms people need, such as large print, braille, speech, symbols or simpler language</a></p></li></ul>",
  "_STEP_9_1_1_1C_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Success criterion</h4>",
  "_STEP_9_1_1_1C_CLASSIFICATION_5_": "<ul><li><p><a href=\"http://www.w3.org/TR/WCAG21/#x1-1-1-non-text-content\"> 1.1.1 Non-text Content</a> (Level A)</p></li></ul>",
  "_STEP_9_1_1_1C_CLASSIFICATION_6_": "<h4 id=\"_techniques\">Techniques</h4>",
  "_STEP_9_1_1_1C_CLASSIFICATION_7_": "<h5 id=\"_html_techniques\">HTML Techniques</h5>",
  "_STEP_9_1_1_1C_CLASSIFICATION_8_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H67\"> H67: Using null alt text and no title attribute on img elements for images that AT should ignore</a></p></li></ul>",
  "_STEP_9_1_1_1C_CLASSIFICATION_9_": "<h5 id=\"_css_techniques\">CSS Techniques</h5>",
  "_STEP_9_1_1_1C_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/css/C9\"> C9: Using CSS to include decorative images</a></p></li></ul>",
  "_STEP_9_1_1_1C_CLASSIFICATION_11_": "<h5 id=\"_failures\">Failures</h5>",
  "_STEP_9_1_1_1C_CLASSIFICATION_12_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F38\"> F38: Failure of Success Criterion 1.1.1 due to omitting the <code>alt</code>-attribute for non-text content used for decorative purposes only in HTML</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F39\">F39: Failure of Success Criterion 1.1.1 due to providing a text alternative that is not null(e.g. <code>alt='spacer'</code> or <code>alt='image'</code>) for images that should be ignored by assistive technology</a></p></li></ul>",
  "_STEP_9_1_1_1C_QUESTIONS_1_": "<h3 id=\"_grafiken_mit_informativem_charakter\">Grafiken mit informativem Charakter</h3>",
  "_STEP_9_1_1_1C_QUESTIONS_2_": "<p>Auf der Seite sind auch Grafiken, die ganz klar informativen Charakter haben, mit leeren <code>alt</code>-Attributen versehen.</p>",
  "_STEP_9_1_1_1C_QUESTIONS_3_": "<p>Vermutlich wird automatisch ein leeres <code>alt</code>-Attribut erzeugt, wenn zu einem Bild kein entsprechender Text eingegeben worden ist. Zu welchem Prüfschritt gehört das?</p>",
  "_STEP_9_1_1_1C_QUESTIONS_4_": "<p>So ist das leere <code>alt</code>-Attribut für dekorative Grafiken ganz sicher nicht gedacht. Das <strong>leere</strong> <code>alt</code>-Attribut ist ja nicht dasselbe wie ein <strong>fehlendes</strong> <code>alt</code>-Attribut. Es soll dem Besucher sagen, dass die Grafik keinen wichtigen Inhalt enthält und nur der Dekoration dient. Der Besucher weiß dann, dass er nichts versäumt, wenn er die Grafik nicht sieht. Die automatische Vergabe leerer Alternativtexte für informative Grafiken ist ein Missbrauch des leeren <code>alt</code>-Attributs. Sie sorgt dafür, dass man sich auf dieses Kennzeichen nicht mehr verlassen kann.</p>",
  "_STEP_9_1_1_1C_QUESTIONS_5_": "<p>Dies wird nur in Prüfschritt 9.1.1.1b \"Alternativtexte für Grafiken und Objekte\" bewertet.</p>",
  "_STEP_9_1_1_1C_QUESTIONS_6_": "<h3 id=\"_aufgabe_des_bildes_in_den_alternativtext\">Aufgabe des Bildes in den Alternativtext?</h3>",
  "_STEP_9_1_1_1C_QUESTIONS_7_": "<p>Warum soll man bei Layoutgrafiken nicht die jeweilige Aufgabe des Bildes, also zum Beispiel \"Abstandhalter\" in den Alternativtext schreiben?</p>",
  "_STEP_9_1_1_1C_QUESTIONS_8_": "<p>Wofür sollte das gut sein? Den Abstand herstellen, also die Aufgabe des Bildes übernehmen kann der Alternativtext nicht. Die Information, dass da irgendwo Abstände zwischen Elementen der Seite sind, ist nutzlos. Wie die Elemente auf der Seite angeordnet sind, lässt sich der Tatsache, dass an irgend welchen Stellen Abstandhalter sind, auch nicht entnehmen.</p>",
  "_STEP_9_1_1_1C_QUESTIONS_9_": "<p>Solche Alternativtexte haben also keinen Nutzen. Auf der anderen Seite kann es sehr störend sein, wenn der Screenreader dauernd \"Abstandhalter Abstandhalter Abstandhalter …​\" vorliest.</p>",
  "_STEP_9_1_1_1C_QUESTIONS_10_": "<h3 id=\"_warum_müssen_layoutgrafiken_mit_leeren_alt_attributen_versehen_werden\">Warum müssen Layoutgrafiken mit leeren <code>alt</code>-Attributen versehen werden?</h3>",
  "_STEP_9_1_1_1C_QUESTIONS_11_": "<p>Sie werden ohnehin nicht gebraucht, warum also nicht einfach das <code>alt</code>-Attribut ganz weglassen?</p>",
  "_STEP_9_1_1_1C_QUESTIONS_12_": "<p>Leider ist es noch nicht selbstverständlich, dass informative Grafiken mit Alternativtexten versehen sind. Wenn eine Webseite Grafiken ohne Alternativtext enthält, kann der blinde Besucher also nicht davon ausgehen, dass diese Grafiken nur dem Layout dienen und für ihn nicht relevant sind. Daher die Festlegung, dass der Webdesigner Grafiken durch Zuordnung eines leeren <code>alt</code>-Attributs ausdrücklich als Layoutgrafiken kennzeichnen soll.</p>"
 }
