{
  "_STEP_9_1_1_1C_NAME_": "Пустые alt-атрибуты для графики макета",
  "_STEP_9_1_1_1C_WHAT_CHECKED_1_": "<p>Графика, которая не имеет информативной функции, не требует альтернативного текста. К такой графике относятся, например, разделители, цветные поля, узоры или чисто декоративные фотографии. Такие изображения должны быть обозначены пустым <code>alt</code>-атрибутом (<code>alt=\"\"</code>).</p>",
  "_STEP_9_1_1_1C_WHAT_CHECKED_2_": "<p>Объектом проверки являются также иконки, встроенные с помощью шрифтов иконок и SVG-графика.</p>",
  "_STEP_9_1_1_1C_WHY_CHECKED_1_": "<p>Скринридеры обрабатывают изображения <strong>без</strong> <code>alt</code>-атрибута иначе, чем изображения <strong>с пустым</strong> <code>alt</code>-атрибутом.</p>",
  "_STEP_9_1_1_1C_WHY_CHECKED_2_": "<p>Если скринридер сталкивается с изображением без <code>alt</code>-атрибута, он обычно читает имя файла изображения. Во многих случаях для использования сайта необходимо знать, что изображено на картинках. Имена файлов иногда могут дать полезные подсказки.</p>",
  "_STEP_9_1_1_1C_WHY_CHECKED_3_": "<p>Если изображения служат только для декорации, то чтение имени файла может быть раздражающим. В этих случаях лучше, чтобы скринридер просто проигнорировал их.</p>",
  "_STEP_9_1_1_1C_WHY_CHECKED_4_": "<p>Пустой <code>alt</code>-атрибут информирует скринридер о том, что данное изображение предназначено только для декорации, и его содержание несущественно. Скринридер тогда полностью игнорирует изображение, ведет себя так, как будто его нет.</p>",
  "_STEP_9_1_1_1C_WHY_CHECKED_5_": "<p>Таким образом, пустой <code>alt</code>-атрибут очень важен. Он гарантирует, что посетитель, использующий скринридер, не будет отвлекаться на постоянное прочтение бессмысленных имен файлов, что мешает использованию сайта.</p>",
  "_STEP_9_1_1_1C_WHY_CHECKED_6_": "<p>Шрифты иконок — это шрифты, содержащие символы вместо букв. Они включаются через CSS. Некоторые современные браузеры передают скринридеру Unicode-эквивалент, что может быть раздражающим в случае декоративных иконок.</p>",
  "_STEP_9_1_1_1C_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_9_1_1_1C_HOW_CHECKED_2_": "<p>Этап проверки применим, если графика, шрифты иконок или SVG используются в качестве элементов макета, встроенных как <code>img-</code>элементы.</p>",
  "_STEP_9_1_1_1C_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_1_1_1C_HOW_CHECKED_4_": "<h4 id=\"_2_1_leere_alt_attribute_für_layoutgrafiken\">2.1 Пустые <code>alt</code>-атрибуты для макетной графики</h4>",
  "_STEP_9_1_1_1C_HOW_CHECKED_5_": "<ol><li><p>Загрузить страницу в Firefox.</p></li><li><p>Использовать меню <em>Images &gt; Display Alt Attributes</em> в <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#webdeveloper\">Web Developer Toolbar</a>. В качестве альтернативы может быть использовано <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#imagesbm\">закладка Images</a>.</p></li><li><p>Проверить, содержат ли макетная и декоративная графика пустые <code>alt</code>-атрибуты. Если у таких изображений заданы <code>title</code>-атрибуты, они также должны быть пустыми. Наличие полностью отсутствующих <code>alt</code>-атрибутов (отмечено в Toolbar как \"No Alt!\") и наименований типа \"разделитель\", \"spacer\", \"пусто\" для макетной графики считается ошибкой.</p></li></ol>",
  "_STEP_9_1_1_1C_HOW_CHECKED_6_": "<h4 id=\"_2_2_dekorative_icon_fonts\">2.2 Декоративные шрифты иконок:</h4>",
  "_STEP_9_1_1_1C_HOW_CHECKED_7_": "<p>При использовании шрифтов иконок невозможно применить пустой <code>alt</code>-атрибут.</p>",
  "_STEP_9_1_1_1C_HOW_CHECKED_8_": "<p>Декоративная иконка будет игнорирована ассистивными технологиями, если она скрыта от них подходящим образом (например, <code>aria-hidden=\"true\"</code>).</p>",
  "_STEP_9_1_1_1C_HOW_CHECKED_9_": "<h5 id=\"_prüfung\">Проверка</h5>",
  "_STEP_9_1_1_1C_HOW_CHECKED_10_": "<ol><li><p>Открыть страницу в <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\">Firefox</a>.</p></li><li><p>С помощью инструментов разработчика проверить, используется ли CSS-свойство <code>content</code> для псевдоэлементов <code>:before</code> или <code>:after</code> для включения содержимого (шрифтов иконок) в декоративных целях.</p></li><li><p>Если для этих иконок задан текст (например, <code>content: \"k\"</code>), проверить, скрыта ли иконка от скринридеров подходящим образом (например, <code>aria-hidden=\"true\"</code>).</p></li></ol>",
  "_STEP_9_1_1_1C_HOW_CHECKED_11_": "<h4 id=\"_2_3_dekorative_svgs\">2.3 Декоративные SVG</h4>",
  "_STEP_9_1_1_1C_HOW_CHECKED_12_": "<h5 id=\"_prüfung_2\">Проверка</h5>",
  "_STEP_9_1_1_1C_HOW_CHECKED_13_": "<ol><li><p>Открыть страницу в <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\">Firefox</a>.</p></li><li><p>С помощью инструментов разработчика проверить, является ли SVG встроенным непосредственно в HTML (Inline SVG).</p></li><li><p>Проверить, скрыта ли графика с помощью <code>aria-hidden=\"true\"</code>.</p></li></ol>",
  "_STEP_9_1_1_1C_HOW_CHECKED_14_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_9_1_1_1C_HOW_CHECKED_15_": "<p>В случае изображений, составленных из нескольких частей с информационным содержанием, одно из частей должно иметь альтернативный текст, который сообщает о содержимом всего составного изображения. Остальные части изображения должны быть обозначены пустыми <code>alt</code>-атрибутами.</p>",
  "_STEP_9_1_1_1C_HOW_CHECKED_16_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_1_1_1C_HOW_CHECKED_17_": "<h4 id=\"_nicht_voll_erfüllt\">Не полностью выполнено</h4>",
  "_STEP_9_1_1_1C_HOW_CHECKED_18_": "<ul><li><p>Макетные графики не имеют <code>alt</code>-атрибута</p></li><li><p>Макетные графики снабжены альтернативными текстами типа \"разделитель\" или \"пусто\"</p></li><li><p>Макетные графики имеют <code>title</code>-атрибуты, которые не пусты</p></li></ul>",
  "_STEP_9_1_1_1C_SOURCES_1_": "<p>Техника WCAG 2.0 <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H67.html\">H67</a> дополнительно указывает, что у макетной графики также не должно быть атрибута <code>title</code>, или атрибут <code>title</code> должен быть пустым:</p>",
  "_STEP_9_1_1_1C_SOURCES_2_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>For each image that should be ignored:</p><p>Check that <code>title</code> attribute is either absent or empty. Check that <code>alt</code> attribute is present and empty or contains only whitespace (but not )</p></blockquote></div>",
  "_STEP_9_1_1_1C_SOURCES_3_": "<p>(<a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H67.html\">H67: Использование пустого альтернативного текста и отсутствие атрибута title на элементах img для изображений, которые должны игнорироваться ассистивными технологиями</a>)</p>",
  "_STEP_9_1_1_1C_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация этапа проверки по WCAG 2.1</h3>",
  "_STEP_9_1_1_1C_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Руководство</h4>",
  "_STEP_9_1_1_1C_CLASSIFICATION_3_": "<ul><li><p><a href=\"http://www.w3.org/TR/WCAG21/#text-alternatives\">Руководство 1.1 Текстовые альтернативы: Предоставление текстовых альтернатив для любого нон-текстового содержимого, так чтобы его можно было преобразовать в другие формы, необходимые людям, такие как крупный шрифт, брайль, речь, символы или более простой язык</a></p></li></ul>",
  "_STEP_9_1_1_1C_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Критерий успеха</h4>",
  "_STEP_9_1_1_1C_CLASSIFICATION_5_": "<ul><li><p><a href=\"http://www.w3.org/TR/WCAG21/#x1-1-1-non-text-content\">1.1.1 Нон-текстовый контент</a> (Уровень A)</p></li></ul>",
  "_STEP_9_1_1_1C_CLASSIFICATION_6_": "<h4 id=\"_techniques\">Техники</h4>",
  "_STEP_9_1_1_1C_CLASSIFICATION_7_": "<h5 id=\"_html_techniques\">HTML техники</h5>",
  "_STEP_9_1_1_1C_CLASSIFICATION_8_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H67\">H67: Использование пустого alt текста и отсутствие атрибута title на элементах img для изображений, которые должны игнорироваться AT</a></p></li></ul>",
  "_STEP_9_1_1_1C_CLASSIFICATION_9_": "<h5 id=\"_css_techniques\">CSS техники</h5>",
  "_STEP_9_1_1_1C_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/css/C9\">C9: Использование CSS для включения декоративных изображений</a></p></li></ul>",
  "_STEP_9_1_1_1C_CLASSIFICATION_11_": "<h5 id=\"_failures\">Неудачи</h5>",
  "_STEP_9_1_1_1C_CLASSIFICATION_12_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F38\">F38: Неудача критерия успеха 1.1.1 из-за пропуска атрибута <code>alt</code> для нон-текстового контента, используемого только в декоративных целях в HTML</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F39\">F39: Неудача критерия успеха 1.1.1 из-за предоставления альтернативного текста, который не является нулевым (например, <code>alt='spacer'</code> или <code>alt='image'</code>) для изображений, которые должны быть игнорированы ассистивной технологией</a></p></li></ul>",
  "_STEP_9_1_1_1C_QUESTIONS_1_": "<h3 id=\"_grafiken_mit_informativem_charakter\">Графика с информативным характером</h3>",
  "_STEP_9_1_1_1C_QUESTIONS_2_": "<p>На странице также есть графика, явно имеющая информативный характер, с пустыми <code>alt</code>-атрибутами.</p>",
  "_STEP_9_1_1_1C_QUESTIONS_3_": "<p>Вероятно, пустой <code>alt</code>-атрибут генерируется автоматически, если для изображения не введен соответствующий текст. К какому этапу проверки это относится?</p>",
  "_STEP_9_1_1_1C_QUESTIONS_4_": "<p>Такое пустое <code>alt</code>-атрибут для декоративной графики точно не предназначено. <strong>Пустой</strong> <code>alt</code>-атрибут не то же самое, что <strong>отсутствующий</strong> <code>alt</code>-атрибут. Он должен сообщать посетителю, что графика не содержит важной информации и служит только для декорации. Посетитель знает, что он ничего не упустит, если не увидит графику. Автоматическое присвоение пустых альтернативных текстов информативной графике является злоупотреблением пустого <code>alt</code>-атрибута. Это делает его ненадежным индикатором.</p>",
  "_STEP_9_1_1_1C_QUESTIONS_5_": "<p>Это оценивается только на этапе проверки 9.1.1.1b \"Альтернативные тексты для графики и объектов\".</p>",
  "_STEP_9_1_1_1C_QUESTIONS_6_": "<h3 id=\"_aufgabe_des_bildes_in_den_alternativtext\">Задача изображения в альтернативном тексте?</h3>",
  "_STEP_9_1_1_1C_QUESTIONS_7_": "<p>Почему в альтернативный текст макетных изображений не следует включать их функцию, например, \"разделитель\"?</p>",
  "_STEP_9_1_1_1C_QUESTIONS_8_": "<p>Зачем это нужно? Альтернативный текст не может выполнить функцию изображения, например, создать пространство. Информация о том, что где-то между элементами страницы есть разделители, бесполезна. Как элементы на странице расположены, из того факта, что в каких-то местах есть разделители, также не следует.</p>",
  "_STEP_9_1_1_1C_QUESTIONS_9_": "<p>Такие альтернативные тексты не приносят пользы. С другой стороны, это может быть очень раздражающим, если скринридер постоянно читает \"разделитель разделитель разделитель…\".</p>",
  "_STEP_9_1_1_1C_QUESTIONS_10_": "<h3 id=\"_warum_müssen_layoutgrafiken_mit_leeren_alt_attributen_versehen_werden\">Почему макетные графики должны быть снабжены пустыми <code>alt</code>-атрибутами?</h3>",
  "_STEP_9_1_1_1C_QUESTIONS_11_": "<p>Они все равно не нужны, почему бы просто не опустить <code>alt</code>-атрибут?</p>",
  "_STEP_9_1_1_1C_QUESTIONS_12_": "<p>К сожалению, еще не стало нормой снабжать информативную графику альтернативными текстами. Если веб-сайт содержит графику без альтернативного текста, слепой посетитель не может предположить, что эти изображения предназначены только для макета и не релевантны для него. Поэтому установлено, что веб-дизайнер должен явно обозначать графику как макетную, присваивая пустой <code>alt</code>-атрибут.</p>"
}