{
  "_STEP_9_2_4_3_NAME_": "Логичная последовательность при управлении с клавиатуры",
  "_STEP_9_2_4_3_NAME_MENU_": "9.2.4.3 Логичная последовательность при управлении с клавиатуры",
  "_STEP_9_2_4_3_WHAT_CHECKED_1_": "<p>При использовании веб-сайта с клавиатуры порядок, в котором активируются ссылки, элементы форм и объекты, должен быть логичным и понятным.</p>",
  "_STEP_9_2_4_3_WHY_CHECKED_1_": "<p>Управление должно быть независимым от устройства. Это означает, что оно должно быть возможным как с помощью указателя (мыши, сенсорного жеста), так и с клавиатуры. Также на хорошую возможность управления с клавиатуры и логичную последовательность фокуса рассчитаны другие формы ввода, такие как голосовой ввод или управление переключателями.</p>",
  "_STEP_9_2_4_3_WHY_CHECKED_2_": "<p>Чаще всего проблемы возникают с управлением с клавиатуры, так как большинство пользователей интернета используют мышь, и разработчики часто ориентируются только на них. На управление с клавиатуры опираются, например, многие люди с ограниченными возможностями по движению или слепые люди.</p>",
  "_STEP_9_2_4_3_WHY_CHECKED_3_": "<p>При неочевидной последовательности фокуса пользователи могут потерять ориентацию, что может значительно затруднить управление с клавиатуры.</p>",
  "_STEP_9_2_4_3_WHY_CHECKED_4_": "<p>Некоторые сайты используют JavaScript для отображения динамических содержимого. Например, сообщения об ошибках при вводе в форму могут динамически отображаться под полем или могут быть показаны диалоговые окна. Хотя такие изменения страницы немедленно заметны для видящих пользователей, пользователи считывающих устройств могут не замечать их сразу или воспринимать с задержкой.</p>",
  "_STEP_9_2_4_3_WHY_CHECKED_5_": "<p>Если новые элементы динамически вставляются в исходный код страницы с помощью DOM-скриптинга (то есть без перезагрузки страницы), такое добавление должно происходить <strong>ниже</strong> активирующего элемента, чтобы считывающие устройства заметили и озвучили добавленные элементы.</p>",
  "_STEP_9_2_4_3_WHY_CHECKED_6_": "<p>Если элементы вставляются в другом месте DOM, например, в конце страницы (часто это случается с модальными диалогами), скрипты должны обеспечивать логичное управление фокусом и сохранять логичную последовательность фокуса.</p>",
  "_STEP_9_2_4_3_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_9_2_4_3_HOW_CHECKED_2_": "<p>Этап проверки применим, если на странице есть ссылки, элементы формы или объекты (например, меню или диалоги, которые отображаются после взаимодействия).</p>",
  "_STEP_9_2_4_3_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_2_4_3_HOW_CHECKED_4_": "<ol><li><p>Загрузить страницу в браузере Firefox.</p></li><li><p>Используя клавишу Tab, переходить по ссылкам, элементам форм и объектам, проверяя, является ли последовательность в целом понятной.</p></li><li><p>Загрузить страницу в Chrome и повторить проверку.</p></li></ol>",
  "_STEP_9_2_4_3_HOW_CHECKED_5_": "<h4 id=\"_2_1_prüfung_von_dynamisch_eingefügten_inhalten\">2.1 Проверка динамически добавленных содержимого</h4>",
  "_STEP_9_2_4_3_HOW_CHECKED_6_": "<p>Если содержимое генерируется динамически (то есть взаимодействия на странице добавляют содержимое, которое не видно в представлении без CSS на свежезагруженной странице):</p>",
  "_STEP_9_2_4_3_HOW_CHECKED_7_": "<ol><li><p>Загрузить страницу в <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\"> Firefox</a>.</p></li><li><p>Настройки по умолчанию в Firefox: В меню браузера выбрать <em>Настройки</em>. В разделе \"Серфинг\" выбрать опцию \"Разрешить выделение текста с клавиатуры\". Это отображает позицию курсора как мигающий курсор вставки. Это обычно соответствует фокусу считывающего устройства.</p></li><li><p>Активировать динамически добавляемое содержимое, например, через ввод в форму или активацию кнопки.</p></li><li><p>Вызвать встроенный инструмент разработчика браузера (<em>Инспектор</em> для Firefox), выбрать значок элемента (значок показывает курсор на клавише) слева в панели инструментов и щелкнуть по добавленному содержимому. Во всплывающем окне теперь можно просмотреть сгенерированный исходный код в контексте.</p></li><li><p>Проверить положение добавленного элемента.</p><ul><li><p>Случай 1: Добавленное содержимое появляется в исходном коде <strong>ниже</strong> активирующего элемента (см. раздел <a href=\"#_3_hinweise\">3. Советы</a>).</p></li><li><p>Случай 2: Если сгенерированные псевдоокна (модальные диалоги) вставляются в исходный код не сразу после активирующего элемента, а <strong>в другом месте</strong>, например, в конце страницы:</p></li></ul></li></ol>",
  "_STEP_9_2_4_3_HOW_CHECKED_8_": "<ol><li><p>Закрыть псевдоокно и вызвать его снова с клавиатуры от активирующего элемента.</p></li><li><p>Могут ли пользователи считывающих устройств заметить, что было добавлено новое содержимое? Это может происходить различными способами, например:</p><ul><li><p>Фокус перемещается на начало добавленного элемента с помощью скрипта (мигающий курсор вставки виден в его начале)</p></li><li><p>Текст ссылки/кнопки или свойство активирующего элемента (например, <code>disabled</code>) изменяется <strong>и</strong> при дальнейшем нажатии Tab следующий фокус получает добавленный элемент</p></li></ul></li><li><p>Возвращается ли фокус на активирующий элемент после закрытия псевдоокна?</p></li></ol>",
  "_STEP_9_2_4_3_HOW_CHECKED_9_": "<h3 id=\"_3_hinweise\">3. Советы</h3>",
  "_STEP_9_2_4_3_HOW_CHECKED_10_": "<ul><li><p>Последовательность переходов по Tab должна в основном следовать визуальному расположению на экране. Мелкие отклонения не являются проблемой, иногда невозможно однозначно определить последовательность из визуального расположения на экране.</p></li><li><p>Последовательность переходов по Tab сложно проследить, если она проходит через невидимые исполняемые элементы. Это особенно касается последовательных невидимых прыжковых ссылок.</p></li><li><p>Если последовательность переходов по Tab не явно видна, например, если выделение фокуса подавлено, то Bookmarklet <a href=\"https://codepen.io/jeffsmith/details/beb\">Show Tab Focus</a> от Jeff Smith является полезным инструментом для выделения текущей позиции.</p></li><li><p>Проверка проводится при <strong>включенном</strong> JavaScript.</p></li><li><p>Проверяющий должен быть знаком с функциональностью используемых браузеров, он должен знать, какие клавиши и комбинации клавиш предназначены для управления с клавиатуры.</p><p>Важно в этом контексте: <strong> Поля форм могут не переключаться с помощью клавиши Tab, несмотря на корректную разметку, если окно браузера не имеет фокуса. Не следует просто щелкать внутри окна, а затем начинать управление с клавиатуры. Фокус должен быть перемещен в окно браузера с помощью клавиши (F6). </strong> Списки выбора без кнопки отправки, которые реагируют на <code>onchange</code>, могут не управляться только с помощью клавиш со стрелками, так как всегда активируется первая опция списка. Чтобы пролистать такие списки, их, возможно, сначала нужно открыть с помощью комбинации клавиш \"ALT + стрелка вниз\". Затем можно пролистывать опции с помощью стрелок вверх и вниз и выбрать опцию с помощью клавиши ввода.</p></li><li><p><a href=\"https://www.w3.org/WAI/ARIA/apg/\">ARIA Authoring Practices Guide (APG)</a> предоставляют ориентиры, какой последовательности фокуса / управления фокусом следует ожидать для определенных типов виджетов.</p></li></ul>",
  "_STEP_9_2_4_3_HOW_CHECKED_11_": "<h4 id=\"_zur_einfügung_dynamisch_generierter_inhalte_unterhalb_des_auslösenden_elements\">Об вставке динамически генерируемых содержимого ниже активирующего элемента</h4>",
  "_STEP_9_2_4_3_HOW_CHECKED_12_": "<p>В некоторых случаях может быть целесообразно вставлять содержимое не сразу после активирующего элемента, а ниже на странице, например, динамический вывод результатов под многоступенчатой формой поиска. Здесь следует проверить, становится ли динамическое поведение формы очевидным из контекста полей ввода или списков выбора или благодаря поясняющим текстам или функциям помощи.</p>",
  "_STEP_9_2_4_3_HOW_CHECKED_13_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_2_4_3_HOW_CHECKED_14_": "<h4 id=\"_erfüllt\">Выполнено</h4>",
  "_STEP_9_2_4_3_HOW_CHECKED_15_": "<ul><li><p>Порядок, в котором активируются ссылки, элементы форм и объекты с помощью клавиши Tab, в основном понятен и логичен.</p></li></ul>",
  "_STEP_9_2_4_3_HOW_CHECKED_16_": "<h4 id=\"_nicht_voll_erfüllt\">Не полностью выполнено</h4>",
  "_STEP_9_2_4_3_HOW_CHECKED_17_": "<ul><li><p>Последовательность переходов по Tab не логична, она отклоняется без понятной причины от визуального расположения, или фокус клавиатуры не виден в течение более чем трех последовательных остановок в окне браузера.</p></li><li><p>Псевдоокна, которые вставляются вне нормального порядка исходного кода, например, в конце страницы, не получают фокус сразу или при следующем нажатии Tab.</p></li><li><p>При закрытии псевдоокон фокус не возвращается на активирующий элемент.</p></li></ul>",
  "_STEP_9_2_4_3_HOW_CHECKED_18_": "<h4 id=\"_nicht_erfüllt\">Не выполнено</h4>",
  "_STEP_9_2_4_3_HOW_CHECKED_19_": "<ul><li><p>Порядок, в котором активируются ссылки, элементы форм и объекты с помощью клавиши Tab, непонятен и значительно затрудняет управление с клавиатуры.</p></li></ul>",
  "_STEP_9_2_4_3_SOURCES_1_": "<ul><li><p>Knowbility: <a href=\"https://knowbility.org/blog/2020/accessible-slide-menus\">Let’s Focus on Slide-Out Navigation</a> (March 2020)</p></li></ul>",
  "_STEP_9_2_4_3_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Разграничение с другими этапами проверки</h3>",
  "_STEP_9_2_4_3_CLASSIFICATION_2_": "<ul><li><p>На этом этапе проверяется <strong>последовательность переходов по Tab</strong>, независимо от того, соответствует ли она расположению фокусируемых элементов в исходном коде или создается с помощью <code>tabindex</code> и скриптов.</p></li><li><p>Основная <strong>доступность</strong> и <strong>способность к активации</strong> интерактивных элементов рассматривается на этапе 9.2.1.1 \"Без использования мыши\".</p></li><li><p><strong>Видимость</strong> фокуса рассматривается на этапе 9.2.4.7 \"Четкое указание текущего положения фокуса\".</p></li><li><p>Здесь проверяется правильное <strong>положение</strong> отображаемых или вставляемых содержимого. То, насколько содержимое само по себе является разумным, рассматривается в других критериях, таких как 9.3.3.3 \"Помощь при ошибках\" или 9.2.4.4 \"Информативные тексты ссылок\".</p></li></ul>",
  "_STEP_9_2_4_3_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация этапа проверки по WCAG 2.1</h3>",
  "_STEP_9_2_4_3_CLASSIFICATION_4_": "<h4 id=\"_guideline\">Руководство</h4>",
  "_STEP_9_2_4_3_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#navigable\"> Руководство 2.4 Навигационное: Обеспечьте способы помощи пользователям в навигации, поиске контента и определении их местоположения</a></p></li></ul>",
  "_STEP_9_2_4_3_CLASSIFICATION_6_": "<h4 id=\"_success_criterion\">Критерии успеха</h4>",
  "_STEP_9_2_4_3_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#focus-order\"> 2.4.3 Порядок фокусировки</a> (Уровень A)</p></li></ul>",
  "_STEP_9_2_4_3_CLASSIFICATION_8_": "<h4 id=\"_techniques\">Техники</h4>",
  "_STEP_9_2_4_3_CLASSIFICATION_9_": "<h5 id=\"_general_techniques\">Общие техники</h5>",
  "_STEP_9_2_4_3_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G59.html\"> G59: Размещение интерактивных элементов в порядке, следующем последовательности и связям в контенте</a></p></li></ul>",
  "_STEP_9_2_4_3_CLASSIFICATION_11_": "<h5 id=\"_html_techniques\">HTML техники</h5>",
  "_STEP_9_2_4_3_CLASSIFICATION_12_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H4.html\"> H4: Создание логичного порядка переходов через ссылки, элементы управления формами и объекты</a></p></li></ul>",
  "_STEP_9_2_4_3_CLASSIFICATION_13_": "<h5 id=\"_scripting_techniques\">Техники скриптования</h5>",
  "_STEP_9_2_4_3_CLASSIFICATION_14_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/client-side-script/SCR26.html\"> SCR26: Вставка динамического содержимого в Модель Объектов Документа сразу после его активирующего элемента</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/client-side-script/SCR37.html\"> SCR37: Создание пользовательских диалогов независимым от устройства способом</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/client-side-script/SCR27.html\"> SCR27: Переупорядочение разделов страницы с помощью Модели Объектов Документа</a></p></li></ul>",
  "_STEP_9_2_4_3_CLASSIFICATION_15_": "<h5 id=\"_failures\">Недостатки</h5>",
  "_STEP_9_2_4_3_CLASSIFICATION_16_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F44.html\"> F44: Ошибка критерия успеха 2.4.3 из-за использования tabindex для создания порядка переходов, который не сохраняет смысл и работоспособность</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F85.html\"> F85: Ошибка критерия успеха 2.4.3 из-за использования диалогов или меню, которые не расположены рядом с их управляющим элементом в последовательном порядке навигации</a></p></li></ul>"
}