{
  "_STEP_6_5_4_NAME_": "Синхронность при видеотелефонии",
  "_STEP_6_5_4_NAME_MENU_": "6.5.4 Синхронность при видеотелефонии",
  "_STEP_6_5_4_WHAT_CHECKED_1_": "<p>Если веб-приложение поддерживает видеотелефонию, разница во времени между аудио и видео не должна превышать 100 миллисекунд.</p>",
  "_STEP_6_5_4_WHY_CHECKED_1_": "<p>Понимание видеотелефонии сильно ухудшается, если изображение и звук передаются не одновременно. Жесты и мимика говорящего тогда не соответствуют услышанной речи. Людям с когнитивными нарушениями, глухим и людям с ограниченными слуховыми возможностями может быть сложнее общаться с помощью несинхронной видеотелефонии. Чтобы лучше следить за разговором, полезно видеть губы говорящего одновременно со звуком. Однако эмпирических исследований по этому вопросу нам не известно, и мы приветствуем любые указания на это.</p>",
  "_STEP_6_5_4_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_6_5_4_HOW_CHECKED_2_": "<p>Этап проверки применим, если веб-приложение поддерживает видеотелефонию с передачей звука.</p>",
  "_STEP_6_5_4_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_6_5_4_HOW_CHECKED_4_": "<p>Разница во времени между аудио и видео при передаче видеотелефонии не должна превышать 100 миллисекунд, значимые различия следует избегать.</p>",
  "_STEP_6_5_4_HOW_CHECKED_5_": "<p>Одновременная передача звука и изображения (или асинхронность, то есть когда изображение и звук не передаются одновременно) может быть проверена с помощью тестового видеозвонка. Для этого веб-приложение должно быть открыто в браузере на двух разных тестовых устройствах.</p>",
  "_STEP_6_5_4_HOW_CHECKED_6_": "<ol><li><p>Открыть веб-приложение на двух устройствах в браузере</p></li><li><p>Установить видеотелефонную связь между обоими приложениями</p></li><li><p>Проверить синхронность между речью и видео (синхронизация движения губ). Заметна ли разница во времени?</p></li></ol>",
  "_STEP_6_5_4_HOW_CHECKED_7_": "<p>Для получения надежного результата испытание передачи должно быть повторено.</p>",
  "_STEP_6_5_4_HOW_CHECKED_8_": "<h4 id=\"_hinweise\">Замечания</h4>",
  "_STEP_6_5_4_HOW_CHECKED_9_": "<ul><li><p>Исследования показывают, что понимание значительно снижается, если видео отстает от аудио, нежели наоборот. Этот факт можно соответствующим образом учитывать и отмечать при оценке.</p></li><li><p>Для минимизации задержек в сетевой инфраструктуре оба устройства должны быть подключены к стабильному интернету с достаточной пропускной способностью.</p></li></ul>",
  "_STEP_6_5_4_HOW_CHECKED_10_": "<p>Для получения указаний по этому этапу проверки, например для точного измерения временной разницы, вы можете создать <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">запрос на GitHub</a>.</p>",
  "_STEP_6_5_4_SOURCES_1_": "<ul><li><p>В настоящее время нет источников.</p></li></ul>",
  "_STEP_6_5_4_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_6_5_4_CLASSIFICATION_2_": "<h4 id=\"_6_5_4_synchronization_between_audio_and_video\">6.5.4 Синхронизация аудио и видео</h4>",
  "_STEP_6_5_4_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where ICT that provides two-way voice communication includes real-time video functionality, the ICT shall ensure a maximum time difference of 100 ms between the speech and video presented to the user.</p><p>NOTE: Recent research shows that, if audio leads the video, the intelligibility suffers much more than the reverse.</p></div></div>"
}