{
  "_STEP_6_2_2_2_NAME_": "Programmatisch unterscheidbare Anzeige von Textnachrichten",
  "_STEP_6_2_2_2_NAME_MENU_": "6.2.2.2 Programmatisch unterscheidbare Anzeige von Textnachrichten",
  "_STEP_6_2_2_2_WHAT_CHECKED_1_": "<p>Wenn die Web-Anwendung eine Funktion zur Echtzeit Textkommunikation (RTT, Real-Time Text) anbietet, soll die Sende- und Empfangsrichtung programmatisch ermittelbar sein. Das bedeutet konkret, dass Hilfsmittel-Nutzende beim Lesen der Text-Kommunikation die selbst gesendeten Texte von empfangenen Texten unterscheiden können.</p>",
  "_STEP_6_2_2_2_WHY_CHECKED_1_": "<p>Wenn Menschen, die Hilfsmittel wie Screenreader einsetzen, die Äußerungen in einer Kommunikation lesen wollen, müssen sie eigene Text-Beiträge von denen anderer unterscheiden können. Darum muss die Sende- und Empfangsrichtung programmatisch ermittelbar sein. (Darüber hinaus ist es auch sinnvoll, programmatisch zwischen empfangenen Texten von verschiedenen Teilnehmenden unterscheiden zu können.)</p>",
  "_STEP_6_2_2_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_6_2_2_2_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn die Web-Anwendung Echtzeit-Textkommunikation (RTT, Real-Time Text) senden und empfangen kann.</p>",
  "_STEP_6_2_2_2_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_6_2_2_2_HOW_CHECKED_4_": "<h4 id=\"_2_1_quelltext_prüfung\">2.1 Quelltext-Prüfung</h4>",
  "_STEP_6_2_2_2_HOW_CHECKED_5_": "<ol><li><p>Web-Anwendung öffnen</p></li><li><p>In den Developer Tools des Browsers prüfen, ob die gesendeten und empfangenen Textnachrichten semantisch voneinander unterscheidbar sind. Dazu kann z. B. im HTML-Quelltext die jeweilige Verfasser:innen mit Uhrzeit genannt werden. Die unterscheidenden Merkmale (etwa Nutzer-Namen oder Kürzel) dürfen dabei nicht vor Hilfsmitteln versteckt sein, etwa über ´display:none´ oder ´aria-hidden=true´.</p></li></ol>",
  "_STEP_6_2_2_2_HOW_CHECKED_6_": "<h4 id=\"_2_2_zusätzliche_prüfung_mittels_screenreader\">2.2 Zusätzliche Prüfung mittels Screenreader</h4>",
  "_STEP_6_2_2_2_HOW_CHECKED_7_": "<ol><li><p>Screenreader starten</p></li><li><p>die zu prüfende Web-Anwendung mit der Ansicht für die Echtzeit-Textkommunikation aufrufen</p></li><li><p>einige Testnachrichten senden und empfangen (ggf. zweites Gerät notwendig)</p></li><li><p>die Textnachrichten antippen bzw. mit dem Screenreader zu diesen navigieren</p></li><li><p>auf die Ausgabe des Screenreaders achten. Wird die Unterscheidung zwischen eigenen und fremden Textbeiträgen unterstützt?</p></li></ol>",
  "_STEP_6_2_2_2_HOW_CHECKED_8_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_6_2_2_2_HOW_CHECKED_9_": "<ul><li><p>Bei Echtzeit-Textkommunkation (RTT, Real-Time Text) erscheint der Text beim Empfänger dynamisch schon während der Eingabe des Senders. RTT ist also nicht das Gleiche wie etwa Chat, wo Nachrichten explizit abgeschickt werden und erst dann beim Empfänger erscheinen.</p></li><li><p>Die Anforderung verlangt streng genommen nur die Unterscheidung der Senderichtung, sie verlangt also nicht, dass empfangene Textnachrichten verschiedener Teilnehmer unterscheidbar sind. In der Praxis wird jedoch anzunehmen sein, dass bei allen Echtzeit-Textbeiträgen der jeweilige Sender über einen Namen bzw. Kürzel identifizierbar ist und somit auch empfangene Textnachrichten von verschiedenen Teilnehmenden unterscheidbar sind.</p></li></ul>",
  "_STEP_6_2_2_2_HOW_CHECKED_10_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_6_2_2_2_HOW_CHECKED_11_": "<h4 id=\"_erfüllt\">Erfüllt</h4>",
  "_STEP_6_2_2_2_HOW_CHECKED_12_": "<p>Die Eingaben des Nutzers selbst und die empfangenen Echtzeit-Texteingaben anderer Nutzer sind programmatisch unterscheidbar, z.B. über einen Präfix.</p>",
  "_STEP_6_2_2_2_HOW_CHECKED_13_": "<h4 id=\"_eher_erfüllt\">Eher erfüllt</h4>",
  "_STEP_6_2_2_2_HOW_CHECKED_14_": "<p>Die Eingaben des Nutzers selbst von empfangenen Echtzeit-Texteingaben anderer Nutzer sind programmatisch unterscheidbar, die anderen Nutzer sind aber nicht unterscheidbar.</p>",
  "_STEP_6_2_2_2_HOW_CHECKED_15_": "<h4 id=\"_nicht_erfüllt\">Nicht erfüllt</h4>",
  "_STEP_6_2_2_2_HOW_CHECKED_16_": "<p>Es gibt beim Lesen der Echtzeit-Texteingaben einer Kommunikation keine Möglichkeit, programmatisch zwischen eigenen und fremden Eingaben zu unterscheiden.</p>",
  "_STEP_6_2_2_2_SOURCES_1_": "<ul><li><p><a href=\"https://labs.etsi.org/rep/HF/en301549/uploads/272bede3724c5c99efe777f778201f70/tr_103708v010101p.pdf\">Human Factors (HF); Real-Time Text (RTT) in Multiparty Conference Calling / ETSI TR 103 708 V1.1.1 (2022-08)</a></p></li></ul>",
  "_STEP_6_2_2_2_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Einordnung des Prüfschritts nach EN 301 549 V3.2.1</h3>",
  "_STEP_6_2_2_2_CLASSIFICATION_2_": "<h4 id=\"_6_2_2_2_programmatically_determinable_send_and_receive_direction\">6.2.2.2 Programmatically determinable send and receive direction</h4>",
  "_STEP_6_2_2_2_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where ICT has RTT send and receive capabilities, the send/receive direction of transmitted/received text shall be programmatically determinable, unless the RTT is implemented as closed functionality.</p><p>NOTE: This enables screen readers to distinguish between incoming text and outgoing text when used with RTT functionality.</p></div></div>"
}