{
  "_STEP_6_2_2_2_NAME_": "Программно различимое отображение текстовых сообщений",
  "_STEP_6_2_2_2_WHAT_CHECKED_1_": "<p>Если веб-приложение предлагает функцию текстовой коммуникации в реальном времени (RTT, Real-Time Text), направления отправки и получения должны быть программно определяемыми. Это означает, что пользователи вспомогательных технологий при чтении текстовой коммуникации могут различать тексты, отправленные ими, и тексты, полученные от других.</p>",
  "_STEP_6_2_2_2_WHY_CHECKED_1_": "<p>Люди, использующие вспомогательные технологии, такие как экранные дикторы, должны иметь возможность различать свои текстовые сообщения от сообщений других участников. Поэтому направление отправки и получения должно быть программно определяемым. (Кроме того, полезно иметь возможность программно различать полученные тексты от разных участников.)</p>",
  "_STEP_6_2_2_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_6_2_2_2_HOW_CHECKED_2_": "<p>Этап проверки применим, если веб-приложение может отправлять и получать текстовую коммуникацию в реальном времени (RTT, Real-Time Text).</p>",
  "_STEP_6_2_2_2_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_6_2_2_2_HOW_CHECKED_4_": "<h4 id=\"_2_1_quelltext_prüfung\">2.1 Проверка исходного кода</h4>",
  "_STEP_6_2_2_2_HOW_CHECKED_5_": "<ol><li><p>Открыть веб-приложение.</p></li><li><p>Используя инструменты разработчика в браузере, проверить, различимы ли программно отправленные и полученные текстовые сообщения. Например, в HTML-коде должны быть указаны отправители с указанием времени. Отличительные признаки (например, имена пользователей или инициалы) не должны быть скрыты от вспомогательных технологий, например, через 'display:none' или 'aria-hidden=true'.</p></li></ol>",
  "_STEP_6_2_2_2_HOW_CHECKED_6_": "<h4 id=\"_2_2_zusätzliche_prüfung_mittels_screenreader\">2.2 Дополнительная проверка с использованием экранного диктора</h4>",
  "_STEP_6_2_2_2_HOW_CHECKED_7_": "<ol><li><p>Запустить экранный диктор.</p></li><li><p>Открыть веб-приложение с видом на текстовую коммуникацию в реальном времени.</p></li><li><p>Отправить и получить несколько тестовых сообщений (возможно, потребуется второе устройство).</p></li><li><p>Коснуться текстовых сообщений или переместиться к ним с помощью экранного диктора.</p></li><li><p>Обратить внимание на вывод экранного диктора. Поддерживается ли различение между собственными и чужими текстовыми сообщениями?</p></li></ol>",
  "_STEP_6_2_2_2_HOW_CHECKED_8_": "<h3 id=\"_3_hinweise\">3. Примечания</h3>",
  "_STEP_6_2_2_2_HOW_CHECKED_9_": "<ul><li><p>В режиме текстовой коммуникации в реальном времени (RTT) текст появляется у получателя динамически во время ввода отправителем. RTT не то же самое, что чат, где сообщения отправляются явно и появляются у получателя только после отправки.</p></li><li><p>Требование строго говоря касается только различия направлений отправки, то есть не требует, чтобы было возможно различать текстовые сообщения разных участников. Однако на практике можно предположить, что все участники текстовой коммуникации в реальном времени будут идентифицированы по имени или инициалам, что делает возможным различие текстовых сообщений от разных участников.</p></li></ul>",
  "_STEP_6_2_2_2_HOW_CHECKED_10_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_6_2_2_2_HOW_CHECKED_11_": "<h4 id=\"_erfüllt\">Выполнено</h4>",
  "_STEP_6_2_2_2_HOW_CHECKED_12_": "<p>Вводимые пользователем данные и полученные текстовые сообщения других пользователей программно различимы, например, через префикс.</p>",
  "_STEP_6_2_2_2_HOW_CHECKED_13_": "<h4 id=\"_eher_erfüllt\">Частично выполнено</h4>",
  "_STEP_6_2_2_2_HOW_CHECKED_14_": "<p>Вводимые пользователем данные отличимы от полученных текстовых сообщений других пользователей, но другие пользователи не различимы.</p>",
  "_STEP_6_2_2_2_HOW_CHECKED_15_": "<h4 id=\"_nicht_erfüllt\">Не выполнено</h4>",
  "_STEP_6_2_2_2_HOW_CHECKED_16_": "<p>При чтении текстовой коммуникации в реальном времени нет возможности программно различать собственные и чужие вводы.</p>",
  "_STEP_6_2_2_2_SOURCES_1_": "<ul><li><p><a href=\"https://labs.etsi.org/rep/HF/en301549/uploads/272bede3724c5c99efe777f778201f70/tr_103708v010101p.pdf\">Human Factors (HF); Real-Time Text (RTT) in Multiparty Conference Calling / ETSI TR 103 708 V1.1.1 (2022-08)</a></p></li></ul>",
  "_STEP_6_2_2_2_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_6_2_2_2_CLASSIFICATION_2_": "<h4 id=\"_6_2_2_2_programmatically_determinable_send_and_receive_direction\">6.2.2.2 Программно определяемое направление отправки и получения</h4>",
  "_STEP_6_2_2_2_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where ICT has RTT send and receive capabilities, the send/receive direction of transmitted/received text shall be programmatically determinable, unless the RTT is implemented as closed functionality.</p><p>NOTE: This enables screen readers to distinguish between incoming text and outgoing text when used with RTT functionality.</p></div></div>"
}