{
  "_STEP_11_8_5_NAME_": "Шаблоны",
  "_STEP_11_8_5_NAME_MENU_": "11.8.5 Шаблоны",
  "_STEP_11_8_5_WHAT_CHECKED_1_": "<p>Если страница является частью инструмента для авторов и предлагает шаблоны или формы для создания документов, то по крайней мере один из предложенных шаблонов должен позволять создавать доступные веб- или не-веб-документы (в зависимости от типа документа).</p>",
  "_STEP_11_8_5_WHAT_CHECKED_2_": "<p>Если доступны альтернативные шаблоны, шаблоны, оптимизированные для доступности, должны быть четко идентифицированы как таковые.</p>",
  "_STEP_11_8_5_WHY_CHECKED_1_": "<p>(последует)</p>",
  "_STEP_11_8_5_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_11_8_5_HOW_CHECKED_2_": "<p>Этап проверки применим, если страница является частью инструмента для авторов и предлагает шаблоны (например, формы ввода) для создания документов. В тесте BITV можно тестировать только веб-базированные инструменты для авторов, которые создают вывод в веб-формате (например, система управления контентом, веб-вывод которой можно проверить с помощью теста BITV). Для веб-базированных инструментов для авторов, которые не создают HTML-вывод, а, например, PDF, этот этап проверки применим только в сочетании с дополнительной проверкой не-веб-вывода в другом процессе.</p>",
  "_STEP_11_8_5_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_11_8_5_HOW_CHECKED_4_": "<ol><li><p>Открыть инструмент для авторов</p></li><li><p>Проверить, предлагает ли инструмент для авторов различные шаблоны для создания контента.</p></li><li><p>Если при наличии альтернативных шаблонов, поддерживающих создание доступного контента, они четко обозначены как таковые. (Если доступен только один шаблон, его не нужно отдельно маркировать как поддерживающий доступность).</p></li><li><p>Создать тестовые выводы с использованием шаблона, поддерживающего доступность, в противном случае использовать стандартный шаблон.</p></li><li><p>Проверить тестовые выводы на доступность (недостатки дополнительно регистрируются в применимых этапах проверки).</p></li></ol>",
  "_STEP_11_8_5_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Примечания</h3>",
  "_STEP_11_8_5_HOW_CHECKED_6_": "<p>Для практики проверки необходимы дополнительные указания, вы можете <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">открыть вопрос на GitHub</a> по этому этапу проверки.</p>",
  "_STEP_11_8_5_SOURCES_1_": "<ul><li><p>В настоящее время источников нет.</p></li></ul>",
  "_STEP_11_8_5_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_11_8_5_CLASSIFICATION_2_": "<h4 id=\"_11_8_5_templates\">11.8.5 Шаблоны</h4>",
  "_STEP_11_8_5_CLASSIFICATION_3_": "<p>Когда инструмент для авторов предоставляет шаблоны, по крайней мере один шаблон, который поддерживает создание контента, соответствующего требованиям пунктов 9 (веб) или 10 (не-веб-документы), должен быть доступен и обозначен как таковой.</p>"
}