{
  "_STEP_7_2_1_NAME_": "Воспроизведение аудиоописания",
  "_STEP_7_2_1_WHAT_CHECKED_1_": "<p>Если на веб-сайте присутствуют видео с синхронной видео- и звуковой дорожкой и доступна альтернативная версия с аудиоописанием, существует механизм для выбора и воспроизведения доступного аудиоописания.</p>",
  "_STEP_7_2_1_WHAT_CHECKED_2_": "<p>Для выбора версии с аудиоописанием используемый плеер должен иметь соответствующий элемент управления AD или предоставлять возможность активировать звуковую дорожку с аудиоописанием в настройках языка. В качестве альтернативы версия с аудиоописанием может также предлагаться в непосредственном контексте плеера.</p>",
  "_STEP_7_2_1_WHY_CHECKED_1_": "<p>Если для визуального контента видео предлагаются описания этих визуальных контентов в версии с аудиоописанием, эта версия должна быть выбрана или включена.</p>",
  "_STEP_7_2_1_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_7_2_1_HOW_CHECKED_2_": "<p>Этап проверки применим, если на веб-сайте есть одно или несколько записанных видео с синхронной видео- и звуковой дорожкой, и для этих видео доступны альтернативы с аудиоописанием.</p>",
  "_STEP_7_2_1_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_7_2_1_HOW_CHECKED_4_": "<ol><li><p>Воспроизвести видео в плеере на веб-сайте.</p></li><li><p>Проверить, предлагает ли плеер элемент управления, который позволяет включать и выключать аудиоописание.</p></li><li><p>Если кнопка аудиоописания отсутствует, проверить, можно ли выбрать аудиоописание из нескольких звуковых дорожек.</p></li></ol>",
  "_STEP_7_2_1_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Советы</h3>",
  "_STEP_7_2_1_HOW_CHECKED_6": "<ul><li><p>Загрузка второго видео с аудиоописанием (при активации кнопки AD) или предоставление аудиоописания с помощью второго видео через второй плеер не оценивается отрицательно.</p></li><li><p>Если все важные информации о сцене уже передаются через аудиодорожку, аудиоописание и кнопка AD не требуются.</p></li><li><p>Требование 7.2.1 допускает выбор аудиоописания из нескольких звуковых дорожек. Однако требование 7.3 требует, чтобы элементы управления активацией аудиоописания находились на том же уровне взаимодействия, что и элементы управления воспроизведением (например, воспроизведение, пауза, громкость и т. д.).</p></li><li><p>Если выполнено требование 7.3 «Элементы управления для субтитров и аудиоописания», то выполнено и требование 7.2.1 «Воспроизведение аудиоописания» (этот шаг проверки).</p></li></ul>",
  "_STEP_7_2_1_HOW_CHECKED_7": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_7_2_1_HOW_CHECKED_8": "<h4 id=\"_nicht_erfüllt\">Не выполнено:</h4>",
  "_STEP_7_2_1_HOW_CHECKED_9": "<ul><li><p>Видеоплеер не предоставляет возможности включить аудиоописание.</p></li></ul>",
  "_STEP_7_2_1_SOURCES_1": "<ul><li><p>В настоящее время нет источников.</p></li></ul>",
  "_STEP_7_2_1_CLASSIFICATION_1": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Различия с другими шагами проверки</h3>",
  "_STEP_7_2_1_CLASSIFICATION_2": "<p>Этот шаг проверки требует, чтобы в случаях, когда для видео предоставляются версии с аудиоописанием, были предложены элементы управления для включения и выключения аудиоописания. В шаге проверки 9.1.2.5 «Аудиоописание для видео» проверяется, предоставляется ли аудиоописание для содержимого видео, которое передается только через изображения. Там речь идет о содержательной оценке.</p>",
  "_STEP_7_2_1_CLASSIFICATION_3": "<p>Если 9.1.2.5 оценен отрицательно (необходимое аудиоописание отсутствует), этот шаг проверки не применим. 7.2.1 применим только в случае, если предложено аудиоописание.</p>",
  "_STEP_7_2_1_CLASSIFICATION_4": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация шага проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_7_2_1_CLASSIFICATION_5": "<h4 id=\"_7_2_1_audio_description_playback\">7.2.1 Воспроизведение аудиоописания</h4>",
  "_STEP_7_2_1_CLASSIFICATION_6_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where ICT displays video with synchronized audio, it shall provide a mechanism to select and play available audio description to the default audio channel.</p><p>Where video technologies do not have explicit and separate mechanisms for audio description, an ICT is deemed to satisfy this requirement if the ICT enables the user to select and play several audio tracks.</p><p>NOTE 1: In such cases, the video content can include the audio description as one of the available audio tracks.</p><p>NOTE 2: Audio descriptions in digital media sometimes include information to allow descriptions that are longer than the gaps between dialogue. Support in digital media players for this \"extended audio description\" feature is useful, especially for digital media that is viewed personally.</p></div></div>"
}