{
  "_STEP_12_1_2_NAME_": "Barrierefreie Dokumentation",
  "_STEP_12_1_2_NAME_MENU_": "12.1.2 Barrierefreie Dokumentation",
  "_STEP_12_1_2_WHAT_CHECKED_1_": "<p>Die Produkt-Dokumentation eines Web-Angebots enthält Hilfestellungen für die allgemeine Nutzung von Funktionen des Angebots, aber oft auch Hinweise auf zusätzliche Funktionen, welche die Barrierefreiheit für bestimmte Nutzergruppen verbessern. Auch die Erklärung zur Barrierefreiheit ist eine Produkt-Dokumentation.</p>",
  "_STEP_12_1_2_WHAT_CHECKED_2_": "<p>Wenn ein Web-Angebot eine Produkt-Dokumentation bereitstellt, soll diese mindestens in einer der folgenden Formate barrierefrei zur Verfügung gestellt werden:</p>",
  "_STEP_12_1_2_WHAT_CHECKED_3_": "<ul><li><p>Als Web-Dokument, erfüllt Kriterien der EN 301 549 Kapitel 9</p></li><li><p>Als Nicht-Web-Dokument (u. a. PDF), erfüllt Kriterien der EN 301 549 Kapitel 10</p></li></ul>",
  "_STEP_12_1_2_WHAT_CHECKED_4_": "<p>Nicht-Web-Dokumente werden nicht in diesem Prüfverfahren bewertet.</p>",
  "_STEP_12_1_2_WHY_CHECKED_1_": "<p>Die Dokumentation ist ein wichtiger Teil eines Webangebots. So informiert zum Beispiel die \"Erklärung zur Barrierefreiheit\" Menschen mit Behinderungen über den Stand der Barrierefreiheit des Angebots und nennt (noch) nicht barrierefreie Inhalte sowie gegebenenfalls Wege, benötigte Informationen in anderer Form zu erhalten. Es ist deshalb wichtig, dass diese Erklärung barrierefrei ist. Sie wird deshalb, wenn vorhanden, immer geprüft. Dies gilt auch für weitere Seiten zur Dokumentation des Webangebots, wenn vorhanden.</p>",
  "_STEP_12_1_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_12_1_2_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn eine Produkt-Dokumentation angeboten wird. Dazu gehört auch die Erklärung zur Barrierefreiheit. Als Produkt-Dokumentation gilt die technische Dokumentation von Funktionen des Angebots (etwa Tastaturkurzbefehle oder Hinweise zur Nutzung mit Hilfsmitteln). Inhaltliche Hilfe, etwa in FAQs (Frequently Asked Questions) gelten hierbei nicht als Produkt-Dokumentation.</p>",
  "_STEP_12_1_2_HOW_CHECKED_3_": "<p>Die Prüfung der Barrierefreiheit von nicht-web-basierter Dokumentation (etwa von PDFs) kann nicht Teil des Prüfverfahrens sein, sie muss in einem separaten Auftrag erfolgen.</p>",
  "_STEP_12_1_2_HOW_CHECKED_4_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_12_1_2_HOW_CHECKED_5_": "<p>Je nach den gegebenen Voraussetzungen (siehe \"3. Hinweise\") muss die Dokumentation nicht Teil der Seitenauswahl sein. Die Prüfung erfolgt dann wie unter 2.2 beschrieben.</p>",
  "_STEP_12_1_2_HOW_CHECKED_6_": "<h4 id=\"_2_1_prüfung_der_dokumentation_teil_der_seitenauswahl\">2.1 Prüfung der Dokumentation (Teil der Seitenauswahl)</h4>",
  "_STEP_12_1_2_HOW_CHECKED_7_": "<ol><li><p>Prüfen, ob sämtliche anwendbaren Prüfschritte des Verfahrens mit \"konform\" bewertet worden sind.</p></li><li><p>Ist dies der Fall, ist auch dieser Prüfschritt konform.</p></li></ol>",
  "_STEP_12_1_2_HOW_CHECKED_8_": "<h4 id=\"_2_2_prüfung_der_dokumentation_nicht_teil_der_seitenauswahl\">2.2 Prüfung der Dokumentation (nicht Teil der Seitenauswahl)</h4>",
  "_STEP_12_1_2_HOW_CHECKED_9_": "<ol><li><p>Ist die Dokumentation nicht Teil der Seitenauswahl (siehe Erläuterungen unter \"3. Hinweise\"), prüfen, ob für die seitenübergreifenden Bereiche (z.B. Kopf- und   Fußbereich) sämtliche anwendbaren Prüfschritte des Verfahrens mit konform bewertet wurden.</p></li><li><p>Für den Inhaltsbereich der Seite prüfen, ob sämtliche anwendbaren Prüfschritte des Verfahrens mit konform bewertet wurden (in der Regel handelt es sich bei sehr einfachen Seiten um die Prüfung der Struktur und gegebenenfalls die Tastaturbedienbarkeit).</p></li></ol>",
  "_STEP_12_1_2_HOW_CHECKED_10_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_12_1_2_HOW_CHECKED_11_": "<ul><li><p>Die Dokumentation muss nicht zwingend Teil der Seitenauswahl sein, wenn Folgendes gegeben ist:</p><ul><li><p>Der Seitentyp ist bereits in der Seitenauswahl abgedeckt.</p></li><li><p>Seitenübergreifende Bereiche (Kopf- und Fußbereich) sind mit den anderen Seiten der Seitenauswahl identisch und bereits geprüft worden.</p></li><li><p>Der Inhaltsbereich ist sehr einfach (es handelt sich beispielsweise nur um strukturierten Text und Links).</p></li></ul></li><li><p>Ist die Dokumentation komplexer oder als weiterer Seitentyp einzustufen, wird sie als eine weitere Seite in die Seitenauswahl aufgenommen. Wenn eine weitere web-basierte Dokumentation zum Web-Angebot vorhanden ist, soll auch diese in die Seitenauswahl bzw. Prüfung einbezogen werden.</p></li><li><p>Der Prüfschritt schließt nicht die Möglichkeit aus, alternative Formate anzubieten, die die Bedürfnisse einer bestimmten Nutzergruppe erfüllen (z. B. Braille-Dokumente für blinde Menschen oder Informationen in leichter Sprache für Personen mit eingeschränkter Kognition, Sprache und Lernfähigkeit).</p></li></ul>",
  "_STEP_12_1_2_HOW_CHECKED_12_": "<p>Für weitere Hinweise zu diesem Prüfschritt können Sie auf GitHub <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">ein Issue eröffnen</a>.</p>",
  "_STEP_12_1_2_SOURCES_1_": "<ul><li><p>Zurzeit keine Quellen.</p></li></ul>",
  "_STEP_12_1_2_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Einordnung des Prüfschritts nach EN 301 549 V3.2.1</h3>",
  "_STEP_12_1_2_CLASSIFICATION_2_": "<h4 id=\"_12_1_2_accessible_documentation\">12.1.2 Accessible documentation</h4>",
  "_STEP_12_1_2_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Product documentation provided with the ICT shall be made available in at least one of the following electronic formats:</p><ul><li><p>a Web format that conforms to the requirements of clause 9; or</p></li><li><p>a non-web format that conforms to the requirements of clause 10.</p></li></ul><p>NOTE 1: This does not preclude the possibility of also providing the product documentation in other formats (electronic, printed or audio) that are not accessible.</p><p>NOTE 2: It also does not preclude the possibility of providing alternate formats that meet the needs of some specific type of users (e.g. Braille documents for blind people or easy-to-read information for persons with limited cognitive, language and learning abilities).</p><p>NOTE 3: Where documentation is incorporated into the ICT, the documentation falls under the requirements for accessibility in the present document.</p><p>NOTE 4: A user agent that supports automatic media conversion would be beneficial to enhancing accessibility.</p></div></div>"
}