{
  "_STEP_12_1_2_NAME_": "Доступная документация",
  "_STEP_12_1_2_NAME_MENU_": "12.1.2 Доступная документация",
  "_STEP_12_1_2_WHAT_CHECKED_1_": "<p>Документация продукта веб-приложения включает рекомендации по общему использованию функций приложения, но часто также указания на дополнительные функции, которые улучшают доступность для определенных групп пользователей. К такой документации также относится 'Заявление о доступности'.</p>",
  "_STEP_12_1_2_WHAT_CHECKED_2_": "<p>Если веб-приложение предоставляет документацию продукта, она должна быть доступна по крайней мере в одном из следующих форматов:</p>",
  "_STEP_12_1_2_WHAT_CHECKED_3_": "<ul><li><p>Как веб-документ, соответствующий критериям главы 9 EN 301 549</p></li><li><p>Как не веб-документ (включая PDF), соответствующий критериям главы 10 EN 301 549</p></li></ul>",
  "_STEP_12_1_2_WHAT_CHECKED_4_": "<p>Не веб-документы не оцениваются в рамках этой процедуры проверки.</p>",
  "_STEP_12_1_2_WHY_CHECKED_1_": "<p>Документация является важной частью веб-приложения. Например, 'Заявление о доступности' информирует людей с ограниченными возможностями о уровне доступности приложения и упоминает (еще) не доступные контенты, а также, при необходимости, пути получения необходимой информации в другой форме. Поэтому важно, чтобы это заявление было доступно. Оно всегда проверяется, если присутствует. Это также относится к другим страницам документации веб-приложения, если они присутствуют.</p>",
  "_STEP_12_1_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_12_1_2_HOW_CHECKED_2_": "<p>Этот этап проверки применим, если предоставляется документация продукта. Это включает в себя заявление о доступности. Под документацией продукта понимается техническая документация функций приложения (например, горячие клавиши или рекомендации по использованию с вспомогательными технологиями). Содержательная помощь, такая как вопросы и ответы (FAQ), здесь не считается технической документацией.</p>",
  "_STEP_12_1_2_HOW_CHECKED_3_": "<p>Проверка доступности не веб-основанной документации (например, PDF) не может быть частью процедуры проверки, она должна выполняться отдельно.</p>",
  "_STEP_12_1_2_HOW_CHECKED_4_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_12_1_2_HOW_CHECKED_5_": "<p>В зависимости от данной ситуации (см. '3. Замечания') документация не обязательно должна быть частью выбора страниц. В этом случае проверка проводится как описано в пункте 2.2.</p>",
  "_STEP_12_1_2_HOW_CHECKED_6_": "<h4 id=\"_2_1_prüfung_der_dokumentation_teil_der_seitenauswahl\">2.1 Проверка документации (часть выбора страниц)</h4>",
  "_STEP_12_1_2_HOW_CHECKED_7_": "<ol><li><p>Проверить, оценивались ли все применимые этапы процедуры как 'соответствует'.</p></li><li><p>Если это так, этот этап проверки также соответствует.</p></li></ol>",
  "_STEP_12_1_2_HOW_CHECKED_8_": "<h4 id=\"_2_2_prüfung_der_dokumentation_nicht_teil_der_seitenauswahl\">2.2 Проверка документации (не часть выбора страниц)</h4>",
  "_STEP_12_1_2_HOW_CHECKED_9_": "<ol><li><p>Если документация не входит в выбор страниц (см. пояснения в '3. Замечания'), проверьте, были ли все применимые этапы процедуры для межстраничных областей (например, заголовок и подвал) оценены как соответствующие.</p></li><li><p>Для содержательной части страницы проверьте, были ли все применимые этапы процедуры оценены как соответствующие (обычно это касается проверки структуры и, возможно, управления с клавиатуры).</p></li></ol>",
  "_STEP_12_1_2_HOW_CHECKED_10_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_12_1_2_HOW_CHECKED_11_": "<ul><li><p>Документация не обязательно должна быть частью выбора страниц, если присутствуют следующие условия:</p><ul><li><p>Тип страницы уже охвачен выбором страниц.</p></li><li><p>Межстраничные области (заголовок и подвал) идентичны другим страницам выбора и уже проверены.</p></li><li><p>Содержательная область очень проста (например, только структурированный текст и ссылки).</p></li></ul></li><li><p>Если документация более сложная или классифицируется как другой тип страницы, она включается в выбор страниц как дополнительная страница. Если существует дополнительная веб-документация для веб-приложения, она также должна быть включена в выбор и проверку страниц.</p></li><li><p>Этот этап проверки не исключает возможность предложения альтернативных форматов, которые удовлетворяют потребности определенной группы пользователей (например, документы шрифтом Брайля для слепых людей или информация на простом языке для лиц с ограниченными когнитивными, языковыми и обучаемыми способностями).</p></li></ul>",
  "_STEP_12_1_2_HOW_CHECKED_12_": "<p>Для получения дополнительных сведений по этому этапу проверки вы можете создать запрос на GitHub <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">здесь</a>.</p>",
  "_STEP_12_1_2_SOURCES_1_": "<ul><li><p>В настоящее время нет источников.</p></li></ul>",
  "_STEP_12_1_2_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки согласно EN 301 549 V3.2.1</h3>",
  "_STEP_12_1_2_CLASSIFICATION_2_": "<h4 id=\"_12_1_2_accessible_documentation\">12.1.2 Доступная документация</h4>",
  "_STEP_12_1_2_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Product documentation provided with the ICT shall be made available in at least one of the following electronic formats:</p><ul><li><p>a Web format that conforms to the requirements of clause 9; or</p></li><li><p>a non-web format that conforms to the requirements of clause 10.</p></li></ul><p>NOTE 1: This does not preclude the possibility of also providing the product documentation in other formats (electronic, printed or audio) that are not accessible.</p><p>NOTE 2: It also does not preclude the possibility of providing alternate formats that meet the needs of some specific type of users (e.g. Braille documents for blind people or easy-to-read information for persons with limited cognitive, language and learning abilities).</p><p>NOTE 3: Where documentation is incorporated into the ICT, the documentation falls under the requirements for accessibility in the present document.</p><p>NOTE 4: A user agent that supports automatic media conversion would be beneficial to enhancing accessibility.</p></div></div>"
}