{
  "_STEP_9_2_4_1_NAME_": "Bereiche überspringbar",
  "_STEP_9_2_4_1_NAME_MENU_": "9.2.4.1 Bereiche überspringbar",
  "_STEP_9_2_4_1_WHAT_CHECKED_1_": "<p>Verschiedene Inhaltsbereiche wie Navigation, Suche oder Seiteninhalt können von Nutzern assistiver Technologien übersprungen werden. Der Seitenaufbau soll unabhängig von der Darstellung deutlich werden. Eine der folgenden Voraussetzungen soll erfüllt sein:</p>",
  "_STEP_9_2_4_1_WHAT_CHECKED_2_": "<ul><li><p>Es werden sinnvolle Bereichsüberschriften (HTML-Strukturelemente <code>h1</code> bis <code>h6</code>) eingesetzt</p></li><li><p>Es sind Sprunglinks vorhanden.</p></li><li><p>HTML5 Elemente zur Auszeichnung von Bereichen (<code>header, nav, main, aside, footer</code>) erschließen den Seitenaufbau sinnvoll.</p></li><li><p>WAI-ARIA <em>document landmarks</em> strukturieren die Seitenbereiche sinnvoll.</p></li></ul>",
  "_STEP_9_2_4_1_WHAT_CHECKED_3_": "<p>Frames und iframes brauchen ein sinnvolles <code>title</code>-Attribut.</p>",
  "_STEP_9_2_4_1_WHY_CHECKED_1_": "<p>Visuell werden Webseiten mit Mitteln wie Überschriften, Spalten oder Kästen strukturiert. Dank dieser Strukturierung weiß der Benutzer, was zusammengehört, kann das Angebot der Webseite leicht überblicken und gezielt auf die Inhalte zugreifen, die ihn interessieren.</p>",
  "_STEP_9_2_4_1_WHY_CHECKED_2_": "<p>Benutzer, die diese visuelle Ordnung nicht nutzen können – zum Beispiel, weil sie blind sind oder nur einen kleinen Ausschnitt der Seite sehen können – sind darauf angewiesen, dass die Struktur unabhängig von der Darstellung auf dem Bildschirm zugänglich und nutzbar ist. Die Verwendung von (oft unsichtbaren) Bereichsüberschriften, Sprunglinks oder HTML5 Elementen zur Auszeichnung von Regionen ist dafür eine wesentliche Voraussetzung.</p>",
  "_STEP_9_2_4_1_WHY_CHECKED_3_": "<p>Bei Frames ist ein sinnvoller Titel wichtig für die Orientierung mit Screenreadern. Gängige Screenreader werten das <code>title</code>- und das in der Programmierung gebräuchliche <code>name</code>-Attribut aus. Dabei wird das <code>title</code>-Attribut vorrangig ausgegeben. Sie sprechen beim Umschalten zwischen den Frames mit den Tastenkürzeln den Titel des aktiven Frames aus.</p>",
  "_STEP_9_2_4_1_WHY_CHECKED_4_": "<p>Der Einsatz von HTML5-Elementen für Regionen wird inzwischen gut von assistiven Technologien unterstützt. Die zusätzliche Berücksichtigung eines role-Attributs (WAI ARIA document landmarks) kann die Unterstützung von Regionen jedoch verbessern.</p>",
  "_STEP_9_2_4_1_WHY_CHECKED_5_": "<p>So können Benutzer die Bereichsüberschriften, Sprunglinks, HTML5-Elemente für Regionen bzw. WAI-ARIA document landmarks anwenden:</p>",
  "_STEP_9_2_4_1_WHY_CHECKED_6_": "<ul><li><p>Konstante Bereiche am Seitenbeginn, etwa Navigation oder Seitenkopf, überspringen, um direkt zum Inhalt zu gelangen</p></li><li><p>Zwischen Bereichen hin- und her wechseln</p></li></ul>",
  "_STEP_9_2_4_1_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_2_4_1_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn es auf der Seite deutlich voneinander abgegrenzte Bereiche gibt, etwa Navigation und Inhalt. Das ist bei informationsorientierten Seiten meist der Fall.</p>",
  "_STEP_9_2_4_1_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_2_4_1_HOW_CHECKED_4_": "<h4 id=\"_2_1_prüfung_der_bereichsüberschriften\">2.1 Prüfung der Bereichsüberschriften</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_5_": "<ol><li><p>Seite im Firefox aufrufen.</p></li><li><p>Über die <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#webdeveloper\"> Web Developer Toolbar</a> die Seite ohne Stylesheets anzeigen (über <em>CSS &gt; Styles deaktivieren &gt; Alle Styles deaktivieren</em> Stylesheets deaktivieren).</p></li><li><p>Das <a href=\"https://webtest.bitv-test.de/bookmarklets.html#gegliedert\"> Bookmarklet \"Inhalte gegliedert\"</a> aufrufen.</p></li><li><p>Die Bereichsüberschriften im Zusammenhang mit den durch sie strukturierten Inhalten ansehen und prüfen, ob sie aussagekräftig sind, die Strukturelemente für Überschriften nutzen, und die Inhaltsbereiche der Seite vollständig und korrekt gliedern.</p></li></ol>",
  "_STEP_9_2_4_1_HOW_CHECKED_6_": "<h4 id=\"_2_2_sprunglink_prüfung\">2.2 Sprunglink-Prüfung</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_7_": "<p>Wenn Sprunglinks vorhanden sind, prüfen, ob die folgenden Anforderungen erfüllt sind:</p>",
  "_STEP_9_2_4_1_HOW_CHECKED_8_": "<ul><li><p>Sprunglinks verschieben beim Auslösen den Tastaturfokus zum angegebenen Bereich (bzw. beim Überspringen von Inhaltsblöcken auf den Inhalt direkt nach dem zu überspringenden Bereich)</p></li><li><p>Sprunglinks sind entweder permanent sichtbar oder werden bei Fokuserhalt eingeblendet</p></li><li><p>Sprunglinks am Seitenbeginn sind die ersten fokussierbaren Elemente der Tabreihenfolge</p></li><li><p>Sprunglinks zum Überspringen von Inhaltsblöcken sind das letzte fokussierbare Element vor dem zu überspringenden Inhaltsblock oder dessen erster Link</p></li></ul>",
  "_STEP_9_2_4_1_HOW_CHECKED_9_": "<h4 id=\"_2_3_prüfung_der_html5_elemente_für_regionen_und_wai_aria_document_landmarks\">2.3 Prüfung der HTML5 Elemente für Regionen und WAI-ARIA document landmarks</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_10_": "<ol><li><p>Seite im Firefox aufrufen.</p></li><li><p>Quelltextanalyse: Prüfen, ob die verschiedenen Seitenbereiche durch die Auszeichnung mit <code>header, nav, main, aside, footer</code> sinnvoll erschlossen werden.</p></li><li><p>Das <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#landmarksbm\"> Landmarks bookmarklet</a> aufrufen. Die document landmarks werden nun, wenn vorhanden, hervorgehoben.</p></li><li><p>Wenn document landmarks eingesetzt werden, prüfen, ob die Zuordnung der Rollen (z. B. <code>navigation, main</code>) korrekt ist und dem Aufbau der Seite entspricht.</p></li><li><p>Sind mehrere Navigationsbereiche nur mit <code>nav</code> oder <code>role=\"navigation\"</code> ausgezeichnet, dann prüfen, ob sie mit <code>aria-label</code> oder <code>aria-labelledby</code> sinnvoll bezeichnet sind.</p></li></ol>",
  "_STEP_9_2_4_1_HOW_CHECKED_11_": "<h4 id=\"_2_4_prüfung_von_frame_titeln\">2.4 Prüfung von Frame-Titeln</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_12_": "<ol><li><p>Seite im Firefox aufrufen.</p></li><li><p>In der Web Developer Toolbar die Funktion <em>Outline &gt; Outline Frames</em> aufrufen.</p></li><li><p>Dann ebenfalls in der Web Developer Toolbar die Funktion <em>Information &gt; Display Element Information</em> aufrufen. Der Cursor wird nun als Fadenkreuz angezeigt.</p></li><li><p>Mit dem Fadenkreuz die Kante der hervorgehobenen Frames anklicken und prüfen, ob für alle Frames ein aussagekräftiger <code>title</code>-Text vorhanden ist.</p></li></ol>",
  "_STEP_9_2_4_1_HOW_CHECKED_13_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_9_2_4_1_HOW_CHECKED_14_": "<h4 id=\"_eigenständige_bereiche\">Eigenständige Bereiche</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_15_": "<p>Eigenständige Bereiche sind zum Beispiel:</p>",
  "_STEP_9_2_4_1_HOW_CHECKED_16_": "<ul><li><p>Navigation und Inhalt</p></li><li><p>Spalten mit unterschiedlichen Inhalten</p></li><li><p>Bereiche, die durch Umrahmung als zusammengehörig gekennzeichnet sind</p></li><li><p>Frames oder iframes</p></li></ul>",
  "_STEP_9_2_4_1_HOW_CHECKED_17_": "<p>Der Fußbereich wird nicht als eigenständiger Bereich gewertet, wenn dort lediglich redundante Links, Copyright-Hinweise oder Angaben zum Erstellungs- oder Änderungsdatum stehen.</p>",
  "_STEP_9_2_4_1_HOW_CHECKED_18_": "<h4 id=\"_hinweis_zu_sprunglinks_und_document_landmarks\">Hinweis zu Sprunglinks und Document Landmarks</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_19_": "<p>Das Fehlen von Sprunglinks und die Nichtverwendung von WAI-ARIA Document Landmarks werden nicht negativ bewertet.</p>",
  "_STEP_9_2_4_1_HOW_CHECKED_20_": "<h4 id=\"_hinweis_zu_mehrfach_verwendeten_landmarks_bzwhtml5_elemente_für_bereiche\">Hinweis zu mehrfach verwendeten Landmarks bzwHTML5-Elemente für Bereiche</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_21_": "<p>Wird eine WAI-ARIA document landmark bzw. ein HTML5-Element für Bereiche mehrfach verwendet (z. B. <code>role=\"navigation\"</code> oder <code>nav</code>), sollte sie mit Hilfe von <code>aria-label</code> oder <code>aria-labelledby</code> aussagekräftig benannt werden.</p>",
  "_STEP_9_2_4_1_HOW_CHECKED_22_": "<h4 id=\"_hinweis_zu_sie_sind_hier_navigationen\">Hinweis zu Sie-sind-hier\"-Navigationen</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_23_": "<p>Gemeint ist die \"Sie-sind-hier\"-Navigation am Seitenanfang (auch breadcrumb trail oder Krümelpfad). Wenn Breadcrumbs als Listen ausgezeichnet sind, brauchen sie einen (eventuell versteckten) vorangestellten Hinweis wie \"Seitenpfad\", \"Sie sind hier\", oder \"Navigationspfad\" um so für Screenreader-Nutzer von anderen Menüs unterscheidbar zu sein.</p>",
  "_STEP_9_2_4_1_HOW_CHECKED_24_": "<h4 id=\"_hinweis_zu_frames_und_iframes\">Hinweis zu Frames und iframes</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_25_": "<p>Im <code>title</code>-Attribut soll der Zweck oder Inhalt, nicht aber die Lage des Frames auf dem Bildschirm angegeben werden (siehe 9.2.4.2 \"Sinnvolle Dokumenttitel\"). Angemessene <code>title</code>-Attribute sind zum Beispiel \"Navigation\" und \"Inhalt\", nicht jedoch \"top\" oder \"rechts\". Oft werden in Framesets auch leere Frames eingebunden, die ausschließlich zu Layoutzwecken verwendet werden. Bei solchen Frames sollte als Bezeichnung \"Leer\" gewählt werden.</p>",
  "_STEP_9_2_4_1_HOW_CHECKED_26_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_9_2_4_1_HOW_CHECKED_27_": "<h4 id=\"_erfüllt\">Erfüllt</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_28_": "<ul><li><p>Alle Bereiche der Seite können über Überschriften, Sprunglinks, HTML5 Elemente für Regionen und/oder WAI ARIA document landmarks erreicht und übersprungen werden</p></li><li><p>Frames und iframes haben sinnvolle Titel</p></li></ul>",
  "_STEP_9_2_4_1_HOW_CHECKED_29_": "<h4 id=\"_nicht_voll_erfüllt\">Nicht voll erfüllt</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_30_": "<ul><li><p>Bereichsüberschriften sind nicht aussagekräftig oder irreführend</p></li><li><p>Der Einsatz von HTML5 Elementen für Regionen erschließt die Seitenbereiche nicht vollständig</p></li><li><p>Die Zuordnung von WAI-ARIA document landmarks ist falsch oder irreführend</p></li><li><p>Bereichsüberschriften oder Sprunglinks sind mittels <code>display:none</code> versteckt</p></li><li><p>Der Seitenpfad (Breadcrumb) ist als Liste ausgezeichnet, hat aber keinen vorangestellten Hinweis (z. B. Überschrift)</p></li><li><p>Mehrere wichtige Navigationsbereiche sind mit WAI-ARIA document landmarks oder HTML5-Elementen für Bereiche ausgezeichnet und sind nicht mit aria-label oder aria-labelledby unterschieden.</p></li></ul>",
  "_STEP_9_2_4_1_HOW_CHECKED_31_": "<h4 id=\"_nicht_erfüllt\">Nicht erfüllt</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_32_": "<ul><li><p>Es gibt auf der Seite verschiedene Bereiche mit für sich nutzbaren Inhalten, diese werden jedoch weder mit Überschriften, noch mit Sprunglinks oder HTML5 Elementen erschlossen</p></li><li><p>Auf der Seite werden mehrere klar abgrenzbare Themen behandelt, es wurde aber nur pro forma eine Hauptüberschrift ausgezeichnet</p></li></ul>",
  "_STEP_9_2_4_1_SOURCES_1_": "<h3 id=\"_wcag_2_1_hinweis_zum_unterschied_von_name_und_title\">WCAG 2.1 Hinweis zum Unterschied von <code>name</code> und <code>title</code></h3>",
  "_STEP_9_2_4_1_SOURCES_2_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>The <code>title</code> attribute is not interchangeable with the <code>name</code> attribute. The title labels the frame for users; the name labels it for scripting and window targeting. The name is not presented to the user, only the title is.</p></blockquote></div>",
  "_STEP_9_2_4_1_SOURCES_3_": "<p>(<a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H64.html\"> H64: Using the title attribute of the frame and iframe elements</a>)</p>",
  "_STEP_9_2_4_1_SOURCES_4_": "<h3 id=\"_wcag_2_1_verknüpfung_von_wai_aria_document_landmarks_und_text\">WCAG 2.1 Verknüpfung von WAI ARIA document landmarks und Text</h3>",
  "_STEP_9_2_4_1_SOURCES_5_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>The purpose of this technique is to provide names for regions of a page that can be read by assistive technology. The aria-labelledby attribute provides a way to associate an section of the page marked up as a region or landmarks with text that is on the page that labels it.</p></blockquote></div>",
  "_STEP_9_2_4_1_SOURCES_6_": "<p>(<a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA13.html\"> ARIA13: Using aria-labelledby to name regions and landmarks</a>)</p>",
  "_STEP_9_2_4_1_SOURCES_7_": "<h3 id=\"_ergänzung_von_html5_elementen_mit_wai_aria\">Ergänzung von HTML5 Elementen mit WAI ARIA</h3>",
  "_STEP_9_2_4_1_SOURCES_8_": "<p>Script, das bei HTML5 Elementen automatisch ARIA-Rollen ergänzt: <a href=\"https://github.com/yatil/accessifyhtml5.js\"> Polyfill accessifyhtml5.js von Yatil</a></p>",
  "_STEP_9_2_4_1_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Abgrenzung zu anderen Prüfschritten</h3>",
  "_STEP_9_2_4_1_CLASSIFICATION_2_": "<ul><li><p>In diesem Prüfschritt geht es um die Auszeichnung der Seitenbereiche mit   Überschriften, Sprunglinks und WAI-ARIA-Attributen (landmarks).   Die inhaltliche Strukturierung von Seiteninhalten wird in Prüfschritt 9.1.3.1a \"HTML-Strukturelemente für Überschriften\"   geprüft.</p></li><li><p>In diesem Prüfschritt wird geprüft, ob Frames und iframes (wenn vorhanden)   vernünftige Titel haben.   Die <strong>Inhalte</strong> von iframes werden ebenso geprüft wie andere Seiteninhalte,   etwa in Prüfschritt 9.1.3.1d \"Inhalt gegliedert\".</p></li></ul>",
  "_STEP_9_2_4_1_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_2_4_1_CLASSIFICATION_4_": "<h4 id=\"_guidelines\">Guidelines</h4>",
  "_STEP_9_2_4_1_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/quickref/#navigable\"> Guideline 2.4 Navigable: Provide ways to help users navigate, find content, and determine where they are</a></p></li></ul>",
  "_STEP_9_2_4_1_CLASSIFICATION_6_": "<h4 id=\"_success_criteria\">Success criteria</h4>",
  "_STEP_9_2_4_1_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/quickref/#bypass-blocks\"> 2.4.1 Bypass Blocks (Level A)</a></p></li></ul>",
  "_STEP_9_2_4_1_CLASSIFICATION_8_": "<h4 id=\"_techniques\">Techniques</h4>",
  "_STEP_9_2_4_1_CLASSIFICATION_9_": "<h5 id=\"_general_techniques\">General Techniques</h5>",
  "_STEP_9_2_4_1_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G1.html\"> G1: Adding a link at the top of each page that goes directly to the main content area</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G115.html\"> G115: Using semantic elements to mark up structure</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G123.html\"> G123: Adding a link at the beginning of a block of repeated content to go to the end of the block</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G124.html\"> G124: Adding links at the top of the page to each area of the content</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G130.html\"> G130: Providing descriptive headings</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G140.html\"> G140: Separating information and structure from presentation to enable different presentations</a></p></li></ul>",
  "_STEP_9_2_4_1_CLASSIFICATION_11_": "<h5 id=\"_html_techniques\">HTML Techniques</h5>",
  "_STEP_9_2_4_1_CLASSIFICATION_12_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H42.html\"> H42: Using h1-h6 to identify headings</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H64.html\"> H64: Using the title attribute of the frame and iframe elements</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H69.html\"> H69: Providing heading elements at the beginning of each section of content</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H97.html\"> H97: Grouping related links using the nav element</a></p></li></ul>",
  "_STEP_9_2_4_1_CLASSIFICATION_13_": "<h5 id=\"_aria_techniques\">ARIA Techniques</h5>",
  "_STEP_9_2_4_1_CLASSIFICATION_14_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA11.html\"> ARIA11: Using ARIA landmarks to identify regions of a page</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA13.html\"> ARIA13: Using aria-labelledby to name regions and landmarks</a></p></li></ul>",
  "_STEP_9_2_4_1_QUESTIONS_1_": "<h3 id=\"_müssen_die_bereiche_der_webseite_durch_h1_überschriften_ausgezeichnet_werden\">Müssen die Bereiche der Webseite durch <code>h1</code>-Überschriften ausgezeichnet werden?</h3>",
  "_STEP_9_2_4_1_QUESTIONS_2_": "<p>Bei den meisten Webangeboten sind bestimmte Bereiche durchgängig für die Navigation reserviert. Andere wiederkehrende Bereich können etwa die Suche oder der Seitenkopf sein. Diese Bereiche sind auf allen Seiten des Angebots gleich aufgebaut und gestaltet. Sie haben keinen engen Bezug zum besonderen Seiteninhalt, sind eigentlich nicht den einzelnen Seiten, sondern eher dem Webauftritt als ganzen zuzurechnen. Es liegt daher nahe, die Navigation, den Inhaltsbereich und weitere klar abgegrenzte Bereiche der Seite jeweils mit einer <code>h1</code>-Hauptüberschrift zu versehen.</p>",
  "_STEP_9_2_4_1_QUESTIONS_3_": "<p>Es gibt jedoch auch andere Möglichkeiten, Seitenbereiche auszuzeichnen, etwa durch <code>h5</code>- oder <code>h6</code>-Überschriften, falls diese in der Gliederung der Seiteninhalte nicht verwendet werden (vergleiche den Artikel auf einfach-für-alle: <a href=\"http://www.einfach-fuer-alle.de/artikel/ueberschriften-strukturen-in-html/\"> \"Passende Überschrift hier einsetzen\"</a>)</p>",
  "_STEP_9_2_4_1_QUESTIONS_4_": "<p>Vom BITV-Test werden unterschiedliche Herangehensweisen akzeptiert. Es muss in jedem Fall geprüft werden, ob Überschriften konsistent eingesetzt werden, um die Seiten-Bereiche und deren Inhalte zu erschließen.</p>"
}
