{
  "_STEP_9_2_4_1_NAME_": "Разделы, которые можно пропустить",
  "_STEP_9_2_4_1_WHAT_CHECKED_1_": "<p>Различные разделы содержимого, такие как навигация, поиск или основной контент, должны быть доступны для пропуска пользователями ассистивных технологий. Структура страницы должна быть понятна независимо от её визуального представления. Должно быть выполнено одно из следующих условий:</p>",
  "_STEP_9_2_4_1_WHAT_CHECKED_2_": "<ul><li><p>Использованы осмысленные заголовки разделов (HTML структурные элементы <code>h1</code> до <code>h6</code>).</p></li><li><p>Присутствуют прыжковые ссылки.</p></li><li><p>HTML5 элементы для обозначения разделов (<code>header, nav, main, aside, footer</code>) логично организуют структуру страницы.</p></li><li><p>WAI-ARIA <em>document landmarks</em> логично структурируют разделы страницы.</p></li></ul>",
  "_STEP_9_2_4_1_WHAT_CHECKED_3_": "<p>Фреймы и iframe нуждаются в осмысленном атрибуте <code>title</code>.</p>",
  "_STEP_9_2_4_1_WHY_CHECKED_1_": "<p>Визуально веб-страницы структурируются с помощью заголовков, колонок или блоков. Благодаря этой структуризации пользователь знает, что относится к чему, может легко ориентироваться на сайте и целенаправленно обращаться к интересующим его содержимым.</p>",
  "_STEP_9_2_4_1_WHY_CHECKED_2_": "<p>Пользователи, которые не могут использовать эту визуальную организацию — например, из-за слепоты или ограниченного видения — зависят от того, что структура доступна и используема независимо от визуального представления на экране. Использование (часто невидимых) заголовков разделов, прыжковых ссылок или HTML5 элементов для обозначения разделов является для этого существенным условием.</p>",
  "_STEP_9_2_4_1_WHY_CHECKED_3_": "<p>Для фреймов важно иметь осмысленное название для ориентации с помощью экранных читалок. Распространенные экранные читалки анализируют атрибуты <code>title</code> и обычно используемые в программировании атрибуты <code>name</code>. При этом атрибут <code>title</code> выводится в приоритете. Они озвучивают название активного фрейма при переключении между фреймами с помощью горячих клавиш.</p>",
  "_STEP_9_2_4_1_WHY_CHECKED_4_": "<p>Использование HTML5 элементов для разделов в настоящее время хорошо поддерживается ассистивными технологиями. Дополнительное использование атрибута role (WAI ARIA document landmarks) может улучшить поддержку разделов.</p>",
  "_STEP_9_2_4_1_WHY_CHECKED_5_": "<p>Таким образом, пользователи могут использовать заголовки разделов, прыжковые ссылки, HTML5 элементы для разделов или WAI-ARIA document landmarks:</p>",
  "_STEP_9_2_4_1_WHY_CHECKED_6_": "<ul><li><p>Пропускать постоянные разделы в начале страницы, такие как навигация или заголовок страницы, чтобы перейти непосредственно к содержимому</p></li><li><p>Переключаться между разделами</p></li></ul>",
  "_STEP_9_2_4_1_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_9_2_4_1_HOW_CHECKED_2_": "<p>Этап проверки применим, если на странице есть четко разграниченные разделы, например, навигация и содержание. Это обычно случается на информационно ориентированных страницах.</p>",
  "_STEP_9_2_4_1_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_2_4_1_HOW_CHECKED_4_": "<h4 id=\"_2_1_prüfung_der_bereichsüberschriften\">2.1 Проверка заголовков разделов</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_5_": "<ol><li><p>Открыть страницу в Firefox.</p></li><li><p>Использовать <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#webdeveloper\"> Web Developer Toolbar</a> для просмотра страницы без стилей (отключить стили через <em>CSS &gt; Styles deaktivieren &gt; Alle Styles deaktivieren</em>).</p></li><li><p>Вызвать <a href=\"https://webtest.bitv-test.de/bookmarklets.html#gegliedert\"> Bookmarklet \"Inhalte gegliedert\"</a>.</p></li><li><p>Посмотреть заголовки разделов в контексте структурированного ими содержимого и проверить, являются ли они информативными, используют структурные элементы для заголовков и полностью и корректно делят содержимое страницы.</p></li></ol>",
  "_STEP_9_2_4_1_HOW_CHECKED_6_": "<h4 id=\"_2_2_sprunglink_prüfung\">2.2 Проверка прыжковых ссылок</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_7_": "<p>Если прыжковые ссылки присутствуют, проверить выполнение следующих требований:</p>",
  "_STEP_9_2_4_1_HOW_CHECKED_8_": "<ul><li><p>Прыжковые ссылки перемещают фокус клавиатуры на указанный раздел (или непосредственно на содержимое после пропускаемого блока содержимого) при активации.</p></li><li><p>Прыжковые ссылки постоянно видимы или становятся видимыми при получении фокуса.</p></li><li><p>Прыжковые ссылки в начале страницы являются первыми элементами в порядке перехода по табуляции.</p></li><li><p>Прыжковые ссылки для пропуска блоков содержимого являются последним фокусируемым элементом перед пропускаемым блоком содержимого или его первой ссылкой.</p></li></ul>",
  "_STEP_9_2_4_1_HOW_CHECKED_9_": "<h4 id=\"_2_3_prüfung_der_html5_elemente_für_regionen_und_wai_aria_document_landmarks\">2.3 Проверка HTML5 элементов для разделов и WAI-ARIA document landmarks</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_10_": "<ol><li><p>Открыть страницу в Firefox.</p></li><li><p>Анализ исходного кода: проверить, разделены ли различные разделы страницы с помощью <code>header, nav, main, aside, footer</code> разумным образом.</p></li><li><p>Вызвать <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#landmarksbm\"> Landmarks bookmarklet</a>. Теперь, если они присутствуют, document landmarks будут выделены.</p></li><li><p>Если используются document landmarks, проверить, корректно ли присвоены роли (например, <code>navigation, main</code>) и соответствуют ли они структуре страницы.</p></li><li><p>Если несколько областей навигации обозначены только как <code>nav</code> или <code>role=\"navigation\"</code>, проверить, имеют ли они осмысленное обозначение с помощью <code>aria-label</code> или <code>aria-labelledby</code>.</p></li></ol>",
  "_STEP_9_2_4_1_HOW_CHECKED_11_": "<h4 id=\"_2_4_prüfung_von_frame_titeln\">2.4 Проверка названий фреймов</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_12_": "<ol><li><p>Открыть страницу в Firefox.</p></li><li><p>Использовать функцию <em>Outline &gt; Outline Frames</em> в Web Developer Toolbar.</p></li><li><p>Затем в Web Developer Toolbar вызвать функцию <em>Information &gt; Display Element Information</em>. Курсор теперь будет отображаться как перекрестие.</p></li><li><p>Кликнуть перекрестием на границу выделенных фреймов и проверить, имеют ли все фреймы информативный текст в атрибуте <code>title</code>.</p></li></ol>",
  "_STEP_9_2_4_1_HOW_CHECKED_13_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_9_2_4_1_HOW_CHECKED_14_": "<h4 id=\"_eigenständige_bereiche\">Независимые разделы</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_15_": "<p>Примеры независимых разделов:</p>",
  "_STEP_9_2_4_1_HOW_CHECKED_16_": "<ul><li><p>Навигация и содержимое</p></li><li><p>Колонки с разным содержимым</p></li><li><p>Разделы, выделенные рамкой как связанные</p></li><li><p>Фреймы или iframes</p></li></ul>",
  "_STEP_9_2_4_1_HOW_CHECKED_17_": "<p>Подвал не считается независимым разделом, если там находятся только повторяющиеся ссылки, копирайты или даты создания или изменения.</p>",
  "_STEP_9_2_4_1_HOW_CHECKED_18_": "<h4 id=\"_hinweis_zu_sprunglinks_und_document_landmarks\">Замечания о прыжковых ссылках и Document Landmarks</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_19_": "<p>Отсутствие прыжковых ссылок и неиспользование WAI-ARIA Document Landmarks не оцениваются отрицательно.</p>",
  "_STEP_9_2_4_1_HOW_CHECKED_20_": "<h4 id=\"_hinweis_zu_mehrfach_verwendeten_landmarks_bzwhtml5_elemente_für_bereiche\">Замечание о многократном использовании Landmarks или HTML5-элементов для разделов</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_21_": "<p>Если WAI-ARIA document landmark или HTML5-элемент для разделов используется несколько раз (например, <code>role=\"navigation\"</code> или <code>nav</code>), они должны быть осмысленно обозначены с помощью <code>aria-label</code> или <code>aria-labelledby</code>.</p>",
  "_STEP_9_2_4_1_HOW_CHECKED_22_": "<h4 id=\"_hinweis_zu_sie_sind_hier_navigationen\">Замечание о навигации \"Вы здесь\"</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_23_": "<p>Имеется в виду навигация \"Вы здесь\" в начале страницы (также известная как хлебные крошки или тропинка). Если хлебные крошки обозначены как списки, они должны иметь предварительно установленный указатель, такой как \"Путь страницы\", \"Вы здесь\" или \"Навигационный путь\", чтобы они могли отличаться от других меню для пользователей экранных читалок.</p>",
  "_STEP_9_2_4_1_HOW_CHECKED_24_": "<h4 id=\"_hinweis_zu_frames_und_iframes\">Замечание о фреймах и iframes</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_25_": "<p>В атрибуте <code>title</code> должны указываться цель или содержание, а не расположение фрейма на экране (см. 9.2.4.2 \"Осмысленные заголовки документов\"). Подходящие атрибуты <code>title</code> могут быть, например, \"Навигация\" и \"Содержание\", а не \"верх\" или \"право\". Часто во фреймсетах также включаются пустые фреймы, используемые исключительно для целей макета. Для таких фреймов следует выбрать обозначение \"Пустой\".</p>",
  "_STEP_9_2_4_1_HOW_CHECKED_26_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_2_4_1_HOW_CHECKED_27_": "<h4 id=\"_erfüllt\">Выполнено</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_28_": "<ul><li><p>Все разделы страницы доступны через заголовки, прыжковые ссылки, HTML5 элементы для разделов и/или WAI ARIA document landmarks</p></li><li><p>Фреймы и iframes имеют осмысленные названия</p></li></ul>",
  "_STEP_9_2_4_1_HOW_CHECKED_29_": "<h4 id=\"_nicht_voll_erfüllt\">Не полностью выполнено</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_30_": "<ul><li><p>Заголовки разделов неинформативны или вводят в заблуждение</p></li><li><p>Использование HTML5 элементов для разделов не полностью раскрывает разделы страницы</p></li><li><p>Назначение WAI-ARIA document landmarks неправильное или вводит в заблуждение</p></li><li><p>Заголовки разделов или прыжковые ссылки скрыты с помощью <code>display:none</code></p></li><li><p>Путь страницы (Breadcrumb) обозначен как список, но не имеет предварительно установленного указателя (например, заголовка)</p></li><li><p>Несколько важных областей навигации обозначены с помощью WAI-ARIA document landmarks или HTML5 элементов для разделов и не различаются с помощью aria-label или aria-labelledby.</p></li></ul>",
  "_STEP_9_2_4_1_HOW_CHECKED_31_": "<h4 id=\"_nicht_erfüllt\">Не выполнено</h4>",
  "_STEP_9_2_4_1_HOW_CHECKED_32_": "<ul><li><p>На странице есть различные разделы с полезным содержимым, которые не раскрыты с помощью заголовков, прыжковых ссылок или HTML5 элементов</p></li><li><p>На странице обсуждаются несколько четко разграниченных тем, но была выделена только формальная главная заголовок</p></li></ul>",
  "_STEP_9_2_4_1_SOURCES_1_": "<h3 id=\"_wcag_2_1_hinweis_zum_unterschied_von_name_und_title\">WCAG 2.1 Примечание к различию между <code>name</code> и <code>title</code></h3>",
  "_STEP_9_2_4_1_SOURCES_2_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>The <code>title</code> attribute is not interchangeable with the <code>name</code> attribute. The title labels the frame for users; the name labels it for scripting and window targeting. The name is not presented to the user, only the title is.</p></blockquote></div>",
  "_STEP_9_2_4_1_SOURCES_3_": "<p>(<a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H64.html\"> H64: Использование атрибута title элементов frame и iframe</a>)</p>",
  "_STEP_9_2_4_1_SOURCES_4_": "<h3 id=\"_wcag_2_1_verknüpfung_von_wai_aria_document_landmarks_und_text\">WCAG 2.1 Связывание WAI ARIA document landmarks и текста</h3>",
  "_STEP_9_2_4_1_SOURCES_5_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>The purpose of this technique is to provide names for regions of a page that can be read by assistive technology. The aria-labelledby attribute provides a way to associate an section of the page marked up as a region or landmarks with text that is on the page that labels it.</p></blockquote></div>",
  "_STEP_9_2_4_1_SOURCES_6_": "<p>(<a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA13.html\"> ARIA13: Использование aria-labelledby для именования регионов и ориентиров</a>)</p>",
  "_STEP_9_2_4_1_SOURCES_7_": "<h3 id=\"_ergänzung_von_html5_elementen_mit_wai_aria\">Дополнение HTML5 элементов с WAI ARIA</h3>",
  "_STEP_9_2_4_1_SOURCES_8_": "<p>Скрипт, который автоматически добавляет ARIA-роли к HTML5 элементам: <a href=\"https://github.com/yatil/accessifyhtml5.js\"> Polyfill accessifyhtml5.js от Yatil</a></p>",
  "_STEP_9_2_4_1_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Разграничение с другими этапами проверки</h3>",
  "_STEP_9_2_4_1_CLASSIFICATION_2_": "<ul><li><p>На этом этапе проверяется обозначение разделов страницы с помощью заголовков, прыжковых ссылок и WAI-ARIA атрибутов (ориентиры). Структурное оформление содержимого страниц проверяется на этапе 9.1.3.1a \"HTML-структурные элементы для заголовков\".</p></li><li><p>На этом этапе проверяется, имеют ли фреймы и iframes (если они присутствуют) разумные заголовки. <strong>Содержимое</strong> iframes проверяется так же, как и другое содержимое страниц, например, на этапе 9.1.3.1d \"Структурированный контент\".</p></li></ul>",
  "_STEP_9_2_4_1_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация этапа проверки по WCAG 2.1</h3>",
  "_STEP_9_2_4_1_CLASSIFICATION_4_": "<h4 id=\"_guidelines\">Руководящие принципы</h4>",
  "_STEP_9_2_4_1_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/quickref/#navigable\"> Руководящий принцип 2.4 Навигация: предоставление способов помочь пользователям навигировать, находить контент и определять своё местоположение</a></p></li></ul>",
  "_STEP_9_2_4_1_CLASSIFICATION_6_": "<h4 id=\"_success_criteria\">Критерии успеха</h4>",
  "_STEP_9_2_4_1_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/quickref/#bypass-blocks\"> 2.4.1 Обход блоков (Уровень A)</a></p></li></ul>",
  "_STEP_9_2_4_1_CLASSIFICATION_8_": "<h4 id=\"_techniques\">Техники</h4>",
  "_STEP_9_2_4_1_CLASSIFICATION_9_": "<h5 id=\"_general_techniques\">Общие техники</h5>",
  "_STEP_9_2_4_1_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G1.html\"> G1: Добавление ссылки в начале каждой страницы, которая ведёт непосредственно к основной области контента</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G115.html\"> G115: Использование семантических элементов для разметки структуры</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G123.html\"> G123: Добавление ссылки в начале блока повторяющегося контента для перехода в его конец</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G124.html\"> G124: Добавление ссылок в верхней части страницы на каждую область контента</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G130.html\"> G130: Предоставление описательных заголовков</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G140.html\"> G140: Разделение информации и структуры от презентации для возможности разных представлений</a></p></li></ul>",
  "_STEP_9_2_4_1_CLASSIFICATION_11_": "<h5 id=\"_html_techniques\">HTML Техники</h5>",
  "_STEP_9_2_4_1_CLASSIFICATION_12_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H42.html\"> H42: Использование h1-h6 для идентификации заголовков</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H64.html\"> H64: Использование атрибута title элементов frame и iframe</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H69.html\"> H69: Предоставление элементов заголовков в начале каждого раздела содержимого</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H97.html\"> H97: Группировка связанных ссылок с использованием элемента nav</a></p></li></ul>",
  "_STEP_9_2_4_1_CLASSIFICATION_13_": "<h5 id=\"_aria_techniques\">ARIA Техники</h5>",
  "_STEP_9_2_4_1_CLASSIFICATION_14_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA11.html\"> ARIA11: Использование ARIA ориентиров для идентификации регионов страницы</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA13.html\"> ARIA13: Использование aria-labelledby для именования регионов и ориентиров</a></p></li></ul>",
  "_STEP_9_2_4_1_QUESTIONS_1_": "<h3 id=\"_müssen_die_bereiche_der_webseite_durch_h1_überschriften_ausgezeichnet_werden\">Должны ли разделы веб-сайта быть обозначены с помощью заголовков <code>h1</code>?</h3>",
  "_STEP_9_2_4_1_QUESTIONS_2_": "<p>На большинстве веб-сайтов определенные разделы постоянно зарезервированы для навигации. Другие повторяющиеся разделы могут включать поиск или заголовок страницы. Эти разделы одинаково организованы и оформлены на всех страницах предложения. Они не имеют тесной связи с конкретным содержанием страницы, а скорее относятся к веб-сайту в целом. Поэтому логично обозначить навигацию, область содержания и другие четко разграниченные разделы страницы каждый с помощью главного заголовка <code>h1</code>.</p>",
  "_STEP_9_2_4_1_QUESTIONS_3_": "<p>Однако существуют и другие способы выделения разделов страницы, например, с помощью заголовков <code>h5</code> или <code>h6</code>, если они не используются в структуре содержимого страниц (см. статью на einfach-für-alle: <a href=\"http://www.einfach-fuer-alle.de/artikel/ueberschriften-strukturen-in-html/\"> \"Подходящий заголовок вставить здесь\"</a>)</p>",
  "_STEP_9_2_4_1_QUESTIONS_4_": "<p>BITV-Test принимает различные подходы. В любом случае необходимо проверить, используются ли заголовки последовательно для раскрытия разделов страницы и их содержимого.</p>"
}