{
  "_STEP_7_3_NAME_": "Bedienelemente für Untertitel und Audiodeskription",
  "_STEP_7_3_NAME_NAME_": "7.3 Bedienelemente für Untertitel und Audiodeskription",
  "_STEP_7_3_WHAT_CHECKED_1_": "<p>Wenn ein Videoplayer Video-Inhalte mit zugehörigen Audioinhalten abspielt, befinden sich die Bedienelemente zur Aktivierung der Untertitelung und Audiodeskription auf der gleichen Interaktionsebene wie die Bedienelemente zur Wiedergabekontrolle (z. B. Abspielen, Pause, Lautstärke etc.).</p>",
  "_STEP_7_3_WHY_CHECKED_1_": "<p>Videoplayer bieten den Menschen eine Vielzahl von Interaktionsmöglichkeiten. Am wichtigsten sind dabei die Bedienelemente zur Wiedergabekontrolle. Sie sind daher prominent auf der obersten Interaktionsebene des Players positioniert. Bedienelemente für das Ein- und Ausblenden der Untertitel bzw. das Starten und Beenden der Audiodeskription sind für Menschen, die diese Funktion benötigen, ebenfalls wichtige Steuerelemente. Sie sollen leicht gefunden werden und müssen daher ebenfalls auf der obersten Interaktionsebene positioniert sein.</p>",
  "_STEP_7_3_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_7_3_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn auf der Webseite ein Videoplayer eingebunden ist, der Video-Inhalte mit zugehörigen Audioinhalten abspielt und wenn Untertitel und / oder Audiodeskription angeboten werden.</p>",
  "_STEP_7_3_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_7_3_HOW_CHECKED_4_": "<ol><li><p>Das Video mit dem auf der Website eingebundenen Player abspielen.</p></li><li><p>Prüfen, ob Bedienelemente zur Anzeige von Untertiteln und / oder Audiodeskription auf gleicher Ebene wie die Bedienelemente zur Wiedergabekontrolle (z. B. Abspielen, Pause, Lautstärke etc.) angeboten werden.</p></li></ol>",
  "_STEP_7_3_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_7_3_HOW_CHECKED_6_": "<p>Wenn 7.3 Bedienelemente für Untertitel und Audiodeskription (dieser Prüfschritt) erfüllt ist, ist 7.1.1 \"Wiedergabe von Untertiteln\" und 7.2.1 \"Wiedergabe von Audiodeskription\" ebenfalls erfüllt.</p>",
  "_STEP_7_3_HOW_CHECKED_7_": "<p>Für Hinweise zu diesem Prüfschritt können Sie auf GitHub <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">ein Issue anlegen</a>.</p>",
  "_STEP_7_3_HOW_CHECKED_8_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_7_3_HOW_CHECKED_9_": "<h4 id=\"_nicht_erfüllt\">Nicht erfüllt:</h4>",
  "_STEP_7_3_HOW_CHECKED_10_": "<ul><li><p>Die Bedienelemente zur Aktivierung der Untertitel und Audiodeskription sind nicht auf der gleichen Interaktionsebene positioniert wie die Bedienelemente zur Wiedergabekontrolle.</p></li></ul>",
  "_STEP_7_3_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Abgrenzung zu anderen Prüfschritten</h3>",
  "_STEP_7_3_CLASSIFICATION_2_": "<p>Bei diesem Prüfschritt geht es darum, <strong>wo</strong> die Bedienelemente für Untertitel und Audiodeskription positioniert sind. In Prüfschritt 7.2.1 \"Wiedergabe von Audiodeskription\" geht es darum, dass überhaupt entsprechende Bedienelemente vorhanden sind.</p>",
  "_STEP_7_3_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_1_1\">Einordnung des Prüfschritts nach EN 301 549 V3.1.1</h3>",
  "_STEP_7_3_CLASSIFICATION_4_": "<h4 id=\"_7_3_user_controls_for_captions_and_audio_description\">7.3 User controls for captions and audio description</h4>",
  "_STEP_7_3_CLASSIFICATION_5_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where ICT primarily displays materials containing video with associated audio content, user controls to activate subtitling and audio description shall be provided to the user at the same level of interaction (i.e. the number of steps to complete the task) as the primary media controls.</p><p>NOTE 1: Primary media controls are the set of controls that the user most commonly uses to control media.</p><p>NOTE 2: Products that have a general hardware volume control, such as a telephone, or a laptop which can be configured to display video through Web-App but which is not its primary purpose, would not need dedicated hardware controls for captions and descriptions; however Web-App controls, or hardware controls mapped through Web-App, would need to be at the same level of interaction.</p><p>NOTE 3: It is best practice for ICT to include additional controls enabling the user to select whether captions and audio description are turned on or off by default.</p></div></div>"
}