{
  "_STEP_7_2_2_NAME_": "Synchrone Audiodeskription",
  "_STEP_7_2_2_NAME_MENU_": "7.2.2 Synchrone Audiodeskription",
  "_STEP_7_2_2_WHAT_CHECKED_1_": "<p>Sind Videos mit synchroner Bild- und Tonspur und zusätzlicher Audiodeskription vorhanden, soll der Videoplayer in der Lage sein, die zusätzliche Audiodeskription synchron zu Bild und Ton wiederzugeben.</p>",
  "_STEP_7_2_2_WHY_CHECKED_1_": "<p>Bildbeschreibungen sollten möglichst handlungssynchron umgesetzt werden (siehe auch <a href=\"https://www.ndr.de/fernsehen/barrierefreie_angebote/audiodeskription/Vorgaben-fuer-Audiodeskriptionen,audiodeskription140.html\">Vorgaben der Rundfunkanstalten für Audiodeskription</a>). Das bedeutet, dass die Audiodeskription auf die visuellen Elemente des zu beschreibenden Videos abgestimmt und damit synchron ist. Die synchrone Ausgabe ist für die Gesamtverständlichkeit wichtig.</p>",
  "_STEP_7_2_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_7_2_2_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn auf der Webseite Videos mit synchroner Bild- und Tonspur sowie einer zusätzlich eingebundenen Tonspur für Audiodeskription vorhanden sind. Eine Alternative wäre die Verwendung des <code>track</code>-Elements mit <code>kind=\"description\"</code>, eine im video-Element eingebundene Textdatei, aus der ggf. eine Audio-Ausgabe synthetisiert wird. Wenn also ein Player bei der Auswahl einer angebotenen 'Version mit Audiodeskription' eine andere Videodatei mit erweitertem Ton lädt, ist der Prüfschritt nicht anwendbar, denn eine festgestellte mangelnde Synchronität läge dann in jedem Fall an der eingebundenen Video-Datei, nicht am Player.</p>",
  "_STEP_7_2_2_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_7_2_2_HOW_CHECKED_4_": "<ol><li><p>Das Video mit zugeschalteter Audiodeskription in dem auf der Webseite eingebundenen Player abspielen.</p></li><li><p>Prüfen, ob die Audiodeskription synchron zu Bild und Ton wiedergegeben wird.</p></li><li><p>Falls die Audiodeskription nicht synchron läuft: Mittels Web Developer Tools prüfen, ob beim Abspielen der Versionen mit und ohne Audiodeskription unterschiedliche Quell-Dateien genutzt werden. Das <code>src</code>-Attribut des <code>video</code>-Elements hat in diesem Fall abweichende Pfade, etwa <code>../video-name.mp4</code> und <code>../video-name-AD.mp4</code>. Ist das der Fall, ist die Audiodeskription mit großer Wahrscheinlichkeit integrierter Teil der Video-Tonspur. Mangelnde Synchronität liegt in diesem Fall nicht am Player, der Prüfschritt ist erfüllt. Wahrscheinlich muss dann aber Prüfschritt 9.1.2.5 \"Audiodeskription für Videos\" negativ bewertet werden!</p></li><li><p>Falls der Dateipfad des Videos nach Zuschalten der Audiodeskription gleich bleibt, ist bei mangelnder Synchronität entweder der Player fehlerhalft oder es liegt an einer fehlerhaften Umsetzung der Audiodeskription. Die Ursache kann derzeit nur vom Web-Autor geprüft werden.</p></li></ol>",
  "_STEP_7_2_2_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_7_2_2_HOW_CHECKED_6_": "<p>Wenn zugeschaltete Audiodeskription nicht synchron läuft und im Angebot andere Videos mit zuschaltbarer Audiodeskription vorhanden sind, dort prüfen, ob ebenfalls Mängel bei der Synchronität bestehen. Ist die zugeschaltete Audiodeskription bei anderen Videos synchron, deutet dies darauf hin, d ass das Problem nicht beim Player, sondern beim spezifischen Video oder Audiodeskriptions-Dateien liegt. Der Prüfschritt wäre dann erfüllt.</p>",
  "_STEP_7_2_2_HOW_CHECKED_7_": "<p>Hinweise zu diesem Prüfschritt können Sie auf GitHub <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">in einem Issue hinterlassen</a>.</p>",
  "_STEP_7_2_2_HOW_CHECKED_8_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_7_2_2_HOW_CHECKED_9_": "<h4 id=\"_nicht_erfüllt\">Nicht erfüllt:</h4>",
  "_STEP_7_2_2_HOW_CHECKED_10_": "<ul><li><p>Bild/Ton und Audiodeskription sind nicht synchron.</p></li></ul>",
  "_STEP_7_2_2_SOURCES_1_": "<ul><li><p>Zurzeit keine Quellen.</p></li></ul>",
  "_STEP_7_2_2_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Abgrenzung zu anderen Prüfschritten</h3>",
  "_STEP_7_2_2_CLASSIFICATION_2_": "<p>In diesem Prüfschritt wird geprüft, ob der Videoplayer Audiodeskription synchron anzeigt. In Prüfschritt 9.1.2.5 \"Audiodeskription für Videos\" erfolgt hingegen die inhaltliche Prüfung der Audiodeskription. Die Prüfung, ob der Player oder die Umsetzung der Audiodeskription fehlerhaft ist, kann derzeit nicht erfolgen. Wird Audiodeskription nicht synchron dargestellt, erfolgt in beiden Prüfschritten eine negative Bewertung mit dem Hinweis auf eine unklare Ursache.</p>",
  "_STEP_7_2_2_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Einordnung des Prüfschritts nach EN 301 549 V3.2.1</h3>",
  "_STEP_7_2_2_CLASSIFICATION_4_": "<h3 id=\"_7_2_2_audio_description_synchronization\">7.2.2 Audio description synchronization</h3>",
  "_STEP_7_2_2_CLASSIFICATION_5_": "<p>Where ICT has a mechanism to play audio description, it shall preserve the synchronization between the audio/visual content and the corresponding audio description.</p>"
}