{
  "_STEP_7_2_2_NAME_": "Синхронное аудиоописание",
  "_STEP_7_2_2_WHAT_CHECKED_1_": "<p>Если видео имеет синхронные звуковую и видеодорожки и дополнительное аудиоописание, то видеоплеер должен быть в состоянии воспроизводить дополнительное аудиоописание синхронно с видео и звуком.</p>",
  "_STEP_7_2_2_WHY_CHECKED_1_": "<p>Описания изображений должны быть реализованы как можно более синхронно с действием (см. также <a href=\"https://www.ndr.de/fernsehen/barrierefreie_angebote/audiodeskription/Vorgaben-fuer-Audiodeskriptionen,audiodeskription140.html\">требования вещательных организаций к аудиоописанию</a>). Это означает, что аудиоописание должно соответствовать визуальным элементам описываемого видео и, таким образом, быть синхронным. Синхронное воспроизведение важно для общего понимания.</p>",
  "_STEP_7_2_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_7_2_2_HOW_CHECKED_2_": "<p>Этап проверки применим, если на веб-сайте присутствуют видео с синхронной звуковой и видеодорожкой и дополнительной звуковой дорожкой для аудиоописания. Альтернативой может быть использование элемента <code>track</code> с <code>kind=\"description\"</code>, текстовый файл, встроенный в элемент видео, из которого возможно синтезировать аудиовыход. Если при выборе предложенной 'версии с аудиоописанием' плеер загружает другой видеофайл с расширенной звуковой дорожкой, то этап проверки не применим, так как любая обнаруженная несинхронность будет зависеть от встроенного видеофайла, а не от плеера.</p>",
  "_STEP_7_2_2_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_7_2_2_HOW_CHECKED_4_": "<ol><li><p>Воспроизвести видео с включенным аудиоописанием в плеере на веб-сайте.</p></li><li><p>Проверить, синхронно ли аудиоописание воспроизводится с изображением и звуком.</p></li><li><p>Если аудиоописание не синхронизировано: с помощью инструментов разработчика веб-сайтов проверить, используются ли при воспроизведении версий с аудиоописанием и без неё разные исходные файлы. В этом случае атрибут <code>src</code> элемента <code>video</code> будет иметь разные пути, например, <code>../video-name.mp4</code> и <code>../video-name-AD.mp4</code>. Если это так, то аудиоописание с большой вероятностью является интегрированной частью звуковой дорожки видео. Несинхронность в этом случае не зависит от плеера, этап проверки выполнен. Вероятно, однако, этап проверки 9.1.2.5 \"Audiodeskription für Videos\" будет оценен отрицательно!</p></li><li><p>Если путь файла видео после включения аудиоописания остаётся тем же, при несинхронности вина лежит либо на плеере, либо на неправильной реализации аудиоописания. Причину на данный момент может проверить только автор веб-сайта.</p></li></ol>",
  "_STEP_7_2_2_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_7_2_2_HOW_CHECKED_6_": "<p>Если включенное аудиоописание не синхронизировано и на сайте доступны другие видео с возможностью включения аудиоописания, проверьте, существуют ли аналогичные проблемы с синхронизацией. Если включенное аудиоописание синхронизировано в других видео, это указывает на то, что проблема не в плеере, а в конкретном видео или файлах аудиоописания. Этап проверки выполнен.</p>",
  "_STEP_7_2_2_HOW_CHECKED_7_": "<p>Замечания по этому этапу проверки можно оставить на GitHub <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">в виде Issue</a>.</p>",
  "_STEP_7_2_2_HOW_CHECKED_8_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_7_2_2_HOW_CHECKED_9_": "<h4 id=\"_nicht_erfüllt\">Не выполнено:</h4>",
  "_STEP_7_2_2_HOW_CHECKED_10_": "<ul><li><p>Изображение/звук и аудиоописание не синхронизированы.</p></li></ul>",
  "_STEP_7_2_2_SOURCES_1_": "<ul><li><p>На данный момент нет источников.</p></li></ul>",
  "_STEP_7_2_2_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Разграничение с другими этапами проверки</h3>",
  "_STEP_7_2_2_CLASSIFICATION_2_": "<p>На этом этапе проверяется, показывает ли видеоплеер аудиоописание синхронно. На этапе 9.1.2.5 \"Audiodeskription für Videos\" проводится содержательная проверка аудиоописания. Проверка, вина ли это плеера или реализации аудиоописания, на данный момент не может быть проведена. Если аудиоописание не отображается синхронно, в обоих этапах проверки делается отрицательная оценка с указанием на неясную причину.</p>",
  "_STEP_7_2_2_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_7_2_2_CLASSIFICATION_4_": "<h3 id=\"_7_2_2_audio_description_synchronization\">7.2.2 Синхронизация аудиоописания</h3>",
  "_STEP_7_2_2_CLASSIFICATION_5_": "<p>Когда ИКТ имеет механизм воспроизведения аудиоописания, он должен сохранять синхронизацию между аудио/визуальным контентом и соответствующим аудиоописанием.</p>"
}