{
  "_STEP_9_1_2_1_NAME_": "Альтернативы для аудиофайлов и немых видеороликов",
  "_STEP_9_1_2_1_WHAT_CHECKED_1_": "<p>Аудиофайлы и немые видеоролики, которые передают информацию, должны иметь эквивалентные медиа-альтернативы, если только они уже не являются медиа-альтернативами для текста.</p>",
  "_STEP_9_1_2_1_WHY_CHECKED_1_": "<p>Аудиофайлы (например, аудио-подкасты) недоступны или ограниченно доступны для пользователей с нарушением слуха, поэтому им требуется транскрипция. Немые видеоролики (например, кинопоследовательность или анимация, которая без аудиокомментария показывает, как собирается устройство) недоступны для слепых и слабовидящих пользователей. Поэтому им требуется полноценная медиа-альтернатива (текст или аудиофайл).</p>",
  "_STEP_9_1_2_1_HOW_CHECKED_1_": "<h3 id=\"_1_применимость_шагов_проверки\">1. Применимость шагов проверки</h3>",
  "_STEP_9_1_2_1_HOW_CHECKED_2_": "<p>Шаг проверки применим, если на странице встроены аудиофайлы или немые видеоролики.</p>",
  "_STEP_9_1_2_1_HOW_CHECKED_3_": "<h3 id=\"_2_проверка\">2. Проверка</h3>",
  "_STEP_9_1_2_1_HOW_CHECKED_4_": "<h4 id=\"_2_1_транскрипция_для_аудиофайлов\">2.1 Транскрипция для аудиофайлов</h4>",
  "_STEP_9_1_2_1_HOW_CHECKED_5_": "<ol><li><p>В браузере воспроизведите аудиофайл.</p></li><li><p>Проверьте, передается ли информация (например, через голосовой комментарий). В таком случае требуется транскрипция.</p></li><li><p>Проверьте, предлагается ли транскрипция.</p></li><li><p>Откройте транскрипцию и проверьте, передает ли она те же самые содержимые, что и аудиофайл. В аудиофайлах с различными голосами в транскрипции должно быть указано, кто говорит.</p></li></ol>",
  "_STEP_9_1_2_1_HOW_CHECKED_6_": "<h4 id=\"_2_2_медиа-альтернатива_для_немых_фильмов_или_изображений\">2.2 Медиа-альтернатива для немых фильмов или изображений</h4>",
  "_STEP_9_1_2_1_HOW_CHECKED_7_": "<ol><li><p>В браузере воспроизведите немой видеоролик.</p></li><li><p>Проверьте, передается ли информация.</p></li><li><p>Проверьте, предлагается ли медиа-альтернатива. Это может быть текстовая версия (напрямую или через ссылку), альтернативная звуковая дорожка или дополнительный аудиофайл.</p></li><li><p>Откройте медиа-альтернативу и проверьте, передает ли она те же самые содержимые, что и немая кинопоследовательность или изображение.</p></li></ol>",
  "_STEP_9_1_2_1_HOW_CHECKED_8_": "<h4 id=\"_2_3_проверка_доступности_транскрипции_или_медиа-альтернативы\">2.3 Проверка доступности транскрипции или медиа-альтернативы</h4>",
  "_STEP_9_1_2_1_HOW_CHECKED_9_": "<ol><li><p>Проверьте, предлагается ли медиа-альтернатива в непосредственном контексте аудио- или видеофайла.</p></li><li><p>Если медиа-альтернатива находится на другой странице: есть ли к ней информативная ссылка в непосредственном контексте аудио- или видеофайла?</p></li></ol>",
  "_STEP_9_1_2_1_HOW_CHECKED_10_": "<h3 id=\"_3_замечания\">3. Замечания</h3>",
  "_STEP_9_1_2_1_HOW_CHECKED_11_": "<p>Медиа-альтернатива не требуется, если аудио- или видеофайлы сами по себе являются дополнительной медиа-альтернативой (например, письменное руководство по сборке, дополненное последовательностью изображений описываемых шагов). Связь должна быть ясна, например, через непосредственную близость двух медиа-альтернатив или через информативную ссылку.</p>",
  "_STEP_9_1_2_1_HOW_CHECKED_12_": "<p>Точное соответствие аудио- или немого видеофайла и его медиа-альтернативы не требуется, но они должны передавать те же самые содержимые. В транскрипциях с несколькими голосами (например, диалогами) говорящие лица должны быть идентифицированы в тексте.</p>",
  "_STEP_9_1_2_1_HOW_CHECKED_13_": "<h3 id=\"_4_оценка\">4. Оценка</h3>",
  "_STEP_9_1_2_1_HOW_CHECKED_14_": "<h4 id=\"_не_полностью_соответствует\">Не полностью соответствует</h4>",
  "_STEP_9_1_2_1_HOW_CHECKED_15_": "<ul><li><p>Существует медиа-альтернатива, но связь с соответствующим аудиофайлом или немым видеороликом не ясна.</p></li><li><p>Существует медиа-альтернатива, но содержимые аудио- или немого видеофайла в ней не полностью переданы.</p></li></ul>",
  "_STEP_9_1_2_1_CLASSIFICATION_1_": "<h3 id=\"_разграничение_с_другими_шагами_проверки\">Разграничение с другими шагами проверки</h3>",
  "_STEP_9_1_2_1_CLASSIFICATION_2_": "<p>в случае с временными медиа это относится к шагу проверки 9.1.1.1b \"Альтернативные тексты для графики и объектов\".</p>"
}