{
  "_STEP_12_2_3_NAME_": "Эффективная коммуникация",
  "_STEP_12_2_3_WHAT_CHECKED_1_": "<p>Если предлагается техническая поддержка (например, по телефону, почте или через чат), она должна учитывать коммуникационные потребности людей с инвалидностью и предлагать эффективные, то есть работающие и устойчивые каналы связи. Это также может быть реализовано путем перенаправления к третьим лицам.</p>",
  "_STEP_12_2_3_WHY_CHECKED_1_": "<p>Люди с различными инвалидностями предпочитают разные каналы коммуникации. Например, люди с нарушениями слуха испытывают трудности при телефонных разговорах и предпочитают электронную почту или чат. Для людей, которым по каким-либо причинам трудно писать, телефонный разговор проще.</p>",
  "_STEP_12_2_3_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_12_2_3_HOW_CHECKED_2_": "<p>Этап проверки применим, если предложение (чаще всего веб-приложение) предлагает техническую поддержку (например, по телефону, почте или через чат).</p>",
  "_STEP_12_2_3_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_12_2_3_HOW_CHECKED_4_": "<p>Для выполнения этого этапа проверки необходимо предложить различные возможности коммуникации для пользователей. Например, коммуникация через</p>",
  "_STEP_12_2_3_HOW_CHECKED_5_": "<ul><li><p>Электронную почту</p></li><li><p>Чат</p></li><li><p>Телефон</p></li><li><p>Видеотелефонию</p></li></ul>",
  "_STEP_12_2_3_HOW_CHECKED_6_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_12_2_3_HOW_CHECKED_7_": "<p>Один из подходов к проверке может заключаться в определении, доступна ли возможность связи с поддержкой через по крайней мере два различных коммуникационных канала (например, телефон и электронная почта).</p>",
  "_STEP_12_2_3_HOW_CHECKED_8_": "<p>Как этот этап проверки может быть реализован на практике, еще не полностью определено. Вы можете оставить свои замечания на GitHub <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">Issue</a>.</p>",
  "_STEP_12_2_3_SOURCES_1_": "<ul><li><p>На данный момент нет источников.</p></li></ul>",
  "_STEP_12_2_3_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_12_2_3_CLASSIFICATION_2_": "<h4 id=\"_12_2_3_effective_communication\">12.2.3 Эффективная коммуникация</h4>",
  "_STEP_12_2_3_CLASSIFICATION_3_": "<p>Услуги поддержки ИКТ должны учитывать коммуникационные потребности лиц с инвалидностью, либо напрямую, либо через посредническую точку.</p>"
}