{
  "_STEP_9_2_2_1_NAME_": "Zeitbegrenzungen anpassbar",
  "_STEP_9_2_2_1_WHAT_CHECKED_1_": "<p>Seiteninhalte werden ohne Zeitbegrenzung angezeigt, die Zeitbegrenzung ist abschaltbar, oder sie kann verlängert werden. Dies betrifft etwa:</p>",
  "_STEP_9_2_2_1_WHAT_CHECKED_2_": "<ul><li><p>zeitbegrenzte Dialoge, welche Nutzer zu Entscheidungen auffordern</p></li><li><p>Online-Transaktionen mit begrenzter Session-Dauer und automatischem Ausloggen bei längerer Inaktivität</p></li><li><p>das automatische Neu-Laden von Seiten oder die zeitverzögerte Weiterleitung zu einer anderen Seite</p></li><li><p>Wichtige Statusmeldungen, die nach kurzer Zeit automatisch schließen</p></li></ul>",
  "_STEP_9_2_2_1_WHY_CHECKED_1_": "<p>Die Auto-Aktualisierung durch das Neu-Laden einer Seite kann bei Screenreader-Nutzern das Vorlesen der Seiteninhalte unterbrechen und unvermittelt von vorne beginnen.</p>",
  "_STEP_9_2_2_1_WHY_CHECKED_2_": "<p>Bei zeitverzögerten Weiterleitungen sollen Nutzer etwas lesen, bevor sie auf eine andere Seite weitergeleitet werden. Die Zeitbegrenzung macht die zwischendurch angezeigte Seite für viele nicht zugänglich.</p>",
  "_STEP_9_2_2_1_WHY_CHECKED_3_": "<p>Wenn Zeitbegrenzungen sich nicht abschalten oder verlängern lassen, können Nutzer, die mehr Zeit für Eingaben brauchen, Online-Transaktionen oft nicht rechtzeitig abschließen.</p>",
  "_STEP_9_2_2_1_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_2_2_1_HOW_CHECKED_2_": "<ul><li><p>Die Prüfung auf Auto-Aktualisierung und Weiterleitung (Abschnitt <a href=\"#_2_1_prüfung_auf_auto_aktualisierung_durch_neu_laden_der_seite_und_weiterleitung_auf_andere_url\">2.1 Prüfung auf Auto-Aktualisierung durch Neu-Laden der Seite und Weiterleitung auf andere URL</a>) ist immer anwendbar.</p></li><li><p>Die Prüfung auf Abschaltbarkeit oder Verlängerbarkeit von Zeitbegrenzungen (Abschnitt <a href=\"#2.2Prüfung auf Abschaltbarkeit oder Verlängerbarkeit von Zeitbegrenzungen\">[2.2Prüfung auf Abschaltbarkeit oder Verlängerbarkeit von Zeitbegrenzungen]</a>) ist nur anwendbar auf Seiten mit Transaktionen, welche üblicherweise aus datenschutzrechtlichen oder sicherheitsrelevanten Gründen Zeitbegrenzungen unterliegen (etwa beim Online-Banking oder Online-Shops).</p></li><li><p>Die Prüfung von Zeitbegrenzungen bei wichtigen Statusmeldungen ist immer anwendbar, wenn (oft als Ergebnis einer Interaktion) Meldungen erscheinen und nach einer Zeitspanne (meist nach wenigen Sekunden) automatisch wieder verschwinden.</p></li></ul>",
  "_STEP_9_2_2_1_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_2_2_1_HOW_CHECKED_4_": "<h4 id=\"_2_1_prüfung_auf_auto_aktualisierung_durch_neu_laden_der_seite_und_weiterleitung_auf_andere_url\">2.1 Prüfung auf Auto-Aktualisierung durch Neu-Laden der Seite und Weiterleitung auf andere URL</h4>",
  "_STEP_9_2_2_1_HOW_CHECKED_5_": "<p>Quelltextanalyse: Vorhandensein des Markups prüfen.</p>",
  "_STEP_9_2_2_1_HOW_CHECKED_6_": "<ul><li><p>Taucht <code>http-equiv=\"refresh\"</code> im Kopfbereich der Seite auf, dann muss <code>content=\"0\"</code> sein (also eine Weiterleitung ohne Zeitverzögerung auslösen bzw. keine Aktualisierung auslösen).</p></li></ul>",
  "_STEP_9_2_2_1_HOW_CHECKED_7_": "<h4 id=\"_2_2_prüfung_auf_abschaltbarkeit_oder_verlängerbarkeit_von_zeitbegrenzungen\">2.2 Prüfung auf Abschaltbarkeit oder Verlängerbarkeit von Zeitbegrenzungen</h4>",
  "_STEP_9_2_2_1_HOW_CHECKED_8_": "<h5 id=\"_2_2_1_zeitbegrenzung_wird_angezeigt\">2.2.1 Zeitbegrenzung wird angezeigt</h5>",
  "_STEP_9_2_2_1_HOW_CHECKED_9_": "<p>Seiten können Zeitbegrenzungen auf verschiedene Weise anzeigen:</p>",
  "_STEP_9_2_2_1_HOW_CHECKED_10_": "<ul><li><p>Die verbleibende Zeitspanne (Session-Dauer) einer Transaktion wird angezeigt. Jede Interaktion setzt die Session-Dauer automatisch zurück.</p></li><li><p>Rechtzeitig vor Ablauf der Zeit erscheint ein Dialog zum Verlängern der Zeitbegrenzung.</p></li><li><p>Ein Kontrollelement erlaubt das Abschalten oder Verlängern der Zeitbegrenzung. Nutzer haben genügend Zeit, das Kontrollelement vor dem Ablauf der Zeit zu finden.</p></li></ul>",
  "_STEP_9_2_2_1_HOW_CHECKED_11_": "<h5 id=\"_2_2_2_nicht_unmittelbar_sichtbare_zeitbegrenzungen\">2.2.2 Nicht unmittelbar sichtbare Zeitbegrenzungen</h5>",
  "_STEP_9_2_2_1_HOW_CHECKED_12_": "<p>Wenn zu erwarten ist, dass eine Seite eine Zeitbegrenzung hat, aber weder eine laufende Anzeige der Session-Dauer noch ein Kontrollelement zum Abschalten oder Verlängern angeboten werden:</p>",
  "_STEP_9_2_2_1_HOW_CHECKED_13_": "<ol><li><p>Seiten, die üblicherweise eine begrenzte Session-Dauer haben (z. B. Online-Banking, Bezahlvorgänge von Shops) in dem gerade nicht zur Prüfung genutzten Browser aufrufen und Daten eingeben.</p></li><li><p>Den Browser für 20 Minuten nicht nutzen.</p></li><li><p>Nach Ablauf der 20 Minuten prüfen, ob die Seite noch verfügbar ist und Daten erfolgreich abgeschickt werden können.</p></li><li><p>Wenn die nach 20 Minuten sichtbare Seite mitteilt, dass die Zeit abgelaufen und die Session beendet worden ist, Seite erneut laden und abwarten, ob auf der Seite ein Dialog erscheint, der rechtzeitig (mindestens 20 Sekunden vor Ablaufen der Zeit) eine Verlängerungsmöglichkeit der Zeitbegrenzung anbietet.</p></li></ol>",
  "_STEP_9_2_2_1_HOW_CHECKED_14_": "<h4 id=\"_2_3_prüfung_von_zeitbegrenzungen_bei_wichtigen_statusmeldungen\">2.3 Prüfung von Zeitbegrenzungen bei wichtigen Statusmeldungen</h4>",
  "_STEP_9_2_2_1_HOW_CHECKED_15_": "<ol><li><p>Bieten Statusmeldungen für Nutzende wesentliche Informationen, die nicht auf andere Wesie verfügbar sind, und schließen automatisch nach kurzer Zeit? Für den Nutzer nicht wesentliche Statusmeldungen sind solche, die ein erwartetes Ergebnis einer Interaktion zusätzlich vermitteln, etwa, nach Aktivieren eines Schalters \"Sichern\" die Meldung \"Ihr Dokument wurde gespeichert\", oder, nach dem Abschicken eines Formulars, die Meldung \"Ihre Angaben wurden übermittelt\" oder ähnlich. Das automatische Schließen solcher nicht wesentlichen Meldungen sollte nicht negativ bewertet werden (siehe 3. Hinweise, 3.1 Zeitbegrenzte Stuatusmeldungen).</p></li></ol>",
  "_STEP_9_2_2_1_HOW_CHECKED_16_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_9_2_2_1_HOW_CHECKED_17_": "<h4 id=\"_3_1_zeitbegrenzte_stuatusmeldungen\">3.1 Zeitbegrenzte Stuatusmeldungen</h4>",
  "_STEP_9_2_2_1_HOW_CHECKED_18_": "<p>Zeitbegrenzte Statusmeldungen müssen nicht zeitlich einstellbar sein, wenn es eine alternative Informationsmöglichkeit ohne Zeitbegrenzung gibt. Beispiel: Eine webbasierter E-Mail-Client benachrichtigt über den Eingang einer neuen E-Mail mit einer temporären Meldung (Toast-Meldung). Die Benutzer können den Eingang von E-Mails auch auf andere Weise feststellen, z. B. durch Abrufen des Posteingangs. Wenn Nutzende keine andere Möglichkeit haben, die gleichen Informationen zu finden (oder die gleiche Funktion auszuführen), dann müssen Meldungen dieses Erfolgskriterium erfüllen, damit die Benutzer genügend Zeit haben, um auf die Informationen zuzugreifen.</p>",
  "_STEP_9_2_2_1_HOW_CHECKED_19_": "<h4 id=\"_3_2_externe_zeitbegrenzungen\">3.2 Externe Zeitbegrenzungen</h4>",
  "_STEP_9_2_2_1_HOW_CHECKED_20_": "<p>Dieser Prüfschritt bezieht sich nur auf vom Inhalt hervorgerufene Zeitbegrenzungen (sowohl serverseitig als auch clientseitig). Externe Zeitbegrenzungen, etwa des User Agents, sind nicht im Einflussbereich des Autors und damit nicht Gegenstand der BITV.</p>",
  "_STEP_9_2_2_1_HOW_CHECKED_21_": "<p>Ob auf einer Seite eine Zeitbegrenzung tatsächlich vorliegt, ist aus dem Quelltext der Seite oft nicht zu entnehmen, denn die Zeitbegrenzung kann auch serverseitig gesetzt werden.</p>",
  "_STEP_9_2_2_1_HOW_CHECKED_22_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_9_2_2_1_HOW_CHECKED_23_": "<h4 id=\"_nicht_erfüllt\">Nicht erfüllt</h4>",
  "_STEP_9_2_2_1_HOW_CHECKED_24_": "<ul><li><p>Die Seite wird über Reload (<code>http-equiv=\"refresh\"</code>) periodisch aktualisiert.</p></li><li><p>Es gibt eine verzögerte Weiterleitung auf eine andere Seite.</p></li><li><p>Der Ablauf einer Zeitbegrenzung wird nicht angezeigt. Erst mit dem Abschicken des Formulars wird darüber informiert, dass die Sessiondauer überschritten wurde.</p></li></ul>",
  "_STEP_9_2_2_1_HOW_CHECKED_25_": "<h4 id=\"_nicht_voll_erfüllt\">Nicht voll erfüllt</h4>",
  "_STEP_9_2_2_1_HOW_CHECKED_26_": "<ul><li><p>Die Zeitbefristung der Session wird angezeigt und Nutzer-Aktivitäten setzen die Frist zurück, es gibt jedoch spätestens 20 Sekunden vor Ablauf der Frist keinen Dialog, der darüber informiert und Möglichkeiten zur Verlängerung bietet.</p></li><li><p>Für das Auffinden des Kontrollelements zum Abschalten der Zeitbegrenzung steht nicht genug Zeit zur Verfügung.</p></li></ul>",
  "_STEP_9_2_2_1_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_von_anderen_prüfschritten\">Abgrenzung von anderen Prüfschritten</h3>",
  "_STEP_9_2_2_1_CLASSIFICATION_2_": "<p>Dieser Prüfschritt 9.2.2.1 betrifft Zeitbegrenzungen, welche die ganze Seite betreffen, unabhängig davon, ob die zeitbegrenzten Inhalte bewegt sind (also ablenken) oder nicht. Geprüft wird, ob solche Zeitbegrenzungen abschaltbar oder verlängerbar sind.</p>",
  "_STEP_9_2_2_1_CLASSIFICATION_3_": "<p>Der Prüfschritt 9.2.2.2 \"Bewegte Inhalte abschaltbar\" betrifft dagegen bewegte oder autoaktualisierte Inhalte, die Nutzer ablenken oder durch ihren vorgegebenen zeitlichen Ablauf für bestimmte Nutzer schwierig wahrnehmbar sind. Hier wird geprüft, ob Nutzer die Möglichkeit haben, bewegte oder autoaktualisierte Inhalte anzuhalten oder auszublenden.</p>",
  "_STEP_9_2_2_1_CLASSIFICATION_4_": "<p>Wenn es ein Kontrollelement oder einen dokumentierten Tastaturbefehl gibt, um Zeitbegrenzungen abzuschalten oder zu verlängern, wird in diesem Prüfschritt lediglich geprüft, ob Nutzer genügend Zeit haben, diesen Mechanismus zu finden und zu nutzen. In anderen Prüfkriterien wird geprüft, ob der Mechanismus selbst zugänglich und verständlich ist (etwa in 9.2.1.1 \"Ohne Maus nutzbar\" oder 9.1.3.1h \"Beschriftung von Formularelementen programmatisch ermittelbar\").</p>",
  "_STEP_9_2_2_1_CLASSIFICATION_5_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_2_2_1_CLASSIFICATION_6_": "<h4 id=\"_guideline\">Guideline</h4>",
  "_STEP_9_2_2_1_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#enough-time\"> Guideline 2.2 Enough Time: Provide users enough time to read and use content.</a></p></li></ul>",
  "_STEP_9_2_2_1_CLASSIFICATION_8_": "<h4 id=\"_success_criteria\">Success criteria</h4>",
  "_STEP_9_2_2_1_CLASSIFICATION_9_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#timing-adjustable\"> 2.2.1 Timing Adjustable</a> (Level A)</p></li></ul>",
  "_STEP_9_2_2_1_CLASSIFICATION_10_": "<h4 id=\"_techniques\">Techniques</h4>",
  "_STEP_9_2_2_1_CLASSIFICATION_11_": "<h5 id=\"_general_techniques\">General Techniques</h5>",
  "_STEP_9_2_2_1_CLASSIFICATION_12_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G133.html\"> G133: Providing a checkbox on the first page of a multipart form that allows users to ask for longer session time limit or no session time limit</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G180.html\"> G180: Providing the user with a means to set the time limit to 10 times the default time limit</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G198.html\"> G198: Providing a way for the user to turn the time limit off</a></p></li></ul>",
  "_STEP_9_2_2_1_CLASSIFICATION_13_": "<h5 id=\"_client_side_scripting_techniques\">Client-side Scripting Techniques</h5>",
  "_STEP_9_2_2_1_CLASSIFICATION_14_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/client-side-script/SCR16.html\"> SCR16: Providing a script that warns the user a time limit is about to expire</a> AND <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/client-side-script/SCR1.html\"> SCR1: Allowing the user to extend the default time limit</a></p></li></ul>",
  "_STEP_9_2_2_1_CLASSIFICATION_15_": "<h5 id=\"_failures\">Failures</h5>",
  "_STEP_9_2_2_1_CLASSIFICATION_16_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F40\"> F40: Failure of Success Criterion 2.2.1 and 2.2.4 due to using meta redirect with a time limit</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F41\"> F41: Failure of Success Criterion 2.2.1, 2.2.4, and 3.2.5 due to using meta refresh with a time-out</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F58\"> F58: Failure of Success Criterion 2.2.1 due to using server-side techniques to automatically redirect pages after a time-out</a></p></li></ul>",
  "_STEP_9_2_2_1_QUESTIONS_1_": "<h3 id=\"_wie_kann_durch_ein_kontrollelement_auf_der_webseite_sichergestellt_werden_dass_der_benutzer_eine_zeitbegrenzung_oder_autoaktualisierung_auf_wunsch_abschalten_kann\">Wie kann durch ein Kontrollelement auf der Webseite sichergestellt werden, dass der Benutzer eine Zeitbegrenzung oder Autoaktualisierung auf Wunsch abschalten kann?</h3>",
  "_STEP_9_2_2_1_QUESTIONS_2_": "<p>Wichtig ist, dass die Autoaktualisierung oder das Ende der Zeitbegrenzung nicht erfolgt, bevor der Benutzer auf ein entsprechendes Kontrollelement zum Abschalten gestoßen ist. Daher sollte die Schaltfläche oder der Link zum Abschalten oder Verlängern am Seitenbeginn oder nahe am Seitenbeginn angezeigt werden, damit er von Menschen mit verschiedensten Behinderungen auch gefunden und aktiviert werden kann.</p>",
  "_STEP_9_2_2_1_QUESTIONS_3_": "<p>Dennoch ist nicht sicher, dass Benutzer die Option zum Abschalten der Autoaktualisierung oder Zeitbegrenzung finden und verstehen.</p>"
}
