{
  "_STEP_9_2_2_1_NAME_": "Возможность настройки временных ограничений",
  "_STEP_9_2_2_1_WHAT_CHECKED_1_": "<p>Содержимое страницы отображается без временного ограничения, время может быть отключено или продлено. Это касается, например:</p>",
  "_STEP_9_2_2_1_WHAT_CHECKED_2_": "<ul><li><p>временно ограниченные диалоги, которые требуют от пользователя принятия решений</p></li><li><p>онлайн-транзакции с ограниченной длительностью сессии и автоматическим выходом при длительной неактивности</p></li><li><p>автоматическое перезагрузка страниц или временная переадресация на другую страницу</p></li><li><p>важные статусные сообщения, которые автоматически закрываются через короткое время</p></li></ul>",
  "_STEP_9_2_2_1_WHY_CHECKED_1_": "<p>Автоматическое обновление страницы может прерывать чтение содержимого страницы программой для чтения с экрана и неожиданно начинать сначала.</p>",
  "_STEP_9_2_2_1_WHY_CHECKED_2_": "<p>При временной переадресации пользователи должны успеть прочитать информацию, прежде чем они будут перенаправлены на другую страницу. Временное ограничение делает страницу недоступной для многих.</p>",
  "_STEP_9_2_2_1_WHY_CHECKED_3_": "<p>Если временные ограничения нельзя отключить или продлить, пользователи, которым необходимо больше времени для ввода данных, часто не могут завершить онлайн-транзакции вовремя.</p>",
  "_STEP_9_2_2_1_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_9_2_2_1_HOW_CHECKED_2_": "<ul><li><p>Проверка на авто-обновление и переадресацию (раздел <a href=\"#_2_1_prüfung_auf_auto_aktualisierung_durch_neu_laden_der_seite_und_weiterleitung_auf_andere_url\">2.1 Проверка на авто-обновление и переадресацию</a>) всегда применима.</p></li><li><p>Проверка на возможность отключения или продления временных ограничений (раздел <a href=\"#2.2Prüfung auf Abschaltbarkeit oder Verlängerbarkeit von Zeitbegrenzungen\">[2.2 Проверка на возможность отключения или продления временных ограничений]</a>) применима только к страницам с транзакциями, которые обычно подлежат временным ограничениям по причинам конфиденциальности или безопасности (например, онлайн-банкинг или онлайн-магазины).</p></li><li><p>Проверка временных ограничений на важные статусные сообщения всегда применима, если (часто в результате взаимодействия) появляются сообщения, которые исчезают после определенного времени (обычно после нескольких секунд).</p></li></ul>",
  "_STEP_9_2_2_1_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_2_2_1_HOW_CHECKED_4_": "<h4 id=\"_2_1_prüfung_auf_auto_aktualisierung_durch_neu_laden_der_seite_und_weiterleitung_auf_andere_url\">2.1 Проверка на авто-обновление и переадресацию</h4>",
  "_STEP_9_2_2_1_HOW_CHECKED_5_": "<p>Анализ исходного кода: проверить наличие разметки.</p>",
  "_STEP_9_2_2_1_HOW_CHECKED_6_": "<ul><li><p>Если в заголовке страницы присутствует <code>http-equiv=\"refresh\"</code>, то <code>content=\"0\"</code> должно быть установлено (то есть должно вызывать перенаправление без задержки или не вызывать обновление).</p></li></ul>",
  "_STEP_9_2_2_1_HOW_CHECKED_7_": "<h4 id=\"_2_2_prüfung_auf_abschaltbarkeit_oder_verlängerbarkeit_von_zeitbegrenzungen\">2.2 Проверка на возможность отключения или продления временных ограничений</h4>",
  "_STEP_9_2_2_1_HOW_CHECKED_8_": "<h5 id=\"_2_2_1_zeitbegrenzung_wird_angezeigt\">2.2.1 Отображение временного ограничения</h5>",
  "_STEP_9_2_2_1_HOW_CHECKED_9_": "<p>Страницы могут отображать временные ограничения разными способами:</p>",
  "_STEP_9_2_2_1_HOW_CHECKED_10_": "<ul><li><p>Отображается оставшееся время (продолжительность сессии) транзакции. Каждое взаимодействие автоматически сбрасывает время сессии.</p></li><li><p>За короткое время до истечения времени появляется диалог с возможностью продлить время ограничения.</p></li><li><p>Элемент управления позволяет отключить или продлить временное ограничение. Пользователи имеют достаточно времени, чтобы найти элемент управления перед истечением времени.</p></li></ul>",
  "_STEP_9_2_2_1_HOW_CHECKED_11_": "<h5 id=\"_2_2_2_nicht_unmittelbar_sichtbare_zeitbegrenzungen\">2.2.2 Не непосредственно видимые временные ограничения</h5>",
  "_STEP_9_2_2_1_HOW_CHECKED_12_": "<p>Если ожидается, что на странице есть временное ограничение, но ни отображение времени сессии, ни элемент управления для отключения или продления не предлагаются:</p>",
  "_STEP_9_2_2_1_HOW_CHECKED_13_": "<ol><li><p>Страницы, обычно имеющие ограниченное время сессии (например, онлайн-банкинг, платежи в магазинах), вызвать в браузере, который не используется для проверки, и ввести данные.</p></li><li><p>Не использовать браузер в течение 20 минут.</p></li><li><p>По истечении 20 минут проверить, доступна ли страница и можно ли успешно отправить данные.</p></li><li><p>Если после 20 минут на странице сообщается, что время истекло и сессия завершена, перезагрузить страницу и подождать, появится ли диалог, предлагающий возможность продления времени за 20 секунд до истечения срока.</p></li></ol>",
  "_STEP_9_2_2_1_HOW_CHECKED_14_": "<h4 id=\"_2_3_prüfung_von_zeitbegrenzungen_bei_wichtigen_statusmeldungen\">2.3 Проверка временных ограничений на важные статусные сообщения</h4>",
  "_STEP_9_2_2_1_HOW_CHECKED_15_": "<ol><li><p>Предоставляют ли статусные сообщения пользователям существенную информацию, которая не доступна другим способом, и автоматически закрываются через короткое время? Для пользователя несущественные статусные сообщения - это те, которые дополнительно передают ожидаемый результат взаимодействия, например, после активации кнопки \"Сохранить\" сообщение \"Ваш документ был сохранен\", или после отправки формы, сообщение \"Ваши данные были отправлены\" или подобное. Автоматическое закрытие таких несущественных сообщений не должно оцениваться отрицательно (см. 3. Hinweise, 3.1 Zeitbegrenzte Stuatusmeldungen).</p></li></ol>",
  "_STEP_9_2_2_1_HOW_CHECKED_16_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_9_2_2_1_HOW_CHECKED_17_": "<h4 id=\"_3_1_zeitbegrenzte_stuatusmeldungen\">3.1 Временно ограниченные статусные сообщения</h4>",
  "_STEP_9_2_2_1_HOW_CHECKED_18_": "<p>Временно ограниченные статусные сообщения не должны быть временно настраиваемыми, если есть альтернативный способ получения информации без временного ограничения. Пример: Веб-клиент электронной почты уведомляет о поступлении нового письма с помощью временного сообщения (Toast-уведомление). Пользователи могут определять поступление писем и другими способами, например, проверяя входящие. Если у пользователей нет другой возможности найти ту же информацию (или выполнить ту же функцию), то сообщения должны соответствовать этому критерию успеха, чтобы у пользователей было достаточно времени для доступа к информации.</p>",
  "_STEP_9_2_2_1_HOW_CHECKED_19_": "<h4 id=\"_3_2_externe_zeitbegrenzungen\">3.2 Внешние временные ограничения</h4>",
  "_STEP_9_2_2_1_HOW_CHECKED_20_": "<p>Этот этап проверки относится только к временным ограничениям, вызванным содержимым (как на стороне сервера, так и на стороне клиента). Внешние временные ограничения, например, агента пользователя, находятся вне контроля автора и, следовательно, не являются предметом BITV.</p>",
  "_STEP_9_2_2_1_HOW_CHECKED_21_": "<p>Наличие временного ограничения на странице часто невозможно установить из исходного кода страницы, так как временное ограничение может также быть установлено на стороне сервера.</p>",
  "_STEP_9_2_2_1_HOW_CHECKED_22_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_2_2_1_HOW_CHECKED_23_": "<h4 id=\"_nicht_erfüllt\">Не выполнено</h4>",
  "_STEP_9_2_2_1_HOW_CHECKED_24_": "<ul><li><p>Страница периодически обновляется через перезагрузку (<code>http-equiv=\"refresh\"</code>).</p></li><li><p>Есть задержка перед перенаправлением на другую страницу.</p></li><li><p>Окончание временного ограничения не отображается. Информация об этом появляется только после отправки формы, сообщая о превышении времени сессии.</p></li></ul>",
  "_STEP_9_2_2_1_HOW_CHECKED_25_": "<h4 id=\"_nicht_voll_erfüllt\">Не полностью выполнено</h4>",
  "_STEP_9_2_2_1_HOW_CHECKED_26_": "<ul><li><p>Ограничение времени сессии отображается, и активности пользователя сбрасывают таймер, однако за 20 секунд до его истечения нет диалога, информирующего об этом и предлагающего варианты продления.</p></li><li><p>Не хватает времени для нахождения элемента управления для отключения временного ограничения.</p></li></ul>",
  "_STEP_9_2_2_1_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_von_anderen_prüfschritten\">Разграничение с другими шагами проверки</h3>",
  "_STEP_9_2_2_1_CLASSIFICATION_2_": "<p>Этот шаг проверки 9.2.2.1 касается временных ограничений, затрагивающих всю страницу, независимо от того, движутся ли ограниченные содержимое или нет. Проверяется, могут ли эти ограничения быть отключены или продлены.</p>",
  "_STEP_9_2_2_1_CLASSIFICATION_3_": "<p>В то время как шаг проверки 9.2.2.2 \"Отключаемое движущееся содержимое\" касается движущихся или автообновляемых содержаний, отвлекающих пользователей или трудно воспринимаемых из-за их временных параметров. Здесь проверяется, могут ли пользователи останавливать или скрывать такие содержимое.</p>",
  "_STEP_9_2_2_1_CLASSIFICATION_4_": "<p>Если есть элемент управления или задокументированная клавиша для отключения или продления временных ограничений, этот шаг проверки оценивает, достаточно ли времени у пользователей, чтобы найти и использовать этот механизм. В других критериях оценки проверяется, доступен и понятен ли сам механизм (например, в 9.2.1.1 \"Используемость без мыши\" или 9.1.3.1h \"Программное определение меток элементов формы\").</p>",
  "_STEP_9_2_2_1_CLASSIFICATION_5_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация шага проверки по WCAG 2.1</h3>",
  "_STEP_9_2_2_1_CLASSIFICATION_6_": "<h4 id=\"_guideline\">Руководство</h4>",
  "_STEP_9_2_2_1_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#enough-time\"> Руководство 2.2 Достаточно времени: Обеспечить пользователям достаточно времени для чтения и использования контента.</a></p></li></ul>",
  "_STEP_9_2_2_1_CLASSIFICATION_8_": "<h4 id=\"_success_criteria\">Критерии успеха</h4>",
  "_STEP_9_2_2_1_CLASSIFICATION_9_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#timing-adjustable\"> 2.2.1 Регулируемое время</a> (Уровень A)</p></li></ul>",
  "_STEP_9_2_2_1_CLASSIFICATION_10_": "<h4 id=\"_techniques\">Техники</h4>",
  "_STEP_9_2_2_1_CLASSIFICATION_11_": "<h5 id=\"_general_techniques\">Общие техники</h5>",
  "_STEP_9_2_2_1_CLASSIFICATION_12_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G133.html\"> G133: Предоставление флажка на первой странице многостраничной формы, позволяющего пользователям запросить увеличение времени сессии или отсутствие ограничения времени сессии</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G180.html\"> G180: Предоставление пользователю средств для установки временного ограничения в 10 раз больше стандартного</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G198.html\"> G198: Предоставление способа пользователю отключить временное ограничение</a></p></li></ul>",
  "_STEP_9_2_2_1_CLASSIFICATION_13_": "<h5 id=\"_client_side_scripting_techniques\">Техники клиентского скриптинга</h5>",
  "_STEP_9_2_2_1_CLASSIFICATION_14_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/client-side-script/SCR16.html\"> SCR16: Предоставление скрипта, предупреждающего пользователя о скором истечении времени</a> И <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/client-side-script/SCR1.html\"> SCR1: Позволение пользователю продлить стандартное временное ограничение</a></p></li></ul>",
  "_STEP_9_2_2_1_CLASSIFICATION_15_": "<h5 id=\"_failures\">Неудачи</h5>",
  "_STEP_9_2_2_1_CLASSIFICATION_16_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F40\"> F40: Неудача критерия успеха 2.2.1 и 2.2.4 из-за использования мета-перенаправления с временным ограничением</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F41\"> F41: Неудача критериев успеха 2.2.1, 2.2.4 и 3.2.5 из-за использования мета-обновления с тайм-аутом</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F58\"> F58: Неудача критерия успеха 2.2.1 из-за использования серверных техник для автоматической переадресации страниц после тайм-аута</a></p></li></ul>",
  "_STEP_9_2_2_1_QUESTIONS_1_": "<h3 id=\"_wie_kann_durch_ein_kontrollelement_auf_der_webseite_sichergestellt_werden_dass_der_benutzer_eine_zeitbegrenzung_oder_autoaktualisierung_auf_wunsch_abschalten_kann\">Как можно обеспечить через элемент управления на веб-сайте, чтобы пользователь мог по желанию отключить временное ограничение или автообновление?</h3>",
  "_STEP_9_2_2_1_QUESTIONS_2_": "<p>Важно, чтобы автообновление или окончание временного ограничения не происходило, пока пользователь не столкнется с соответствующим элементом управления для его отключения. Поэтому кнопка или ссылка для отключения или продления должны отображаться в начале страницы или рядом с началом, чтобы люди с различными ограничениями также могли найти и активировать их.</p>",
  "_STEP_9_2_2_1_QUESTIONS_3_": "<p>Тем не менее, не гарантируется, что пользователи найдут и поймут опцию для отключения автообновления или временного ограничения.</p>"
}