{
  "_STEP_9_2_5_1_NAME_": "Alternativen für komplexe Zeiger-Gesten",
  "_STEP_9_2_5_1_NAME_MENU_": "9.2.5.1 Alternativen für komplexe Zeiger-Gesten",
  "_STEP_9_2_5_1_WHAT_CHECKED_1_": "<p>Wenn Webinhalte Funktionen implementieren, die über pfadbasierte Zeiger-Gesten (etwa Wischgesten oder Mehrpunktgesten) bedient werden können, gibt es Alternativen für die Aktivierung mittels einer einfachen Zeigereingabe.</p>",
  "_STEP_9_2_5_1_WHAT_CHECKED_2_": "<p>'Zeiger' schließt dabei indirekte Eingaben mittels Mauszeiger ebenso wie direkte Eingaben ein, etwa mit dem Finger auf dem Touchscreen oder mit dem Stift auf einem Grafiktablett.</p>",
  "_STEP_9_2_5_1_WHAT_CHECKED_3_": "<p>Ausgenommen sind Fälle, in denen die pfadbasierte oder Mehrpunkt-Eingabe essenziell wichtig ist - etwa bei der Handschrifterkennung.</p>",
  "_STEP_9_2_5_1_WHAT_CHECKED_4_": "<p>Ziehbewegungen (Dragging Motions) wie in Drag-and-Drop-Aktionen gelten nicht als pfadbasierte Geste im Sinne dieser Anforderung.</p>",
  "_STEP_9_2_5_1_WHAT_CHECKED_5_": "<p>Diese Anforderung gilt nur für Zeiger-Gesten, die von Webinhalten interpretiert und verarbeitet werden. Sie betreffen also nicht Gesten für die Bedienung von Nutzeragenten oder Hilfsmitteln, etwa Gesten zur Navigation zwischen Seiten im Browser oder zur Nutzung systemseitiger Screenreader.</p>",
  "_STEP_9_2_5_1_WHAT_CHECKED_6_": "<p>Die Anforderung gilt auch nicht für Inhalte, bei denen das Verhalten vom Betriebssystem oder Browser bestimmt wird und nicht von Web-Autoren. Ein Beispiel hierfür sind scrollbare Bereiche, die über CSS <code>overflow:scroll</code> definiert sind und für die kein Verhalten bezüglich Zeiger-Gresten über JabvaScript festgelegt wurde, und bei denen die Scrollbalken nicht explizit vom Autor versteckt werden.</p>",
  "_STEP_9_2_5_1_WHAT_CHECKED_7_": "<p>Beispiele für pfadbasierte Gesten:</p>",
  "_STEP_9_2_5_1_WHAT_CHECKED_8_": "<ul><li><p>Wischgeste, etwa zum Bewegen etwa von autor-definierten Slider-Bereichen oder zum Löschen von Inhalten</p></li><li><p>Ziehen eines autor-definierten Sliders, wenn eine initiale Richtung nötig ist, um das Element zu bewegen</p></li><li><p>Zeichnen eines Pfads, z. B. ein 'Z' zum Widerrufen</p></li></ul>",
  "_STEP_9_2_5_1_WHAT_CHECKED_9_": "<p>Beispiele für Mehrpunkt-Gesten:</p>",
  "_STEP_9_2_5_1_WHAT_CHECKED_10_": "<ul><li><p>Zwei-Finger-Spreizgeste zum Zoomen (sofern dies vom Webinhalt und nicht vom Browser implementiert ist)</p></li><li><p>\"Split tap\" (ein Finger hält, der andere tippt)</p></li><li><p>Streichen mit mehreren Fingern</p></li></ul>",
  "_STEP_9_2_5_1_WHAT_CHECKED_11_": "<p><em>Hinweis</em>: Pfadunabhängige Ziehbewegungen (dragging motions) wie Drag-and-Drop-Eingaben gelten nicht als pfadbasiert im Sinne dieses Prüfschritts, da hier nur Beginn und Endpunkt feststehen und der Pfad dazwischen beliebig ist. Wenn Elemente dem gedrückten Zeiger (Maus-Cursor oder Finger) in jede Richtung folgen und keine initiale Richtung notwendig ist, um die Geste zu vollziehen, ist von einer Ziehbewegung auszugehen.</p>",
  "_STEP_9_2_5_1_WHAT_CHECKED_12_": "<p>Abhängig von der Prüfumgebung kann diese Unterscheidung unterschiedlich ausfallen. So ist auf Touchscreens in mobilen Systemumgebungen häufig eine initiale horizontale Richtung zum Bewegen von horizontalen Slidern nötig, da bei vertikaler Bewegung stattdessen die Seite gescrollt wird. In dieser Umgebung würde die Bedienung eines solchen Sliders also als pfadbasiert gelten müssen und deshalb unter diesen Prüfschritt fallen.</p>",
  "_STEP_9_2_5_1_WHY_CHECKED_1_": "<p>Für Menschen mit Bewegungseinschränkungen ist es oft schwierig und teilweise unmöglich, komplexe Zeiger-Gesten erfolgreich auszuführen. Deshalb sollen solche Gesten, wenn Sie von Web-Inhalten implementiert werden, nicht der einzige Weg sein, eine Funktion auszuführen. Beispiele für komplexe Gesten sind Wischgesten vom Rand her, um Menüs einzublenden, Wischgesten zum Bewegen von autor-definierten Karussells bzw. Slidern, oder Mehrpunktgesten wie die Spreizgeste zum Vergrößern eines Kartenausschnitts.</p>",
  "_STEP_9_2_5_1_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_2_5_1_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn Web-Inhalte Eventhandler implementieren, die auf komplexe Gesten (etwa Wischgesten, Mehrpunkt-Gesten) ansprechen. Ausgenommen sind also Inhalte, bei denen das Verhalten vom Betriebssystem oder Browser bestimmt wird und nicht von Web-Autoren.</p>",
  "_STEP_9_2_5_1_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_2_5_1_HOW_CHECKED_4_": "<ol><li><p>Seite auf einem Smartphone aufrufen.</p></li><li><p>Sichtprüfung und Ausprobieren, ob Webinhalte komplexe Gesten implementieren (z. B. auf Karussells, Slidern). Lassen sich Slider oder andere Inhaltselemente durch autor-definierte Wischgesten bewegen? Werden durch Wischgesten vom Rand her Menüs oder andere Webinhalte eingeblendet? Reagieren bestimmte Elemente (etwa Karten) auf die Zwei-Finger-Spreizgeste zum Ändern des Zoomfaktors?</p></li><li><p>Prüfen, ob die über komplexe Zeigergesten auslösbare Funktion auch über einfache Zeiger-Gesten wie Tippen, Doppeltippen oder Tippen-und-Halten ausgelöst werden kann, etwa durch Aktivierung von alternativen statischen Elementen (z. B. Tasten, die Slider bewegen, Werte erhöhen oder verringern, oder Menüs einblenden).</p></li></ol>",
  "_STEP_9_2_5_1_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_9_2_5_1_HOW_CHECKED_6_": "<ul><li><p>Webinhalte können ggf. Alternativen zur Aktivierung über einfache Zeiger-Gesten nur in bestimmten Systemumgebungen und Benutzeragenten anbieten, nicht aber in anderen. So kann beispielsweise ein Test auf einem mobilen Gerät erforderlich sein, um festzustellen, ob die in einem Desktop-Browser angebotenen Alternativen zur Aktivierung über einfache Zeiger-Gesten auch in mobilen Browsern verfügbar sind.</p></li><li><p>Ausgenommen sind Funktionen, die von Natur aus und notwendigerweise auf komplexen Pfaden oder Mehrpunktgesten basieren. So wird beispielsweise die Eingabe der eigenen Signatur von Natur aus pfadbasiert sein.</p></li></ul>",
  "_STEP_9_2_5_1_HOW_CHECKED_7_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_9_2_5_1_HOW_CHECKED_8_": "<h4 id=\"_prüfschritt_erfüllt\">Prüfschritt erfüllt</h4>",
  "_STEP_9_2_5_1_HOW_CHECKED_9_": "<ul><li><p>Für alle autor-definierten komplexen Zeiger-Gesten gibt es alternative Eingabemöglichkeiten über einfache Zeiger-Gesten in den Umgebungen, die in die Prüfung gemäß <em>Accessibility Baseline</em> einbezogen sind.</p></li></ul>",
  "_STEP_9_2_5_1_SOURCES_1_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/pointer-gestures.html\"> Understanding Success Criterion 2.5.1: Pointer Gestures</a> (zur Zeit nur auf Englisch verfügbar)</p></li><li><p><a href=\"https://github.com/w3c/wcag/issues/2684\">Github-Issue zur Behandlung von scrollbaren Bereichen bezüglich Anforderungen nach 2.5.1 Ponter Gestures unfd 2.5.7 Dragging Movements</a>. Das Ergebnis der langen Diskussion war, dass für Slider bzw. scrollbare Bereiche nur Alternativen gefordert werden, wenn das Verhalten über Scripts von Web-Autoren explizit definiert wurde und nicht vom Betriebssystem bzw. Browser gehandhabt wird. <a href=\"https://github.com/w3c/wcag/issues/2684\" class=\"bare\">https://github.com/w3c/wcag/issues/2684</a></p></li></ul>",
  "_STEP_9_2_5_1_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_2_5_1_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Guideline</h4>",
  "_STEP_9_2_5_1_CLASSIFICATION_3_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#input-modalities\"> Guideline 2.5 Input Modalities: Make it easier for users to operate functionality through various inputs beyond keyboard</a></p></li></ul>",
  "_STEP_9_2_5_1_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Success criterion</h4>",
  "_STEP_9_2_5_1_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#pointer-gestures\"> 2.5.1 Pointer Gestures</a> (Level A)</p></li></ul>",
  "_STEP_9_2_5_1_CLASSIFICATION_6_": "<h4 id=\"_sufficient_techniques\">Sufficient Techniques</h4>",
  "_STEP_9_2_5_1_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G215\"> G215: Providing controls to achieve the same result as path based or multipoint gestures</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G216\"> G216: Providing single point activation for a control slider</a></p></li></ul>",
  "_STEP_9_2_5_1_CLASSIFICATION_8_": "<h4 id=\"_failures\">Failures</h4>",
  "_STEP_9_2_5_1_CLASSIFICATION_9_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F105\"> F105: Failure of Success Criterion 2.5.1 due to providing functionality via a path-based gesture without simple pointer alternative</a></p></li></ul>"
}
