{
  "_STEP_9_2_5_1_NAME_": "Альтернативы для сложных жестов указателя",
  "_STEP_9_2_5_1_NAME_MENU_": "9.2.5.1 Альтернативы для сложных жестов указателя",
  "_STEP_9_2_5_1_WHAT_CHECKED_1_": "<p>Если веб-контент реализует функции, которые могут быть активированы с помощью жестов указателя на основе пути (например, жесты свайпа или многоточечные жесты), должны быть предусмотрены альтернативы для активации с помощью простого ввода указателя.</p>",
  "_STEP_9_2_5_1_WHAT_CHECKED_2_": "<p>'Указатель' включает косвенный ввод с помощью курсора мыши, так же как и прямой ввод, например, пальцем на сенсорном экране или стилусом на графическом планшете.</p>",
  "_STEP_9_2_5_1_WHAT_CHECKED_3_": "<p>Исключения составляют случаи, когда ввод на основе пути или многоточечный ввод является существенно важным, например, для распознавания рукописного ввода.</p>",
  "_STEP_9_2_5_1_WHAT_CHECKED_4_": "<p>Перетаскивание (Dragging Motions), как в действиях перетаскивания и отпускания (drag-and-drop), не считаются жестом на основе пути в рамках этого требования.</p>",
  "_STEP_9_2_5_1_WHAT_CHECKED_5_": "<p>Это требование применяется только к жестам указателя, которые интерпретируются и обрабатываются веб-контентом. Оно не касается жестов для управления пользовательскими агентами или вспомогательными технологиями, например, жестов для навигации между страницами в браузере или для использования системного скринридера.</p>",
  "_STEP_9_2_5_1_WHAT_CHECKED_6_": "<p>Требование также не применяется к контенту, поведение которого определяется операционной системой или браузером, а не веб-авторами. Примером может служить область с прокруткой, определенная с помощью CSS <code>overflow:scroll</code>, для которой не задано поведение в отношении жестов указателя через JavaScript, и при этом автор не скрыл полосы прокрутки.</p>",
  "_STEP_9_2_5_1_WHAT_CHECKED_7_": "<p>Примеры жестов на основе пути:</p>",
  "_STEP_9_2_5_1_WHAT_CHECKED_8_": "<ul><li><p>Жест свайпа, например, для перемещения пользовательских областей слайдера или для удаления контента</p></li><li><p>Перетаскивание пользовательского слайдера, когда для перемещения элемента необходимо начальное направление</p></li><li><p>Рисование пути, например, 'Z' для отмены</p></li></ul>",
  "_STEP_9_2_5_1_WHAT_CHECKED_9_": "<p>Примеры многоточечных жестов:</p>",
  "_STEP_9_2_5_1_WHAT_CHECKED_10_": "<ul><li><p>Жест распространения двумя пальцами для масштабирования (если это реализовано веб-контентом, а не браузером)</p></li><li><p>'Раздельное касание' (один палец держит, другой тапает)</p></li><li><p>Свайп несколькими пальцами</p></li></ul>",
  "_STEP_9_2_5_1_WHAT_CHECKED_11_": "<p><em>Примечание</em>: Движения перетаскивания, такие как ввод с помощью перетаскивания и отпускания (drag-and-drop), не считаются основанными на пути в рамках этого шага проверки, так как в этом случае определены только начальная и конечная точки, а путь между ними может быть любым. Если элементы следуют за удерживаемым указателем (курсором мыши или пальцем) в любом направлении и начальное направление не требуется для выполнения жеста, то следует исходить из наличия движения перетаскивания.</p>",
  "_STEP_9_2_5_1_WHAT_CHECKED_12_": "<p>В зависимости от среды проверки это различие может проявляться по-разному. Например, на сенсорных экранах в мобильных системах часто требуется начальное горизонтальное направление для перемещения горизонтальных ползунков, поскольку вертикальное движение вместо этого приводит к прокрутке страницы. В такой среде управление таким ползунком должно считаться основанным на пути и, следовательно, должно подпадать под этот шаг проверки.</p>",
  "_STEP_9_2_5_1_WHY_CHECKED_1_": "<p>Для людей с ограниченными возможностями движения часто сложно или даже невозможно успешно выполнить сложные жесты указателя. Поэтому такие жесты, если они реализованы веб-контентом, не должны быть единственным способом выполнения функции. Примеры сложных жестов включают жесты свайпа с края для отображения меню, жесты свайпа для перемещения пользовательских каруселей или слайдеров, или многоточечные жесты, такие как жест распространения для увеличения масштаба карты.</p>",
  "_STEP_9_2_5_1_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость проверки</h3>",
  "_STEP_9_2_5_1_HOW_CHECKED_2_": "<p>Этап проверки применим, если веб-контент реализует обработчики событий, реагирующие на сложные жесты (например, жесты свайпа, многоточечные жесты). Исключения составляют контент, поведение которого определяется операционной системой или браузером, а не веб-авторами.</p>",
  "_STEP_9_2_5_1_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_2_5_1_HOW_CHECKED_4_": "<ol><li><p>Запустите страницу на смартфоне.</p></li><li><p>Визуальная проверка и тестирование, реализует ли веб-контент сложные жесты (например, на каруселях, слайдерах). Могут ли слайдеры или другие элементы контента быть перемещены с помощью пользовательских жестов свайпа? Активируются ли меню или другой веб-контент с помощью жестов свайпа с края? Реагируют ли определенные элементы (например, карты) на жест распространения двумя пальцами для изменения масштаба?</p></li><li><p>Проверьте, можно ли активировать функции, доступные через сложные жесты указателя, с помощью простых жестов указателя, таких как тап, двойной тап или удержание, например, активация альтернативных статических элементов (например, кнопок, перемещающих слайдеры, увеличивающих или уменьшающих значения или отображающих меню).</p></li></ol>",
  "_STEP_9_2_5_1_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Примечания</h3>",
  "_STEP_9_2_5_1_HOW_CHECKED_6_": "<ul><li><p>Веб-контент может предлагать альтернативы для активации с помощью простых жестов указателя только в определенных системных средах и пользовательских агентах, но не в других. Например, может потребоваться тестирование на мобильном устройстве, чтобы определить, доступны ли альтернативы активации, предложенные в настольном браузере, также в мобильных браузерах.</p></li><li><p>Исключения составляют функции, которые по своей природе и необходимости основаны на сложных путях или многоточечных жестах. Например, ввод собственной подписи будет по своей природе основан на пути.</p></li></ul>",
  "_STEP_9_2_5_1_HOW_CHECKED_7_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_2_5_1_HOW_CHECKED_8_": "<h4 id=\"_prüfschritt_erfüllt\">Шаг проверки выполнен</h4>",
  "_STEP_9_2_5_1_HOW_CHECKED_9_": "<ul><li><p>Для всех пользовательских сложных жестов указателя есть альтернативные способы ввода с помощью простых жестов указателя в средах, включенных в проверку согласно <em>Accessibility Baseline</em>.</p></li></ul>",
  "_STEP_9_2_5_1_SOURCES_1_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/pointer-gestures.html\"> Понимание критерия успеха 2.5.1: Жесты указателя</a> (в настоящее время доступно только на английском языке)</p></li><li><p><a href=\"https://github.com/w3c/wcag/issues/2684\">Github-Issue для обсуждения скроллируемых областей относительно требований 2.5.1 Ponter Gestures и 2.5.7 Dragging Movements</a>. Результатом долгих обсуждений было, что для слайдеров или скроллируемых областей требуются альтернативы только если поведение определено скриптами веб-авторов, а не управляется операционной системой или браузером. <a href=\"https://github.com/w3c/wcag/issues/2684\" class=\"bare\">https://github.com/w3c/wcag/issues/2684</a></p></li></ul>",
  "_STEP_9_2_5_1_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация проверочного шага по WCAG 2.1</h3>",
  "_STEP_9_2_5_1_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Руководство</h4>",
  "_STEP_9_2_5_1_CLASSIFICATION_3_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#input-modalities\"> Руководство 2.5 Методы ввода: Упростите пользователям управление функционалом через различные входные данные помимо клавиатуры</a></p></li></ul>",
  "_STEP_9_2_5_1_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Критерий успеха</h4>",
  "_STEP_9_2_5_1_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#pointer-gestures\"> 2.5.1 Жесты указателя</a> (Уровень A)</p></li></ul>",
  "_STEP_9_2_5_1_CLASSIFICATION_6_": "<h4 id=\"_sufficient_techniques\">Достаточные техники</h4>",
  "_STEP_9_2_5_1_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G215\"> G215: Предоставление элементов управления для достижения того же результата, что и жесты на основе пути или многоточечные жесты</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G216\"> G216: Предоставление одноточечной активации для управления слайдером</a></p></li></ul>",
  "_STEP_9_2_5_1_CLASSIFICATION_8_": "<h4 id=\"_failures\">Недостатки</h4>",
  "_STEP_9_2_5_1_CLASSIFICATION_9_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F105\"> F105: Невыполнение критерия успеха 2.5.1 из-за предоставления функциональности через жест, основанный на пути, без простой альтернативы указателя</a></p></li></ul>"
}