{
  "_STEP_7_1_2_NAME_": "Synchrone Untertitel",
  "_STEP_7_1_2_NAME_MENU_": "7.1.2 Synchrone Untertitel",
  "_STEP_7_1_2_WHAT_CHECKED_1_": "<p>Sind Videos mit synchroner Bild- und Tonspur vorhanden, ist gewährleistet, dass der Videoplayer Untertitel und Ton synchron darstellt.</p>",
  "_STEP_7_1_2_WHAT_CHECKED_2_": "<p>Das bedeutet für Untertitel aufgezeichneter Videos: Die Anzeige des Untertitels weicht nicht mehr als 100ms vom Zeitstempel der Untertitel-Datei ab. Dies bezieht sich theoretisch auch auf Live-Untertitel. Hier liegt jedoch naturgemäß einer Verzögerung durch die Konvertierung von gesprochener Sprache in Text vor, besonders, wenn die Konvertierung nicht automatisch, sondern durch Menschen erfolgt.</p>",
  "_STEP_7_1_2_WHY_CHECKED_1_": "<p>Die <a href=\"https://www.ndr.de/fernsehen/barrierefreie_angebote/untertitel/Untertitel-Standards,untertitelstandards102.html\">Untertitel-Standards</a> fordern für eine Untertitelung \"Synchronität\". Das bedeutet, dass die Einblendung zeitgleich mit dem Bild/Ton und möglichst lippensynchron erfolgen soll. Hintergrund ist, dass Menschen mit Höreinschränkungen neben der Untertitelung auch auf das Mundbild achten. Außerdem leidet die Gesamtverständlichkeit, wenn Bild/Ton und Untertitel nicht synchron sind.</p>",
  "_STEP_7_1_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_7_1_2_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn auf der Webseite aufgezeichnete Videos mit synchroner Bild- und Tonspur sowie zuschaltbare Untertitel (closed captions) vorhanden sind.</p>",
  "_STEP_7_1_2_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_7_1_2_HOW_CHECKED_4_": "<h4 id=\"_2_1_prüfung_von_untertiteln_eines_aufgezeichneten_videos\">2.1 Prüfung von Untertiteln eines aufgezeichneten Videos:</h4>",
  "_STEP_7_1_2_HOW_CHECKED_5_": "<ol><li><p>Das Video in dem auf der Webseite eingebundenen Player abspielen.</p></li><li><p>Prüfen, ob die Untertitel synchron zum Ton angezeigt werden.</p></li><li><p>Werden Untertitel nicht synchron angezeigt, kann das an den technischen Möglichkeiten des Players oder an fehlerhaften Zeitstempel in der Untertitel-Datei liegen.</p></li><li><p>Um festzustellen, ob die Ursache beim Player liegt oder an der Untertitel-Datei, können die Zeitstempel der Untertitel-Datei stichprobenartig geprüft werden.</p><ul><li><p>Dazu im Inspektor des Browsers das <code>track</code>-Element suchen. Die Untertitel-Datei ist als .vtt oder .srt-Datei über das <code>track</code>-Element eingebunden.</p></li><li><p>Mit der Maus über den Dateipfad fahren. Mit der rechten Maustaste das Kontextmenü öffnen und mit Hilfe der Funktion \"Link in neuem Tab anzeigen\" die Untertitel anzeigen.</p></li><li><p>Alternativ den Pfad kopieren. Den Pfad im Browser hinter dem / der Top-Level-Domain eingeben.</p></li></ul></li><li><p>Prüfen, ob die Zeitstempel korrekt sind.</p></li><li><p>Wenn die Zeitcodierung in der Track-Datei Fehler aufweist, ist davon auszugehen, dass der Fehler nicht beim Player liegt. Dieser Prüfschritt ist erfüllt.</p></li></ol>",
  "_STEP_7_1_2_HOW_CHECKED_6_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_7_1_2_HOW_CHECKED_7_": "<p>Wenn Fehler in der Zeitcodierung der Track-Datei gefunden werden, ist davon auszugehen, dass der Fehler nicht beim Player liegt. Es ist es jedoch nicht ganz auszuschließen, dass eine nicht vorhandene Synchronität an der Untertitel-Datei <em>und</em> am Player liegt.</p>",
  "_STEP_7_1_2_HOW_CHECKED_8_": "<p>Es ist sinnvoll, stichprobenartig zu prüfen, ob es im Webangebot Videos gibt, bei denen die Untertitel synchron zum Ton dargestellt werden. Wenn dies der Fall ist, ist das ein Hinweis, dass der Player Untertitel prinzipiell korrekt darstellt. Der Prüfschritt ist damit erfüllt, Probleme mit der Synchronität sind dann höchstwahrscheinlich bei den Inhalten zu suchen und nicht im eingebundenen Player.</p>",
  "_STEP_7_1_2_HOW_CHECKED_9_": "<p>Hinweise zu diesem Prüfschritt können Sie auf GitHub <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">in einem Issue hinterlassen</a>.</p>",
  "_STEP_7_1_2_HOW_CHECKED_10_": "<h3 id=\"_4_bewertungen\">4. Bewertungen</h3>",
  "_STEP_7_1_2_HOW_CHECKED_11_": "<h4 id=\"_nicht_erfüllt\">Nicht erfüllt:</h4>",
  "_STEP_7_1_2_HOW_CHECKED_12_": "<ul><li><p>Bild/Ton und Untertitel sind nicht synchron.</p></li></ul>",
  "_STEP_7_1_2_SOURCES_1_": "<ul><li><p>Zurzeit keine Quellen.</p></li></ul>",
  "_STEP_7_1_2_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Abgrenzung zu anderen Prüfschritten</h3>",
  "_STEP_7_1_2_CLASSIFICATION_2_": "<p>Inhalte, Qualität und Angemessenheit der Untertitel werden in Prüfschritt 9.1.2.2 \"Aufgezeichnete Videos mit Untertiteln\" geprüft. In diesem Prüfschritt wird geprüft, ob der eingebundene Player grundsätzlich in der Lage ist, Videos mit Untertiteln synchron darzustellen.</p>",
  "_STEP_7_1_2_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Einordnung des Prüfschritts nach EN 301 549 V3.2.1</h3>",
  "_STEP_7_1_2_CLASSIFICATION_4_": "<h4 id=\"_7_1_2_captioning_synchronization\">7.1.2 Captioning synchronization</h4>",
  "_STEP_7_1_2_CLASSIFICATION_5_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where ICT displays captions, the mechanism to display captions shall preserve synchronization between the audio and the corresponding captions as follows:</p><ul><li><p>Captions in recorded material: within 100 ms of the time stamp of the caption</p></li><li><p>Live captions: within 100 ms of the availability of the caption to the player.</p></li></ul></div></div>"
}