{
  "_STEP_7_1_2_NAME_": "Синхронизация субтитров",
  "_STEP_7_1_2_NAME_MENU_": "7.1.2 Синхронизация субтитров",
  "_STEP_7_1_2_WHAT_CHECKED_1_": "<p>Если на сайте присутствуют видео с синхронной видео- и звуковой дорожкой, то гарантируется, что видеоплеер синхронно отображает субтитры и звук.</p>",
  "_STEP_7_1_2_WHAT_CHECKED_2_": "<p>Это означает для субтитров записанных видео: отображение субтитров не отклоняется более чем на 100 мс от временной метки файла субтитров. Это теоретически также относится к субтитрам в реальном времени. Здесь, однако, естественно присутствует задержка из-за конвертации устной речи в текст, особенно если конвертация производится не автоматически, а людьми.</p>",
  "_STEP_7_1_2_WHY_CHECKED_1_": "<p><a href=\"https://www.ndr.de/fernsehen/barrierefreie_angebote/untertitel/Untertitel-Standards,untertitelstandards102.html\">Стандарты субтитров</a> требуют для субтитров \"синхронности\". Это означает, что субтитры должны появляться одновременно с изображением/звуком и быть как можно более синхронными по отношению к движениям губ. Фоном этого требования является тот факт, что люди с нарушениями слуха, помимо субтитров, также обращают внимание на движения губ. Кроме того, общая понятность страдает, если изображение/звук и субтитры не синхронизированы.</p>",
  "_STEP_7_1_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_7_1_2_HOW_CHECKED_2_": "<p>Этап проверки применим, если на веб-сайте представлены записанные видео с синхронной видео- и звуковой дорожкой, а также доступны субтитры (closed captions).</p>",
  "_STEP_7_1_2_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_7_1_2_HOW_CHECKED_4_": "<h4 id=\"_2_1_prüfung_von_untertiteln_eines_aufgezeichneten_videos\">2.1 Проверка субтитров записанного видео:</h4>",
  "_STEP_7_1_2_HOW_CHECKED_5_": "<ol><li><p>Воспроизвести видео в плеере на сайте.</p></li><li><p>Проверить, отображаются ли субтитры синхронно со звуком.</p></li><li><p>Если субтитры отображаются несинхронно, это может быть связано с техническими возможностями плеера или с ошибками временных меток в файле субтитров.</p></li><li><p>Для определения, связана ли причина с плеером или с файлом субтитров, можно выборочно проверить временные метки файла субтитров.</p><ul><li><p>Для этого в инспекторе браузера найти элемент <code>track</code>. Файл субтитров в формате .vtt или .srt включен через элемент <code>track</code>.</p></li><li><p>Навести курсор мыши на путь к файлу. Открыть контекстное меню правой кнопкой мыши и с помощью функции \"Показать ссылку в новой вкладке\" отобразить субтитры.</p></li><li><p>Или скопировать путь. Ввести путь в браузер после / доменного имени верхнего уровня.</p></li></ul></li><li><p>Проверить, корректны ли временные метки.</p></li><li><p>Если в файле трека обнаружены ошибки временного кодирования, можно предположить, что ошибка не в плеере. Этот этап проверки выполнен.</p></li></ol>",
  "_STEP_7_1_2_HOW_CHECKED_6_": "<h3 id=\"_3_hinweise\">3. Примечания</h3>",
  "_STEP_7_1_2_HOW_CHECKED_7_": "<p>Если во время кодирования трека найдены ошибки, можно предположить, что ошибка не в плеере. Однако нельзя полностью исключить, что недостаточная синхронизация связана с файлом субтитров <em>и</em> плеером.</p>",
  "_STEP_7_1_2_HOW_CHECKED_8_": "<p>Целесообразно случайным образом проверять, есть ли на веб-сайте видео, в которых субтитры синхронизированы со звуком. Если это так, это указание на то, что плеер корректно отображает субтитры. Этап проверки выполнен, проблемы с синхронизацией, вероятно, связаны с содержимым, а не с интегрированным плеером.</p>",
  "_STEP_7_1_2_HOW_CHECKED_9_": "<p>Примечания к этому этапу проверки вы можете оставить на GitHub <a href=\"https://github.com/BIK-BITV/BIK-Web-Test/issues\">в виде вопроса</a>.</p>",
  "_STEP_7_1_2_HOW_CHECKED_10_": "<h3 id=\"_4_bewertungen\">4. Оценки</h3>",
  "_STEP_7_1_2_HOW_CHECKED_11_": "<h4 id=\"_nicht_erfüllt\">Не выполнено:</h4>",
  "_STEP_7_1_2_HOW_CHECKED_12_": "<ul><li><p>Изображение/звук и субтитры не синхронизированы.</p></li></ul>",
  "_STEP_7_1_2_SOURCES_1_": "<ul><li><p>В настоящее время нет источников.</p></li></ul>",
  "_STEP_7_1_2_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Отличие от других этапов проверки</h3>",
  "_STEP_7_1_2_CLASSIFICATION_2_": "<p>Контент, качество и адекватность субтитров проверяются в шаге проверки 9.1.2.2 «Записанные видео с субтитрами». В этом этапе проверяется, способен ли интегрированный плеер в принципе корректно отображать видео с субтитрами.</p>",
  "_STEP_7_1_2_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_7_1_2_CLASSIFICATION_4_": "<h4 id=\"_7_1_2_captioning_synchronization\">7.1.2 Синхронизация субтитров</h4>",
  "_STEP_7_1_2_CLASSIFICATION_5_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where ICT displays captions, the mechanism to display captions shall preserve synchronization between the audio and the corresponding captions as follows:</p><ul><li><p>Captions in recorded material: within 100 ms of the time stamp of the caption</p></li><li><p>Live captions: within 100 ms of the availability of the caption to the player.</p></li></ul></div></div>"
}