{
  "_STEP_9_1_1_1A_NAME_": "Альтернативный текст для элементов управления",
  "_STEP_9_1_1_1A_WHAT_CHECKED_1_": "<p>Графические элементы управления (все связанные / интерактивные изображения и рисунки) должны иметь альтернативный текст (не связанные или не интерактивные графики и изображения проверяются в шаге 9.1.1.1b «Альтернативные тексты для графики и объектов»).</p>",
  "_STEP_9_1_1_1A_WHAT_CHECKED_2_": "<p>Альтернативный текст для элементов управления (например, иконок или логотипов) или изображений тизера должен указывать на <strong>цель</strong> ссылки. Альтернативный текст для графических кнопок должен указывать на <strong>действие</strong>, которое выполняет кнопка. При использовании изображений-карт должны иметь осмысленные альтернативные тексты для их областей (<code>area</code>-элементов).</p>",
  "_STEP_9_1_1_1A_WHAT_CHECKED_3_": "<p>Текстовые ссылки, заменяемые фоновыми изображениями при помощи CSS, а также текстовые альтернативы для иконок шрифтов и SVG-изображений также являются темой этого проверочного шага.</p>",
  "_STEP_9_1_1_1A_WHY_CHECKED_1_": "<p>Для незрячих пользователей или для пользователей, отключивших загрузку изображений для более быстрого доступа, изображения недоступны. Текстовая альтернатива заменяет изображение в таких случаях.</p>",
  "_STEP_9_1_1_1A_WHY_CHECKED_2_": "<p>Иконические шрифты - это шрифты, содержащие символы вместо букв. Они подключаются через CSS и либо не выводятся вспомогательными технологиями, либо отображается эквивалент Юникода, который не передает значения в контексте.</p>",
  "_STEP_9_1_1_1A_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_9_1_1_1A_HOW_CHECKED_2_": "<p>Этап применим, если графика, иконические шрифты или SVG используются в качестве элементов управления (меню, логотипы, изображения тизера или кнопки).</p>",
  "_STEP_9_1_1_1A_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_1_1_1A_HOW_CHECKED_4_": "<h4 id=\"_2_1_anzeige_der_alternativtexte_von_grafiken\">2.1 Отображение альтернативного текста для графики</h4>",
  "_STEP_9_1_1_1A_HOW_CHECKED_5_": "<ol><li><p>Откройте страницу в <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\"> Firefox</a>.</p></li><li><p>Определите элементы управления (например, горизонтальные или вертикальные навигационные панели, логотип, баннеры, изображения тизера, графические кнопки).</p></li><li><p>В панели инструментов веб-разработчика перейдите в меню <em>Images &gt; Display Alt Attributes</em> и проверьте, есть ли у элементов управления эквивалентные альтернативные тексты (см. <a href=\"#_2_6_gleichwertige_äquivalente_alternativtexte\">2.6 Эквивалентные альтернативные тексты</a>). Также можно использовать закладку <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#imagesbm\"> Images bookmarklet</a>.</p></li><li><p>Определите, содержит ли страница изображения-карты. Для этого, при необходимости, можно найти в исходном коде элементы <code>map</code>. Если изображение-карта присутствует, перейдите к разделу <a href=\"#_2_2_anzeige_von_image_maps\">2.2 Отображение изображений-карт</a>.</p></li></ol>",
  "_STEP_9_1_1_1A_HOW_CHECKED_6_": "<h4 id=\"_2_2_anzeige_von_image_maps\">2.2 Отображение изображений-карт</h4>",
  "_STEP_9_1_1_1A_HOW_CHECKED_7_": "<p>Если используются изображения-карты:</p>",
  "_STEP_9_1_1_1A_HOW_CHECKED_8_": "<p>Откройте инструменты веб-разработчика и проверьте в исходном коде, есть ли эквивалентный альтернативный текст для каждой ссылки (<code>area</code>-элемент карты изображения, активная область) <strong>и</strong> для всего изображения-карты (см. <a href=\"#_2_6_gleichwertige_äquivalente_alternativtexte\">2.6 Эквивалентные альтернативные тексты</a>).</p>",
  "_STEP_9_1_1_1A_HOW_CHECKED_9_": "<p>Альтернативный текст для всей изображения-карты обычно должен описывать изображение-карту, а альтернативные тексты для активных областей (<code>area</code>-элементы) должны указывать на цели ссылок.</p>",
  "_STEP_9_1_1_1A_HOW_CHECKED_10_": "<h4 id=\"_2_3_textalternativen_für_hintergrundgrafiken\">2.3 Текстовые альтернативы для фоновых изображений</h4>",
  "_STEP_9_1_1_1A_HOW_CHECKED_11_": "<p>Фоновые изображения не имеют атрибута <code>alt</code>, поэтому текстовая альтернатива не может быть предоставлена.</p>",
  "_STEP_9_1_1_1A_HOW_CHECKED_12_": "<p>Однако, если фоновое изображение фактически заменяет существующую текстовую ссылку в HTML-документе (процедура замены изображений с использованием CSS), тогда эта текстовая ссылка рассматривается как альтернатива для фонового изображения. Однако это предполагает использование соответствующего метода замены изображений (не <code>display:none</code>).</p>",
  "_STEP_9_1_1_1A_HOW_CHECKED_13_": "<h5 id=\"_grundeinstellung_in_firefox\">Настройки по умолчанию в Firefox</h5>",
  "_STEP_9_1_1_1A_HOW_CHECKED_14_": "<ol><li><p>Откройте страницу в <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\"> Firefox</a> и в меню <em>Сервис</em> выберите пункт <em>Настройки…</em>. Выберите вкладку <em>Содержание</em> и в разделе <em>Шрифты и цвета</em> выберите опцию <em>Цвета…​</em>.</p></li><li><p>В диалоговом окне <em>Цвета</em> в разделе <em>Текст и фон</em> выберите цвет фона, который обычно редко используется для оформления страниц (хорошо подходят, например, светлые розовые или зеленые оттенки).</p></li><li><p>В списке <em>Использовать выбранные цвета вместо цветов страницы</em> выберите опцию <em>Всегда</em>.</p></li><li><p>Закройте диалоговые окна, нажав «ОК».</p></li></ol>",
  "_STEP_9_1_1_1A_HOW_CHECKED_15_": "<h5 id=\"_prüfung\">Проверка</h5>",
  "_STEP_9_1_1_1A_HOW_CHECKED_16_": "<ol><li><p>Откройте страницу в <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\"> Firefox</a>.</p></li><li><p>Проверьте, исчезают ли графические элементы управления. Это происходит, если они включены как фоновые изображения.</p></li><li><p>Если неиспользуемые графические элементы управления включены как фоновые изображения: Проверьте, заменяет ли фоновое изображение фактически существующую текстовую ссылку в HTML-документе или предоставлена ли понятная альтернатива иным способом (например, через <code>aria-label</code> или <code>title</code> на ссылке).</p></li><li><p>Если пустой элемент <code>a</code> без текста заменен фоновым изображением, это следует рассматривать как отсутствие или пустой атрибут <code>alt</code>.</p></li><li><p>Если текстовые ссылки заменены фоновыми изображениями: Проверьте, какой метод замены изображений был использован. Если используется <code>display:none</code>, это следует рассматривать как отсутствие или пустой атрибут <code>alt</code>.</p></li><li><p>Если использован соответствующий метод замены изображений: Проверьте, представляет ли текстовая ссылка эквивалентную текстовую альтернативу для фонового изображения (см. <a href=\"#_2_6_gleichwertige_äquivalente_alternativtexte\">2.6 Эквивалентные (аналогичные) текстовые альтернативы</a>).</p></li></ol>",
  "_STEP_9_1_1_1A_HOW_CHECKED_17_": "<h4 id=\"_2_4_textalternativen_für_icon_fonts\">2.4 Текстовые альтернативы для иконических шрифтов</h4>",
  "_STEP_9_1_1_1A_HOW_CHECKED_18_": "<p>При использовании иконических шрифтов невозможно предоставить текстовую альтернативу с помощью атрибута <code>alt</code>.</p>",
  "_STEP_9_1_1_1A_HOW_CHECKED_19_": "<p>Однако если элемент управления состоит из такой иконки и HTML-текста, который отображает цель элемента управления, тогда этот текст рассматривается как альтернатива для иконки. Разумно скрыть саму иконку с помощью подходящей техники для скринридера (например, <code>aria-hidden=\"true\"</code>). Если это информативная иконка без визуально видимого текста (самостоятельная иконка), должна быть предоставлена текстовая альтернатива. Это может быть, например, текст, скрытый с помощью подходящего метода (не <code>display:none</code>) или предоставленный через <code>aria-label</code>.</p>",
  "_STEP_9_1_1_1A_HOW_CHECKED_20_": "<h5 id=\"_prüfung_2\">Проверка</h5>",
  "_STEP_9_1_1_1A_HOW_CHECKED_21_": "<ol><li><p>Откройте страницу в <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\"> Firefox</a>.</p></li><li><p>Проверьте наличие элементов управления.</p></li><li><p>С помощью Firebug или инспектора браузера проверьте, используется ли для псевдоэлементов <code>:before</code> или <code>:after</code> свойство CSS <code>content</code> для вставки содержимого (шрифтовые иконки).</p></li><li><p>Если не используются избыточные иконки: Проверьте наличие HTML-текстовой альтернативы. Пустой элемент <code>a</code> без текста следует рассматривать как отсутствие или пустой атрибут <code>alt</code>.</p></li><li><p>Если есть HTML-текстовые альтернативы, невидимые на экране: Проверьте, какой метод использовался для их скрытия. Если использовано <code>display:none</code>, это следует рассматривать как отсутствие или пустой атрибут <code>alt</code>.</p></li><li><p>Если использована подходящая CSS-техника: Проверьте, представляет ли текстовая ссылка эквивалентную текстовую альтернативу для иконки (см. <a href=\"#_2_6_gleichwertige_äquivalente_alternativtexte\">2.6 Эквивалентные (аналогичные) текстовые альтернативы</a>).</p></li><li><p>Если нет HTML-текстовой альтернативы, проверьте, предоставлена ли текстовая альтернатива через атрибут <code>title</code> или <code>aria-label</code>.</p></li><li><p>Если для иконок выводится текст (например, <code>content: \"k\"</code>), проверьте, скрыта ли иконка с помощью подходящей техники для скринридера (например, <code>aria-hidden=\"true\"</code>).</p></li></ol>",
  "_STEP_9_1_1_1A_HOW_CHECKED_22_": "<h4 id=\"_2_5_textalternativen_für_inline_svgs\">2.5 Текстовые альтернативы для встроенных SVG</h4>",
  "_STEP_9_1_1_1A_HOW_CHECKED_23_": "<h5 id=\"_prüfung_3\">Проверка</h5>",
  "_STEP_9_1_1_1A_HOW_CHECKED_24_": "<ol><li><p>Откройте страницу в <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\"> Firefox</a>.</p></li><li><p>Проверьте наличие элементов управления.</p></li><li><p>С помощью инструментов веб-разработчика браузера проверьте, является ли SVG встроенным непосредственно в HTML (встроенный SVG).</p></li><li><p>Проверьте наличие текстовой альтернативы.</p></li><li><p>Проверьте, есть ли элемент <code>title</code> (для более длинных описаний элемент <code>desc</code>) и соответствует ли текстовая альтернатива изображению должным образом (см. <a href=\"#_2_6_gleichwertige_äquivalente_alternativtexte\">2.6 Эквивалентные (аналогичные) текстовые альтернативы</a>). Элементы <code>title</code> или <code>desc</code> должны быть первыми дочерними элементами родительского элемента <code>svg</code>.</p></li><li><p>Поскольку SVG еще не полностью поддерживается всеми комбинациями браузеров и скринридеров, проверьте, обеспечена ли доступность с использованием ARIA-атрибутов:</p><ul><li><p>SVG-изображения должны иметь атрибут <code>role=\"img\"</code>, иначе их элемент <code>title</code> может не отображаться.</p></li><li><p>Если элемент <code>title</code> SVG используется в качестве доступного имени, элемент <code>svg</code> должен ссылаться на элемент <code>title</code> с помощью атрибута <code>aria-labelledby</code>.</p></li><li><p>Если ссылка содержит как изображение SVG, так и содержательный текст ссылки, изображение SVG должно быть скрыто с помощью <code>aria-hidden=\"true\"</code>. Использование атрибута <code>role</code> не требуется.</p></li><li><p>Если элементы <code>title</code> или <code>desc</code> не используются, проверьте, предоставлена ли текстовая альтернатива через атрибут <code>aria-label</code> на окружающей ссылке. Для роли SVG также можно использовать <code>role=\"graphics-document\"</code>. Это применяется для более сложных SVG-изображений, таких как объясняющие изображения, диаграммы или изображения с встроенными ссылками (степень поддержки скринридерами в настоящее время неизвестна).</p></li></ul></li></ol>",
  "_STEP_9_1_1_1A_HOW_CHECKED_25_": "<h4 id=\"_2_6_gleichwertige_äquivalente_alternativtexte\">2.6 Эквивалентные (аналогичные) текстовые альтернативы</h4>",
  "_STEP_9_1_1_1A_HOW_CHECKED_26_": "<p>Решающим является то, чтобы страница была доступной, если изображения или объекты заменены соответствующими текстовыми альтернативами.</p>",
  "_STEP_9_1_1_1A_HOW_CHECKED_27_": "<p>Обычно это означает:</p>",
  "_STEP_9_1_1_1A_HOW_CHECKED_28_": "<ul><li><p>Для <strong>текстовых изображений</strong> текстовая альтернатива должна повторять текст изображения.</p></li><li><p>Для <strong>символов</strong> текстовая альтернатива не должна описывать символ, а должна его заменять. Например, для значка \"Контакт\", используемого как символ для страницы контактов, текстовая альтернатива должна быть \"Контакт\".</p></li><li><p>Для <strong>объектов</strong>, которые нельзя отобразить, текстовая альтернатива (будь то текстовое описание объекта или сгенерированное сценарием) должна предоставлять краткое описание или идентификацию. Кроме того, разумно, чтобы сценарий анализировал, почему объект не может быть отображен из-за отключенного JavaScript и/или плагина, и генерировал соответствующее сообщение. В этом случае также достаточно, если объект идентифицируется, например, заголовком в непосредственном контексте.</p></li></ul>",
  "_STEP_9_1_1_1A_HOW_CHECKED_29_": "<p>Для <strong>связанных изображений</strong> существуют следующие варианты:</p>",
  "_STEP_9_1_1_1A_HOW_CHECKED_30_": "<ul><li><p>Изображаемый объект описывается в текстовой альтернативе (если изображаемый объект важен и из него следует цель ссылки, например, логотип).</p></li><li><p>Цель ссылки передается через текстовую альтернативу (только если изображаемый объект не важен, например, иллюстрация).</p></li><li><p>Содержательное содержание изображаемого объекта и цель ссылки или действие передается через текстовую альтернативу (если оба важны).</p></li></ul>",
  "_STEP_9_1_1_1A_HOW_CHECKED_31_": "<p>В общем:</p>",
  "_STEP_9_1_1_1A_HOW_CHECKED_32_": "<ul><li><p>Текстовые альтернативы должны быть краткими.</p></li><li><p>Подробные описания изображений должны предоставляться не в текстовых альтернативах, а в контексте изображения.</p></li></ul>",
  "_STEP_9_1_1_1A_HOW_CHECKED_33_": "<h3 id=\"_3_hinweise\">3. Подсказки</h3>",
  "_STEP_9_1_1_1A_HOW_CHECKED_34_": "<h4 id=\"_3_1_alternativtexte_für_redundant_verlinkte_abbildungen\">3.1 Текстовые альтернативы для избыточно связанных изображений</h4>",
  "_STEP_9_1_1_1A_HOW_CHECKED_35_": "<p>Если изображение и рядом стоящая текстовая ссылка ведут на одну и ту же цель, необходимо проверить, находятся ли изображение и текст в одной и той же ссылке.</p>",
  "_STEP_9_1_1_1A_HOW_CHECKED_36_": "<p>Если изображение и текст находятся внутри одной и той же ссылки, текстовая альтернатива изображения не должна повторять текст ссылки. В зависимости от содержания изображения, атрибут <code>alt</code> может оставаться пустым или описывать изображенное содержимое, в то время как текст ссылки описывает цель или назначение ссылки.</p>",
  "_STEP_9_1_1_1A_HOW_CHECKED_37_": "<p>Если изображение и текст являются двумя независимыми ссылками на одну и ту же цель, тогда атрибут <code>alt</code> не может оставаться пустым. Поскольку стандартные скринридеры не полагаются на правильное использование пустых атрибутов <code>alt</code> для элементов управления, они обрабатывают пустые атрибуты <code>alt</code> так же, как отсутствующие, и читают имя файла изображения / URL целевого файла.</p>",
  "_STEP_9_1_1_1A_HOW_CHECKED_38_": "<h4 id=\"_3_2_unterstützung_von_svgs_durch_assistive_technologien\">3.2 Поддержка SVG средствами вспомогательных технологий</h4>",
  "_STEP_9_1_1_1A_HOW_CHECKED_39_": "<p>Поскольку SVG пока еще не полностью поддерживается всеми сочетаниями скринридеров и браузеров, в настоящее время роль должна быть представлена с использованием WAI-ARIA (см. 9.4.1.2 \"Доступное имя, роль, значение\"). Роль может отсутствовать, если текст в одной и той же ссылке описывает назначение ссылки: в этом случае SVG-изображение должно быть помечено как <code>aria-hidden=\"true\"</code>.</p>",
  "_STEP_9_1_1_1A_HOW_CHECKED_40_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_1_1_1A_HOW_CHECKED_41_": "<h4 id=\"_teilweise_erfüllt\">Частично выполнено</h4>",
  "_STEP_9_1_1_1A_HOW_CHECKED_42_": "<ul><li><p>Отсутствует текстовая альтернатива для ссылки в начало страницы или для другого элемента управления страницей, менее важного для использования страницы.</p></li><li><p>Текстовые альтернативы неоднозначны, неясны или чрезмерно длинны.</p></li></ul>",
  "_STEP_9_1_1_1A_HOW_CHECKED_43_": "<h4 id=\"_nicht_erfüllt\">Не выполнено</h4>",
  "_STEP_9_1_1_1A_HOW_CHECKED_44_": "<ul><li><p>Отсутствует текстовая альтернатива для важного элемента управления или она не пригодна к использованию.</p></li></ul>",
  "_STEP_9_1_1_1A_SOURCES_1_": "<h3 id=\"_anleitungen_zum_erstellen_guter_alternativtexte\">Инструкции по созданию хороших альтернативных текстов</h3>",
  "_STEP_9_1_1_1A_SOURCES_2_": "<ul><li><p>W3C Руководства по доступности веба: <a href=\"https://www.w3.org/WAI/tutorials/images/\">Концепции изображений</a></p></li><li><p>WebAIM: <a href=\"https://webaim.org/techniques/alttext/\">Альтернативный текст</a></p></li><li><p>Спецификация HTML 5.1: <a href=\"https://www.w3.org/TR/html51/semantics-embedded-content.html#alt-text\">Требования к предоставлению текста в качестве альтернативы изображениям</a></p></li></ul>",
  "_STEP_9_1_1_1A_SOURCES_3_": "<h3 id=\"_w3c_scalable_vector_graphics_svg_1_1\">W3C - Масштабируемая векторная графика (SVG) 1.1</h3>",
  "_STEP_9_1_1_1A_SOURCES_4_": "<ul><li><p><a href=\"https://www.w3.org/TR/SVG11/struct.html#DescriptionAndTitleElements\"> Элементы 'desc' и 'title'</a></p></li><li><p>Относительно ролей, таких как <code>role=\"graphics-document\"</code> для более сложных графических элементов SVG: <a href=\"https://www.w3.org/TR/graphics-aria-1.0/\">Модуль графики WAI-ARIA</a> (рекомендация W3C от 02 октября 2018 года)</p></li></ul>",
  "_STEP_9_1_1_1A_SOURCES_5_": "<h3 id=\"_svgs_zugänglich_einbinden\">Доступ к SVG</h3>",
  "_STEP_9_1_1_1A_SOURCES_6_": "<ul><li><p><a href=\"https://www.scottohara.me/blog/2019/05/22/contextual-images-svgs-and-a11y.html\"> Контекстная разметка доступных изображений и SVG</a> (Скотт О’Хара, май 2019 года)</p></li><li><p><a href=\"https://www.deque.com/blog/creating-accessible-svgs/\">Создание доступных SVG</a> (блог Deque, январь 2019 года)</p></li><li><p><a href=\"https://simplyaccessible.com/article/7-solutions-svgs/\"> 7 решений для создания более доступных SVG</a> (SimplyAccessible, март 2017 года)</p></li><li><p><a href=\"https://css-tricks.com/accessible-svgs/\"> Доступные SVG</a> (CSS-Tricks, обновлено в августе 2016 года)</p></li></ul>",
  "_STEP_9_1_1_1A_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Разграничение от других этапов тестирования</h3>",
  "_STEP_9_1_1_1A_CLASSIFICATION_2_": "<p>Связанные изображения всегда должны оцениваться на этом этапе тестирования. Это относится даже к случаям, когда изображения должны передавать дополнительную информацию наряду с информацией о цели ссылки, например, логотипы, ведущие на домашнюю страницу.</p>",
  "_STEP_9_1_1_1A_CLASSIFICATION_3_": "<p>Исключение: если изображение и смежный текст образуют единое целое. Тогда альтернативный текст относится только к изображению, и критерии 9.1.1.1b \"Альтернативные тексты для изображений и объектов\" или 9.1.1.1c \"Пустые атрибуты alt для изображений макета\" применяются.</p>",
  "_STEP_9_1_1_1A_CLASSIFICATION_4_": "<ul><li><p>Альтернативные тексты для графических заголовков: см. этап тестирования 9.1.1.1b \"Альтернативные тексты для изображений и объектов\".</p></li><li><p>CAPTCHA проверяются на этапе тестирования 9.1.1.1d \"Альтернативы для CAPTCHA\".</p></li><li><p>Текстовый эквивалент (<code>title</code> атрибут) для фреймов: см. этап тестирования 9.2.4.1 \"Пропустить области\".</p></li><li><p>Тексты ссылок также рассматриваются на этапе тестирования 9.2.4.4 \"Описательные тексты ссылок\". Там речь идет о общей значимости, в то время как на этапе тестирования 9.1.1.1a речь идет только о эквивалентности альтернативного текста и графической ссылки.</p></li><li><p>Вывод соответствующей роли SVG проверяется на этапе тестирования 9.4.1.2 \"Доступные имя, роль, значение\" (см. выше<a href=\"#3.2\">3.2 Поддержка SVG с помощью ассистивных технологий</a>).</p></li></ul>",
  "_STEP_9_1_1_1A_CLASSIFICATION_5_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация шага тестирования согласно WCAG 2.1</h3>",
  "_STEP_9_1_1_1A_CLASSIFICATION_6_": "<h4 id=\"_guideline\">Рекомендации</h4>",
  "_STEP_9_1_1_1A_CLASSIFICATION_7_": "<ul><li><p><a href=\"http://www.w3.org/TR/WCAG21/#text-alternatives\"> Рекомендация 1.1 Текстовые альтернативы: Предоставляйте текстовые альтернативы для любого не-текстового контента, чтобы его можно было преобразовать в другие формы, необходимые людям, такие как крупный шрифт, шрифт Брайля, речь, символы или более простой язык.</a></p></li></ul>",
  "_STEP_9_1_1_1A_CLASSIFICATION_8_": "<h4 id=\"_success_criterion\">Критерий успеха</h4>",
  "_STEP_9_1_1_1A_CLASSIFICATION_9_": "<ul><li><p><a href=\"http://www.w3.org/TR/WCAG21/#x1-1-1-non-text-content\"> 1.1.1 Нетекстовый контент</a> (Уровень A)</p></li></ul>",
  "_STEP_9_1_1_1A_CLASSIFICATION_10_": "<h4 id=\"_techniques\">Техники</h4>",
  "_STEP_9_1_1_1A_CLASSIFICATION_11_": "<h5 id=\"_general_techniques\">Общие методики</h5>",
  "_STEP_9_1_1_1A_CLASSIFICATION_12_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G94\"> G94: Предоставление короткого текстового альтернативного варианта для не-текстового контента, который выполняет ту же цель и представляет ту же информацию, что и не-текстовый контент</a></p></li></ul>",
  "_STEP_9_1_1_1A_CLASSIFICATION_13_": "<h5 id=\"_html_techniques\">HTML методики</h5>",
  "_STEP_9_1_1_1A_CLASSIFICATION_14_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H2\"> H2: Комбинирование смежных изображений и текстовых ссылок на один и тот же ресурс</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H24\"> H24: Предоставление текстовых альтернатив для элементов <code>area</code> изображений карт</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H30\"> H30: Предоставление текста ссылки, который описывает цель ссылки для элементов якоря</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H36\"> H36: Использование атрибутов <code>alt</code> для изображений, используемых в качестве кнопок отправки</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H37\"> H37: Использование атрибутов <code>alt</code> для элементов <code>img</code></a></p></li></ul>",
  "_STEP_9_1_1_1A_CLASSIFICATION_15_": "<h5 id=\"_aria_techniques\">ARIA методики</h5>",
  "_STEP_9_1_1_1A_CLASSIFICATION_16_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA6\"> ARIA6 Использование <code>aria-label</code> для предоставления меток для объектов</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA10\"> ARIA10: Использование <code>aria-labelledby</code> для предоставления текстовой альтернативы для не-текстового контента</a></p></li></ul>",
  "_STEP_9_1_1_1A_CLASSIFICATION_17_": "<h5 id=\"_failures\">Неудачи</h5>",
  "_STEP_9_1_1_1A_CLASSIFICATION_18_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F3\"> F3: Неудача критерия успеха 1.1.1 из-за использования CSS для включения изображений, передающих важную информацию</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F20\"> F20: Неудача критериев успеха 1.1.1 и 4.1.2 из-за непредоставления текстовых альтернатив при изменении не-текстового контента</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F30\"> F30: Неудача критериев успеха 1.1.1 и 1.2.1 из-за использования текстовых альтернатив, которые не являются альтернативами</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F65\"> F65: Неудача критерия успеха 1.1.1 из-за отсутствия атрибута <code>alt</code> для элементов <code>img</code>, <code>area</code> и элементов <code>input</code> типа 'image'</a></p></li></ul>",
  "_STEP_9_1_1_1A_QUESTIONS_1_": "<h3 id=\"_kann_das_alt_attribut_nicht_leer_gelassen_werden_wenn_stattdessen_ein_sinnvolles_title_attribut_verwendet_wird_das_wird_in_meinem_screenreader_problemlos_ausgegeben\">Может ли атрибут <code>alt</code> оставаться пустым, если вместо него используется осмысленный атрибут <code>title</code>? Это плавно выводится в моем скринридере.</h3>",
  "_STEP_9_1_1_1A_QUESTIONS_2_": "<p>Действительно, новые скринридеры выводят атрибут <code>title</code> вместо отсутствующего атрибута <code>alt</code>. Однако это не относится ко всем распространенным инструментам. Поэтому тест фундаментально требует соответствия стандарту HTML 5.0 и WCAG 2.0:</p>",
  "_STEP_9_1_1_1A_QUESTIONS_3_": "<ul><li><p>Атрибут <code>alt</code> должен заменять <strong>содержимое</strong> изображения</p></li><li><p>Атрибут <code>title</code> предназначен для <strong>дополнительной (необязательной) информации</strong></p></li></ul>",
  "_STEP_9_1_1_1A_QUESTIONS_4_": "<p>Поэтому техника WCAG 2.0 <a href=\"http://www.w3.org/TR/WCAG20-TECHS/H33.html\">H33</a> гласит:</p>",
  "_STEP_9_1_1_1A_QUESTIONS_5_": "<div lang=\"en\" class=\"a_mx_3\"><blockquote><p>Из-за ограничений агентов пользователя в поддержке доступа к атрибуту <code>title</code> авторы должны быть осторожны в применении этой техники. По этой причине предпочтительнее, чтобы автор использовал технику <a href=\"http://www.w3.org/TR/WCAG20-TECHS/C7.html\">C7</a>: Использование CSS для скрытия части текста ссылки (CSS) или <a href=\"http://www.w3.org/TR/WCAG20-TECHS/H30.html\">H30</a>: Предоставление текста ссылки, который описывает цель ссылки для элементов якоря (HTML).</p></blockquote></div>",
  "_STEP_9_1_1_1A_QUESTIONS_6_": "<p>Еще один момент, подчеркивающий важность атрибута <code>alt</code>, - его использование с отключенными изображениями. Даже если альтернативные тексты не полностью отображаются в некоторых браузерах в области контуров изображения, это все равно лучше, чем никакого отображения при использовании <code>title</code>.</p>",
  "_STEP_9_1_1_1A_QUESTIONS_7_": "<h3 id=\"_der_alternativtext_beschreibt_die_grafik_der_title_text_beschreibt_das_link_ziel_ist_das_ein_geeigneter_lösungsansatz_für_grafische_links\">Альтернативный текст описывает графику, текст <code>title</code> описывает цель ссылки: Это подходящий подход к графическим ссылкам?</h3>",
  "_STEP_9_1_1_1A_QUESTIONS_8_": "<p>Это решение было предложено для случаев, когда графика не просто представляет цель ссылки (текстовая графика) или стоит за целью ссылки, но также имеет самостоятельное значение (например, в тизерах, состоящих из текстового тизера и связанной иллюстрации).</p>",
  "_STEP_9_1_1_1A_QUESTIONS_9_": "<p>Идея имеет смысл:</p>",
  "_STEP_9_1_1_1A_QUESTIONS_10_": "<p>Видящий пользователь нажимает на изображение, потому что предполагает, что за изображением находится страница. Описывающий альтернативный текст заменяет изображение, и слепой пользователь, как видящий пользователь, делает вывод из (описанного) содержимого изображения о цели ссылки. Если изображение / описание изображения недостаточно ясно показывает, куда оно ведет, видящий пользователь и слепой пользователь могут получить доступ к дополнительной информации в атрибуте <code>title</code>.</p>",
  "_STEP_9_1_1_1A_QUESTIONS_11_": "<p>Однако на практике это не работает:</p>",
  "_STEP_9_1_1_1A_QUESTIONS_12_": "<p>Видящие пользователи не ориентируются на содержание изображения, а скорее на его позицию. Многие тизеры по своему содержанию в любом случае не подходят для сообщения о цели ссылки, связь с темой цели ссылки часто можно только частично понять. Но им и не обязательно сообщать о цели ссылки: Цель ссылки указана в тексте рядом, ее не нужно догадываться по изображению. На изображение нажимают, потому что оно, возможно, легче попасть, и пользователь знает, что тизеры обычно связаны с дополнительной информацией о соответствующем текстовом фрагменте.</p>",
  "_STEP_9_1_1_1A_QUESTIONS_13_": "<p>Для слепого пользователя связь между изображением и (следующим) контекстом обычно не очевидна. Поэтому ему действительно приходится делать предположения о том, куда может вести ссылка, связанная с описанным изображением. И поскольку изображение не обладает соответствующей выразительностью, он обычно <em>зависит</em> от информации в атрибуте <code>title</code>. Таким образом, для него они <em>не являются дополнительными</em>.</p>",
  "_STEP_9_1_1_1A_QUESTIONS_14_": "<p>Кроме того: атрибут <code>title</code> обрабатывается различными популярными скринридерами по-разному и плохо поддерживается. По-прежнему JAWS альтернативно произносит содержимое атрибута <code>alt</code> и атрибута <code>title</code>.</p>",
  "_STEP_9_1_1_1A_QUESTIONS_15_": "<p>Атрибут <code>title</code> предназначен для дополнительной информации. Информация о цели ссылки обычно не является дополнительной информацией, потому что она не вытекает из содержания изображения. Поэтому альтернативный текст должен описывать цель ссылки.</p>",
  "_STEP_9_1_1_1A_QUESTIONS_16_": "<h3 id=\"_sollte_im_alt_attribut_und_im_title_attribut_eines_bildes_derselbe_inhalt_stehen\">Должен ли в атрибуте <code>alt</code> и атрибуте <code>title</code> изображения быть одинаковый текст?</h3>",
  "_STEP_9_1_1_1A_QUESTIONS_17_": "<p>Альтернативный текст должен <em>заменять</em> изображение. Очень часто это означает: Альтернативный текст говорит, что изображено.</p>",
  "_STEP_9_1_1_1A_QUESTIONS_18_": "<p>Атрибут <code>title</code>, с другой стороны, предназначен для <em>дополнительной</em> информации об изображении. Например, он может использоваться, чтобы сообщить, откуда изображение. Здесь находится информация, которую нельзя извлечь из изображения.</p>",
  "_STEP_9_1_1_1A_QUESTIONS_19_": "<p>На самом деле, это ясный случай: задачи атрибутов разные, поэтому обычно они не должны содержать одинаковый текст. Однако есть важное исключение:</p>",
  "_STEP_9_1_1_1A_QUESTIONS_20_": "<p>Часто в качестве <em>элементов управления</em> используются символы или знаки. Для видящих пользователей дополнительное подписывание полезно. Лучше всего оно располагается в тексте рядом с изображением, потому что тогда оно видно даже пользователям с клавиатурой. Однако атрибут <code>title</code> также можно использовать. В этом случае в атрибуте <code>title</code> должен быть примерно такой же текст, как и в доступном имени, установленном через атрибут <code>alt</code> (или через <code>aria-label</code>). Причина в том, что если значения идентичны, то этот текст обычно будет произнесен скринридерами только один раз. Если они различаются, оба значения будут произнесены, что часто приводит к ненужным дублированиям.</p>",
  "_STEP_9_1_1_1A_QUESTIONS_21_": "<h3 id=\"_screenreader_geben_oft_den_dateinamen_der_bilddatei_aus_wenn_kein_alternativtext_zur_verfügung_steht_kann_so_das_fehlen_des_alternativtextes_kompensiert_werden\">Часто экранные дикторы выводят имя файла изображения, если альтернативный текст не предоставлен. Может ли это компенсировать отсутствие альтернативного текста?</h3>",
  "_STEP_9_1_1_1A_QUESTIONS_22_": "<p>Нет, потому что вывод имени файла не является надежным. Не все браузеры или экранные дикторы выводят имя файла. Некоторые выводят полный путь к файлу изображения. Это трудно понять.</p>",
  "_STEP_9_1_1_1A_QUESTIONS_23_": "<h3 id=\"_soll_im_alternativtext_stehen_dass_es_sich_um_ein_navigationselement_handelt\">Следует ли в альтернативном тексте указывать, что это элемент навигации?</h3>",
  "_STEP_9_1_1_1A_QUESTIONS_24_": "<p>Нет, это следует избегать. Экранные дикторы или текстовые браузеры обычно выводят роль элемента, такую как \"Ссылка\" или \"Кнопка\". Если эта роль указана в альтернативном тексте, экранный диктор предоставляет эту информацию дважды.</p>",
  "_STEP_9_1_1_1A_QUESTIONS_25_": "<h3 id=\"_was_ist_ein_passender_alternativtext_für_verlinkte_bilder_etwa_fotos\">Какой подходящий альтернативный текст для связанных с изображениями, например фотографиями?</h3>",
  "_STEP_9_1_1_1A_QUESTIONS_26_": "<p>Если изображения являются ссылками, альтернативный текст в первую очередь должен указывать на цель ссылки. Часто это происходит в контексте тизеров, которые одновременно содержат заголовки, краткие тексты и/или ссылки \"Читать дальше\" или \"Еще\". Здесь часто подходит заголовок в качестве текста ссылки. Если весь тизер является ссылкой, альтернативный текст изображения должен быть пустым, чтобы избежать дублирования. Если изображение само по себе несет информацию, оно должно иметь содержательный альтернативный текст. В таких случаях рекомендуется не включать изображение в ссылку тизера. Техники, такие как <a href=\"https://inclusive-components.design/cards/\">шаблон Карточек</a>, показывают, как изображение все же можно сделать частью области клика.</p>",
  "_STEP_9_1_1_1A_QUESTIONS_27_": "<h3 id=\"_sollte_der_alternativtext_für_grafische_bedienelemente_icons_auch_sagen_was_abgebildet_ist\">Должен ли альтернативный текст для графических элементов управления (иконок) также сообщать, что изображено?</h3>",
  "_STEP_9_1_1_1A_QUESTIONS_28_": "<p>Символы обычно имеют условное значение. Например, лупа обозначает функцию 'Поиск', дискета (по-прежнему) - 'Сохранение', вопросительный знак - 'Справка', ручка - 'Редактирование'. В таких случаях альтернативный текст иконки должен указывать на функцию, а не на изображенный объект.</p>",
  "_STEP_9_1_1_1A_QUESTIONS_29_": "<h3 id=\"_links_oben_ist_das_firmenlogo_abgebildet_es_ist_außerdem_mit_der_startseite_verlinkt_welcher_alternativtext_ist_angemessen\">В верхней части нарисован логотип компании, который также является ссылкой на домашнюю страницу. Какой альтернативный текст является подходящим?</h3>",
  "_STEP_9_1_1_1A_QUESTIONS_30_": "<p>В этом случае альтернативный текст имеет две задачи: он должен представлять логотип и представлять цель ссылки. На основании этого можно аргументировать по-разному:</p>",
  "_STEP_9_1_1_1A_QUESTIONS_31_": "<ol><li><p>Изображение показывает логотип компании. Это его основная задача. Для незрячего пользователя также полезно знать, что компания показывает свой логотип на странице. Дополнительная информация о цели ссылки не нужна. Куда же может вести логотип компании. Так что в альтернативном тексте должно быть \"Логотип: Компания\".</p></li><li><p>Изображение выполняет две функции. Оно показывает логотип компании и служит ссылкой на домашнюю страницу веб-сайта. У видящего пользователя с этим нет проблем, он не удивится, если нажмет на изображение и окажется на домашней странице компании. То же самое для незрячего пользователя. Графическая ссылка с названием Компания. Которая показывает и, вероятно, ссылается на Компанию. Так что в кратком и ясном виде: \"Компания\" в альтернативном тексте!</p></li><li><p>Изображение выполняет две функции. Оно показывает логотип компании и служит ссылкой на домашнюю страницу веб-сайта. Для обоих этих случаев должен быть указан альтернативный текст: \"Логотип: Компания - на домашнюю страницу\".</p></li></ol>",
  "_STEP_9_1_1_1A_QUESTIONS_32_": "<p>Все три альтернативы поддерживают незрячего посетителя. Поэтому в тесте BITV все три альтернативы считаются подходящими.</p>"
}
