{
  "_STEP_9_3_2_2_NAME_": "Нет неожиданных изменений контекста при вводе",
  "_STEP_9_3_2_2_NAME_MENU_": "9.3.2.2 Нет неожиданных изменений контекста при вводе",
  "_STEP_9_3_2_2_WHAT_CHECKED_1_": "<p>Ввод данных пользователя в формах не должен приводить к неожиданным изменениям контекста. Все изменения контекста должны происходить ниже активирующего элемента и должны быть ясно понятны, фокус не должен перемещаться.</p>",
  "_STEP_9_3_2_2_WHY_CHECKED_1_": "<p>Неожиданные и необъявленные изменения контекста при выборе в формах могут нарушить ориентацию пользователей (например, выбор флажка или радио-кнопки вызывает загрузку новой страницы, выпадающий список без кнопки отправки реагирует на <code>onchange</code>). Изменения контекста на странице могут отвлекать и сбивать пользователей с толку или оставаться незамеченными, что также может вызвать путаницу. Поэтому они должны быть ожидаемыми и четко понятными.</p>",
  "_STEP_9_3_2_2_WHY_CHECKED_2_": "<p>Если изменения контекста на той же странице не происходят <strong>под</strong> элементом, который их вызвал, они часто остаются незамеченными слепыми пользователями.</p>",
  "_STEP_9_3_2_2_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_9_3_2_2_HOW_CHECKED_2_": "<p>Этап проверки применим, если страница содержит элементы формы.</p>",
  "_STEP_9_3_2_2_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_3_2_2_HOW_CHECKED_4_": "<ol><li><p>Открыть страницу в браузере (Chrome или Firefox).</p></li><li><p>Попробовать элементы формы (флажки, радио-кнопки, выпадающие списки). Вызывают ли они неожиданные и необъявленные изменения контекста?</p></li><li><p>Проверить, вызывают ли изменения содержимого (например, дополнительные поля формы).</p></li><li><p>Являются ли изменения содержимого ограниченными и хорошо понятными или объявляются <strong>перед</strong> активирующим элементом или объясняются?</p></li><li><p>Проверить, вызывают ли изменения содержимого <strong>под</strong> элементом, который их вызывает.</p></li><li><p>Проверить, не перемещают ли вызванные вводом в форму изменения контекста (например, динамически отображаемые элементы) текущий фокус.</p></li></ol>",
  "_STEP_9_3_2_2_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_9_3_2_2_HOW_CHECKED_6_": "<p>Сообщения об ошибках, выводимые с помощью функции JavaScript <code>alert()</code>, не считаются всплывающими окнами в смысле этапа проверки. Они появляются в ответ на ввод данных пользователя и являются модальными, поэтому с точки зрения ориентации они не проблематичны.</p>",
  "_STEP_9_3_2_2_HOW_CHECKED_7_": "<p>Изменения, вносимые скриптами и <em>ARIA Live Regions</em>, например, автоматическое отображение предложений под полем ввода текста функции поиска, не должны перемещать текущий фокус.</p>",
  "_STEP_9_3_2_2_HOW_CHECKED_8_": "<p>Для разграничения изменений контекста и изменений содержимого:</p>",
  "_STEP_9_3_2_2_HOW_CHECKED_9_": "<ul><li><p>Ясные изменения контекста (<em>changes of context</em>) согласно WCAG 2.1 включают переходы на другие страницы и открытие новых окон, а также динамическую загрузку нового контента на той же странице, если эти контенты <em>кажутся</em> новой страницей или контент отображается в сильно измененном порядке. Также активация переходных ссылок к якорям на той же странице рассматривается как изменение контекста.</p></li><li><p>От этого следует отличать просто изменения содержимого (в WCAG 2.1: <em>changes of content</em>). Они происходят, например, когда выбор в выпадающем списке (<code>select</code>) динамически обновляет содержимое расположенного ниже списка выбора (например, выбор континента обновляет список стран). Также раскрытие дополнительных областей формы <em>под</em> активирующим элементом может считаться изменением содержимого, если фокус и состояние прокрутки страницы остаются неизменными.</p></li></ul>",
  "_STEP_9_3_2_2_HOW_CHECKED_10_": "<p>Являются ли изменения <em>неожиданными</em> или нет, можно определить только из общего контекста.</p>",
  "_STEP_9_3_2_2_HOW_CHECKED_11_": "<p>Сравните: WCAG 2.1, Appendix A: Glossary: <a href=\"http://www.w3.org/TR/WCAG20/#context-changedef\">changes of context</a></p>",
  "_STEP_9_3_2_2_HOW_CHECKED_12_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_3_2_2_HOW_CHECKED_13_": "<h4 id=\"_nicht_voll_erfüllt\">Не полностью выполнено</h4>",
  "_STEP_9_3_2_2_HOW_CHECKED_14_": "<ul><li><p>Взаимодействие с элементами формы вызывает неожиданные и необъявленные изменения контекста.</p></li></ul>",
  "_STEP_9_3_2_2_HOW_CHECKED_15_": "<h4 id=\"_nicht_erfüllt\">Не выполнено</h4>",
  "_STEP_9_3_2_2_HOW_CHECKED_16_": "<ul><li><p>Формы автоматически отправляются, когда фокус покидает форму.</p></li><li><p>Изменение состояния флажка или радио-кнопки автоматически вызывает неожиданное изменение контекста (например, открывает новое окно).</p></li></ul>",
  "_STEP_9_3_2_2_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_von_anderen_prüfschritten\">Различие с другими этапами проверки</h3>",
  "_STEP_9_3_2_2_CLASSIFICATION_2_": "<p>Использование кнопок отправки, указанных в техниках <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G80.html\"> G80</a> и <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H32.html\"> H32</a> критерию успеха <a href=\"https://www.w3.org/TR/WCAG21/#on-input\"> 3.2.2 On Input [без автоматического изменения контекста]</a> проверяется только косвенно в этапе проверки 9.2.1.1 \"Использование без мыши\".</p>",
  "_STEP_9_3_2_2_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация этапа проверки по WCAG 2.1</h3>",
  "_STEP_9_3_2_2_CLASSIFICATION_4_": "<h4 id=\"_guideline\">Руководство</h4>",
  "_STEP_9_3_2_2_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#predictable\"> Руководство 3.2 Predictable: Сделать веб-страницы предсказуемыми в использовании</a></p></li></ul>",
  "_STEP_9_3_2_2_CLASSIFICATION_6_": "<h4 id=\"_success_criterion\">Критерий успеха</h4>",
  "_STEP_9_3_2_2_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#on-input\"> 3.2.2 On Input</a> (Уровень A)</p></li></ul>",
  "_STEP_9_3_2_2_CLASSIFICATION_8_": "<h4 id=\"_techniques\">Техники</h4>",
  "_STEP_9_3_2_2_CLASSIFICATION_9_": "<h5 id=\"_general_techniques\">Общие техники</h5>",
  "_STEP_9_3_2_2_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G80.html\"> G80: Обеспечение кнопки отправки для инициирования изменения контекста с использованием техники, специфичной для технологии, перечисленной ниже</a><br><em>Примечание:</em> Техника G80 присвоена SC 3.2.2, но проверяется только косвенно.</p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G13.html\"> G13: Описание того, что произойдет, прежде чем изменение в элементе управления формы, вызывающее изменение контекста, будет выполнено</a></p></li></ul>",
  "_STEP_9_3_2_2_CLASSIFICATION_11_": "<h5 id=\"_html_techniques\">Техники HTML</h5>",
  "_STEP_9_3_2_2_CLASSIFICATION_12_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H32.html\"> H32: Предоставление кнопок отправки</a><br><em>Примечание:</em> Техника H32 присвоена SC 3.2.2, но проверяется только косвенно.</p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H84.html\"> H84: Использование кнопки с элементом выбора для выполнения действия</a></p></li></ul>",
  "_STEP_9_3_2_2_CLASSIFICATION_13_": "<h4 id=\"_failures\">Неудачи</h4>",
  "_STEP_9_3_2_2_CLASSIFICATION_14_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F36.html\"> F36: Ошибка критерия успеха 3.2.2 из-за автоматической отправки формы и представления нового контента без предварительного предупреждения, когда последнему полю в форме присваивается значение</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F37.html\"> F37: Ошибка критерия успеха 3.2.2 из-за запуска нового окна без предварительного предупреждения, когда изменяется состояние радио-кнопки, флажка или списка выбора</a></p></li></ul>"
}