{
  "_STEP_9_1_4_11_NAME_": "Kontraste von Grafiken und grafischen Bedienelementen ausreichend",
  "_STEP_9_1_4_11_NAME_MENU_": "9.1.4.11 Kontraste von Grafiken und grafischen Bedienelementen ausreichend",
  "_STEP_9_1_4_11_WHAT_CHECKED_1_": "<p>Die für die Identifizierung notwendige visuelle Information von informationstragenden Grafiken und grafischen Bedienelementen sowie deren Zuständen soll einen Kontrast von mindestens 3:1 zu angrenzenden Farben haben.</p>",
  "_STEP_9_1_4_11_WHAT_CHECKED_2_": "<p>In vielen Fällen, wie etwa bei einfarbigen Icons, bedeutet das einfach, dass der Kontrast zwischen der Farbe des Elements und der Hintergrundfarbe gemessen wird.</p>",
  "_STEP_9_1_4_11_WHAT_CHECKED_3_": "<p>Bei mehrfarbigen oder abgetönten Elementen gilt die Kontrastanforderung für jene visuelle Information, über die das Element (oder dessen Zustand) hinreichend klar identifizierbar ist. Es müssen also nicht sämtliche Bereiche einer Grafik die Kontrastanforderung erfüllen.</p>",
  "_STEP_9_1_4_11_WHAT_CHECKED_4_": "<p>Wenn grafische Elemente zusätzlich eingesetzt werden, ein Text also das Bedienelement bzw. dessen Zustand hinreichend kennzeichnet, müssen grafische Elemente die Kontrastanforderung nicht erfüllen.</p>",
  "_STEP_9_1_4_11_WHY_CHECKED_1_": "<p>Viele Menschen mit Sehbehinderungen brauchen gute Kontraste, um grafische Bedienelemente bzw. deren Zustände oder Elemente in informationstragenden Grafiken, etwa statistischen Diagrammen oder Schaubildern, wahrnehmen zu können. Die Forderung nach einem Minimalkontrast für informationstragende Grafiken hilft diesen Menschen.</p>",
  "_STEP_9_1_4_11_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_1_4_11_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn informationstragende grafische Bedienelemente, die nicht lediglich ergänzend (etwa zu Text) eingesetzt werden, oder informationstragende Grafiken vorhanden sind.</p>",
  "_STEP_9_1_4_11_HOW_CHECKED_3_": "<p>Nicht anwendbar ist der Prüfschritt auf Fotos, Logos, Flaggen, Screenshots, Diagramme mit Farben, die nicht geändert werden dürfen, und Datenvisualisierungen mit Farbabstufungen wie etwa Heatmaps.</p>",
  "_STEP_9_1_4_11_HOW_CHECKED_4_": "<p>Ebenfalls nicht anwendbar ist der Prüfschritt auf native grafische Bedienelemente, die in ihrem Erscheinungsbild nicht durch den Autor beeinflusst wurden, etwa native HTML-Checkboxen, sowie auf inaktive Bedienelemente, also solche, die zustandsabhängig für die Interaktion nicht zur Verfügung stehen.</p>",
  "_STEP_9_1_4_11_HOW_CHECKED_5_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_1_4_11_HOW_CHECKED_6_": "<p>Hinweis: Für die aufgeführten Prüfungen 2.2 bis 2.4 ist eine Sichtprüfung ausreichend, wenn der Kontrast <strong>sehr deutlich</strong> über 3:1 liegt. Im Zweifelsfall immer den Color Contrast Analyzer einsetzen.</p>",
  "_STEP_9_1_4_11_HOW_CHECKED_7_": "<h4 id=\"_2_1_prüfung_nicht_festgelegter_farben\">2.1 Prüfung nicht festgelegter Farben</h4>",
  "_STEP_9_1_4_11_HOW_CHECKED_8_": "<ol><li><p>Prüfung, ob für Grafiken oder Bedienelemente (etwa Icon Fonts), für die über CSS eine Vordergrundfarbe festgelegt wurde, auch eine Hintergrundfarbe festgelegt ist (und umgekehrt).</p></li><li><p>Das Bookmarklet <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste/bookmarklets.html\"> Vorder-und Hintergrundfarbe definiert</a> oder ein User Stylesheet (<code>html {background-color:black;color:white}</code>) aktivieren.</p></li><li><p>Prüfen, ob Grafiken oder Bedienelemente nun verschwinden oder schlecht zu erkennen sind. In diesen Fällen fehlt entweder die Festlegung der Farbe oder die der Hintergrundfarbe.</p></li></ol>",
  "_STEP_9_1_4_11_HOW_CHECKED_9_": "<h4 id=\"_2_2_prüfung_von_bedienelementen_in_der_ausgangsansicht\">2.2 Prüfung von Bedienelementen in der Ausgangsansicht</h4>",
  "_STEP_9_1_4_11_HOW_CHECKED_10_": "<ol><li><p>Grafische Bedienelemente (etwa Icons) auf der Seite identifizieren, die keinen nebenstehenden Text haben, der dessen Bedeutung und ggf. auch wechselnde Zustände nach Interaktion identifiziert. Sind die Kontraste zu angrenzenden Farben klar ausreichend (3:1 oder besser)?</p></li><li><p>Bedienelemente mit Rahmen (etwa Schaltflächen oder Texteingabefelder) identifizieren. Wenn das Bedienelement nur über den Rahmen (oder einen Teil des Rahmens) identifizierbar ist (der Rahmen also keinen Text oder Symbol umschließt), muss der Rahmen einen Kontrast von mindestens 3:1 haben.</p></li></ol>",
  "_STEP_9_1_4_11_HOW_CHECKED_11_": "<h4 id=\"_2_3_prüfung_von_bedienelement_zuständen_nach_fokussierung_oder_aktivierung\">2.3 Prüfung von Bedienelement-Zuständen nach Fokussierung oder Aktivierung</h4>",
  "_STEP_9_1_4_11_HOW_CHECKED_12_": "<ol><li><p>Bedienelemente mit der Tastatur und der Maus fokussieren. Ist der Kontrast der Fokushervorhebung zu angrenzenden Farben klar ausreichend (3:1 oder besser)?</p></li><li><p>Bei Bedienelementen, die verschiedene funktionale Zustände haben (etwa Checkboxen, Radio-Buttons, Reiter in Registerbereichen) die verfügbaren anderen Zustände aufrufen. Ist der Kontrast der informationstragenden Teile der Bedienelemente zu angrenzenden Farben klar ausreichend (3:1 oder besser). Hinweis: Ausgenommen von der Anforderung sind native, also vom Autor nicht gestylte, Bedienelemente.</p></li></ol>",
  "_STEP_9_1_4_11_HOW_CHECKED_13_": "<h4 id=\"_2_4_prüfung_von_informationsgrafiken\">2.4 Prüfung von Informationsgrafiken</h4>",
  "_STEP_9_1_4_11_HOW_CHECKED_14_": "<ol><li><p>Informationstragende Grafiken identifizieren, bei denen die Information nur über die Grafik und nicht (oder nicht ausreichend) über beigefügten Text vermittelt wird.</p></li><li><p>Wenn es in Bereichen der Grafik Farbverläufe gibt, Anteile mit einem Kontrast von weniger als 3:1 ignorieren und bewerten, ob die Information immer noch ausreichend vom kontrastreicheren Teil der Grafik vermittelt wird.</p></li></ol>",
  "_STEP_9_1_4_11_HOW_CHECKED_15_": "<h4 id=\"_2_5_styleswitcher_prüfung_prüfung_der_grafikkontraste_der_alternativen_ansicht\">2.5 Styleswitcher-Prüfung, Prüfung der Grafikkontraste der alternativen Ansicht</h4>",
  "_STEP_9_1_4_11_HOW_CHECKED_16_": "<p>Wenn die Kontraste der Standardversion nicht die Sollwerte erfüllen und die Seite eine kontrastreichere Ansicht über einen Styleswitcher anbietet:</p>",
  "_STEP_9_1_4_11_HOW_CHECKED_17_": "<ol><li><p>Grafikkontrast des Styleswitcher-Schaltelements prüfen.</p></li><li><p>Das Kontrastverhältnis muss 4,5:1 oder besser sein, sofern der Schalter mit Hilfe von Text beschriftet ist (bei grafischen Schaltern gilt ein Mindestkontrast von 3,0:1, vergl. Prüfschritt 9.1.4.11). Auch alle anderen Anforderungen müssen erfüllt sein (zum Beispiel Tastaturbedienbarkeit), ansonsten Prüfung der alternativen Ansicht abbrechen.</p></li><li><p>Alternative kontrastreichere Ansicht über den Styleswitcher aufrufen.</p></li><li><p>Grafikkontraste der alternativen Ansicht prüfen (wie oben in 2.2. und 2.4 beschrieben). Bestehen nach Aktivierung der alternativen Ansicht weiter irgendwelche Kontrastmängel bei Grafiken oder bei Text, wird diese Ansicht bei der Bewertung der Kontraste nicht berücksichtigt.</p></li></ol>",
  "_STEP_9_1_4_11_HOW_CHECKED_18_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_9_1_4_11_HOW_CHECKED_19_": "<h4 id=\"_3_1_zur_identifizierung_notwendiger_teile_von_bedienelementen\">3.1 Zur Identifizierung notwendiger Teile von Bedienelementen</h4>",
  "_STEP_9_1_4_11_HOW_CHECKED_20_": "<p>Bei den zur Identifizierung notwendigen Teile von Bedienelementen handelt es sich um visuell sichtbare Elemente (z. B. Element-Rahmen, aktivierter Zustand eines Elements, informationstragender Teil eines Icons) die wichtige Informationen enthalten, also etwa den Umriss, den Wert, oder den Zustand eines Bedienelements anzeigen.</p>",
  "_STEP_9_1_4_11_HOW_CHECKED_21_": "<p>Beispiele:</p>",
  "_STEP_9_1_4_11_HOW_CHECKED_22_": "<ul><li><p>Die Fokushervorhebung eines Bedienelements</p></li><li><p>Der Aktivierungszustand einer Registerkarte</p></li><li><p>Die Ränder eines Eingabefelds oder eines Buttons</p></li><li><p>Der Haken einer Custom-Checkbox</p></li></ul>",
  "_STEP_9_1_4_11_HOW_CHECKED_23_": "<p>Visuelle Beispiele dazu finden sich im Dokument <a href=\"https://www.w3.org/WAI/WCAG21/Understanding/non-text-contrast.html\"> Understanding Success Criterion 1.4.11: Non-text Contrast</a>.</p>",
  "_STEP_9_1_4_11_HOW_CHECKED_24_": "<h4 id=\"_3_2_vernachlässigbare_rahmen_und_umrisslinien\">3.2 Vernachlässigbare Rahmen und Umrisslinien</h4>",
  "_STEP_9_1_4_11_HOW_CHECKED_25_": "<p>Wenn die Farbe eines Elements (etwa die innere Hintergrundfarbe eines Schalters oder das Segment eines Kuchendiagramms) ausreichend Kontrast zu Hintergrund hat, auf dem sich das Element befindet, können Rahmen bzw. Umrisslinien bei der Kontrastprüfung vernachlässigt werden.</p>",
  "_STEP_9_1_4_11_HOW_CHECKED_26_": "<h4 id=\"_3_3_kontrast_differenz_bei_zuständen\">3.3 Kontrast-Differenz bei Zuständen</h4>",
  "_STEP_9_1_4_11_HOW_CHECKED_27_": "<ul><li><p>Nicht verlangt wird ein Kontrast von 3:1 für die <em>Differenz</em> zwischen verschiedenen <em>funktionalen</em> Zuständen des gleichen Bedienelements (etwa Umschalter aktiviert/ nicht aktiviert).</p></li><li><p>Ebenfalls nicht verlangt wird hier ein Kontrast von 3:1 für die <em>Differenz</em>   zwischen verschiedenen <em>Interaktions</em>-Zuständen des gleichen Bedienelements   (etwa fokussiert / nicht fokussiert).   Wenn jedoch der Interaktions-Zustand lediglich über einen Farbwechsel   angezeigt wird (also nicht auch anders, etwa durch eine Änderung der Form,   Wechsel von beigestelltem Text, Umrandung oder ähnlich) dann sollte der   Kontrast der einen Farbe zur anderen mindestens 3:1 betragen.   Dies ist Gegenstand der Prüfung in Prüfschritt 9.2.4.7 \"Aktuelle Position des Fokus deutlich\"</p></li></ul>",
  "_STEP_9_1_4_11_HOW_CHECKED_28_": "<p>Verlangt wird der Kontrast dagegen für jeden einzelnen Zustand zur jeweils angrenzenden Farbe.</p>",
  "_STEP_9_1_4_11_SOURCES_1_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/non-text-contrast.html\"> Understanding Success Criterion 1.4.11: Non-text Contrast</a> (zur Zeit nur auf Englisch verfügbar)</p></li></ul>",
  "_STEP_9_1_4_11_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_von_anderen_prüfschritten\">Abgrenzung von anderen Prüfschritten</h3>",
  "_STEP_9_1_4_11_CLASSIFICATION_2_": "<p>In diesem Prüfschritt geht es um die Kontraste von Grafiken und grafischen Attributen wie Umrisslinien. Der Kontrast von Schrift, einschließlich der von Schriftgrafiken, wird in Prüfschritt 9.1.4.3 \"Kontraste von Texten ausreichend\" bewertet.</p>",
  "_STEP_9_1_4_11_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_1_4_11_CLASSIFICATION_4_": "<h4 id=\"_guideline\">Guideline</h4>",
  "_STEP_9_1_4_11_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#distinguishable\"> Guideline 1.4 Distinguishable: Make it easier for users to see and hear content including separating foreground from background</a></p></li></ul>",
  "_STEP_9_1_4_11_CLASSIFICATION_6_": "<h4 id=\"_success_criterion\">Success criterion</h4>",
  "_STEP_9_1_4_11_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#non-text-contrast\"> 1.4.11 Non-Text Contrast</a> (Level AA)</p></li></ul>",
  "_STEP_9_1_4_11_CLASSIFICATION_8_": "<h4 id=\"_sufficient_techniques\">Sufficient Techniques</h4>",
  "_STEP_9_1_4_11_CLASSIFICATION_9_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G174\"> G174: Providing a control with a sufficient contrast ratio that allows users to switch to a presentation that uses sufficient contrast</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G195.html\"> G195: Using an author-supplied, highly visible focus indicator</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G207.html\"> G207: Ensuring that a contrast ratio of 3:1 is provided for icons</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G209.html\"> G209: Provide sufficient contrast at the boundaries between adjoining colors</a></p></li></ul>",
  "_STEP_9_1_4_11_CLASSIFICATION_10_": "<h4 id=\"_failures\">Failures</h4>",
  "_STEP_9_1_4_11_CLASSIFICATION_11_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F78\"> F78: Failure of Success Criterion 2.4.7 due to styling element outlines and borders in a way that removes or renders non-visible the visual focus indicator</a></p></li></ul>"
}
