{
  "_STEP_9_1_4_11_NAME_": "Достаточный контраст графики и графических элементов управления",
  "_STEP_9_1_4_11_NAME_MENU_": "9.1.4.11 Достаточный контраст графики и графических элементов управления",
  "_STEP_9_1_4_11_WHAT_CHECKED_1_": "<p>Визуальная информация, необходимая для идентификации информационных график и графических элементов управления, а также их состояний, должна иметь контраст не менее 3:1 по отношению к соседним цветам.</p>",
  "_STEP_9_1_4_11_WHAT_CHECKED_2_": "<p>Во многих случаях, например, для одноцветных иконок, это просто означает измерение контраста между цветом элемента и цветом фона.</p>",
  "_STEP_9_1_4_11_WHAT_CHECKED_3_": "<p>Для многоцветных или оттеночных элементов требование контраста относится к той визуальной информации, которая позволяет четко идентифицировать элемент (или его состояние). Это не означает, что все участки графики должны соответствовать требованиям к контрасту.</p>",
  "_STEP_9_1_4_11_WHAT_CHECKED_4_": "<p>Если графические элементы используются дополнительно, и текст достаточно описывает элемент управления или его состояние, графическим элементам не обязательно соответствовать требованиям к контрасту.</p>",
  "_STEP_9_1_4_11_WHY_CHECKED_1_": "<p>Многие люди с нарушениями зрения нуждаются в хороших контрастах, чтобы воспринимать графические элементы управления или их состояния, а также элементы в информационных графиках, например, в статистических диаграммах или схемах. Требование минимального контраста для информационных график помогает этим людям.</p>",
  "_STEP_9_1_4_11_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_9_1_4_11_HOW_CHECKED_2_": "<p>Этап проверки применим, если присутствуют информационные графические элементы управления, используемые не только как дополнение (например, к тексту), или информационные графики.</p>",
  "_STEP_9_1_4_11_HOW_CHECKED_3_": "<p>Этап проверки не применим к фотографиям, логотипам, флагам, скриншотам, диаграммам с неизменяемыми цветами и визуализациям данных с градиентами, такими как тепловые карты.</p>",
  "_STEP_9_1_4_11_HOW_CHECKED_4_": "<p>Также этап проверки не применим к нативным графическим элементам управления, внешний вид которых не может быть изменен автором, например, к стандартным HTML-чекбоксам, а также к неактивным элементам управления, то есть тем, которые временно недоступны для взаимодействия.</p>",
  "_STEP_9_1_4_11_HOW_CHECKED_5_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_1_4_11_HOW_CHECKED_6_": "<p>Примечание: Для перечисленных ниже проверок 2.2 до 2.4 достаточно визуальной проверки, если контраст <strong>очень значительно</strong> превышает 3:1. В случае сомнений всегда используйте анализатор контраста цветов.</p>",
  "_STEP_9_1_4_11_HOW_CHECKED_7_": "<h4 id=\"_2_1_prüfung_nicht_festgelegter_farben\">2.1 Проверка неустановленных цветов</h4>",
  "_STEP_9_1_4_11_HOW_CHECKED_8_": "<ol><li><p>Проверить, установлены ли для график или элементов управления (например, иконок шрифтов) через CSS передний и задний фон (и наоборот).</p></li><li><p>Активировать Bookmarklet <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste/bookmarklets.html\"> Vorder-und Hintergrundfarbe definiert</a> или пользовательский стиль (<code>html {background-color:black;color:white}</code>).</p></li><li><p>Проверить, исчезают ли графики или элементы управления или становятся плохо видимыми. В этих случаях либо цвет, либо фоновый цвет не заданы.</p></li></ol>",
  "_STEP_9_1_4_11_HOW_CHECKED_9_": "<h4 id=\"_2_2_prüfung_von_bedienelementen_in_der_ausgangsansicht\">2.2 Проверка элементов управления в исходном виде</h4>",
  "_STEP_9_1_4_11_HOW_CHECKED_10_": "<ol><li><p>Идентифицировать графические элементы управления (например, иконки) на странице, которые не имеют сопутствующего текста, определяющего их значение и возможные изменения состояний после взаимодействия. Достаточно ли контрастов к соседним цветам (3:1 или лучше)?</p></li><li><p>Идентифицировать элементы управления с рамками (например, кнопки или поля для текстового ввода). Если элемент управления идентифицируется только по рамке (или части рамки), рамка должна иметь контраст не менее 3:1.</p></li></ol>",
  "_STEP_9_1_4_11_HOW_CHECKED_11_": "<h4 id=\"_2_3_prüfung_von_bedienelement_zuständen_nach_fokussierung_oder_aktivierung\">2.3 Проверка состояний элементов управления после фокусировки или активации</h4>",
  "_STEP_9_1_4_11_HOW_CHECKED_12_": "<ol><li><p>Сфокусировать элементы управления с клавиатуры и мыши. Достаточен ли контраст подсветки фокуса по сравнению с соседними цветами (3:1 или лучше)?</p></li><li><p>Для элементов управления, имеющих различные функциональные состояния (например, чекбоксы, радиокнопки, вкладки в регистрах), вызвать другие доступные состояния. Достаточен ли контраст информационных частей элементов управления к соседним цветам (3:1 или лучше)? Примечание: Исключение составляют нативные, то есть не стилизованные автором, элементы управления.</p></li></ol>",
  "_STEP_9_1_4_11_HOW_CHECKED_13_": "<h4 id=\"_2_4_prüfung_von_informationsgrafiken\">2.4 Проверка информационных график</h4>",
  "_STEP_9_1_4_11_HOW_CHECKED_14_": "<ol><li><p>Идентифицировать информационные графики, в которых информация передается только через графику, а не (или недостаточно) через прилагаемый текст.</p></li><li><p>Если в областях графики есть градиенты, игнорировать участки с контрастом менее 3:1 и оценить, достаточно ли информации передается более контрастной частью графики.</p></li></ol>",
  "_STEP_9_1_4_11_HOW_CHECKED_15_": "<h4 id=\"_2_5_styleswitcher_prüfung_prüfung_der_grafikkontraste_der_alternativen_ansicht\">2.5 Проверка Styleswitcher, проверка контрастов графики в альтернативном виде</h4>",
  "_STEP_9_1_4_11_HOW_CHECKED_16_": "<p>Если контрасты стандартной версии не соответствуют требуемым значениям и сайт предлагает контрастный вид через Styleswitcher:</p>",
  "_STEP_9_1_4_11_HOW_CHECKED_17_": "<ol><li><p>Проверить контраст элемента управления Styleswitcher.</p></li><li><p>Контрастное соотношение должно быть 4,5:1 или лучше, если переключатель обозначен текстом (для графических переключателей минимальный контраст составляет 3,0:1, см. этап проверки 9.1.4.11). Также должны быть выполнены все другие требования (например, управление с клавиатуры), иначе проверка альтернативного вида прерывается.</p></li><li><p>Вызвать контрастный вид через Styleswitcher.</p></li><li><p>Проверить контрасты графики в альтернативном виде (как описано выше в 2.2 и 2.4). Если после активации альтернативного вида остаются какие-либо недостатки контраста в графике или тексте, этот вид не учитывается при оценке контрастов.</p></li></ol>",
  "_STEP_9_1_4_11_HOW_CHECKED_18_": "<h3 id=\"_3_hinweise\">3. Примечания</h3>",
  "_STEP_9_1_4_11_HOW_CHECKED_19_": "<h4 id=\"_3_1_zur_identifizierung_notwendiger_teile_von_bedienelementen\">3.1 Определение необходимых частей элементов управления</h4>",
  "_STEP_9_1_4_11_HOW_CHECKED_20_": "<p>Под необходимыми частями элементов управления понимаются визуально видимые элементы (например, рамка элемента, активированное состояние элемента, информационная часть иконки), содержащие важную информацию, например, очертания, значение или состояние элемента управления.</p>",
  "_STEP_9_1_4_11_HOW_CHECKED_21_": "<p>Примеры:</p>",
  "_STEP_9_1_4_11_HOW_CHECKED_22_": "<ul><li><p>Подсветка фокуса элемента управления</p></li><li><p>Состояние активации вкладки</p></li><li><p>Границы поля ввода или кнопки</p></li><li><p>Галочка в пользовательском чекбоксе</p></li></ul>",
  "_STEP_9_1_4_11_HOW_CHECKED_23_": "<p>Визуальные примеры можно найти в документе <a href=\"https://www.w3.org/WAI/WCAG21/Understanding/non-text-contrast.html\">Понимание критерия успеха 1.4.11: Контрастность нон-текста</a>.</p>",
  "_STEP_9_1_4_11_HOW_CHECKED_24_": "<h4 id=\"_3_2_vernachlässigbare_rahmen_und_umrisslinien\">3.2 Незначительные рамки и контуры</h4>",
  "_STEP_9_1_4_11_HOW_CHECKED_25_": "<p>Если цвет элемента (например, внутренний фоновый цвет переключателя или сегмент круговой диаграммы) имеет достаточный контраст с фоном, на котором он расположен, рамки или контурные линии можно не учитывать при проверке контрастности.</p>",
  "_STEP_9_1_4_11_HOW_CHECKED_26_": "<h4 id=\"_3_3_kontrast_differenz_bei_zuständen\">3.3 Различие в контрастах состояний</h4>",
  "_STEP_9_1_4_11_HOW_CHECKED_27_": "<ul><li><p>Не требуется контрастность 3:1 для <em>различий</em> между разными <em>функциональными</em> состояниями одного и того же элемента управления (например, включен/выключен).</p></li><li><p>Также не требуется контрастность 3:1 для <em>различий</em> между различными <em>состояниями взаимодействия</em> одного и того же элемента управления (например, сфокусирован/не сфокусирован). Однако, если состояние взаимодействия отображается только изменением цвета (не сопровождается изменением формы, добавлением текста, изменением рамки и т.д.), тогда контраст одного цвета к другому должен быть не менее 3:1. Это рассматривается на этапе проверки 9.2.4.7 «Четкое указание текущего положения фокуса».</p></li></ul>",
  "_STEP_9_1_4_11_HOW_CHECKED_28_": "<p>Требуется контраст для каждого отдельного состояния по отношению к соседнему цвету.</p>",
  "_STEP_9_1_4_11_SOURCES_1_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/non-text-contrast.html\">Понимание критерия успеха 1.4.11: Контрастность нон-текста</a> (в настоящее время доступно только на английском)</p></li></ul>",
  "_STEP_9_1_4_11_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_von_anderen_prüfschritten\">Ограничения по сравнению с другими этапами проверки</h3>",
  "_STEP_9_1_4_11_CLASSIFICATION_2_": "<p>Этот этап проверки касается контрастности графики и графических атрибутов, таких как контурные линии. Контраст текста, включая текст на графиках, оценивается в этапе проверки 9.1.4.3 «Достаточный контраст текстов».</p>",
  "_STEP_9_1_4_11_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация этапа проверки по WCAG 2.1</h3>",
  "_STEP_9_1_4_11_CLASSIFICATION_4_": "<h4 id=\"_guideline\">Руководящий принцип</h4>",
  "_STEP_9_1_4_11_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#distinguishable\">Руководящий принцип 1.4 Различимость: Упрощение восприятия и слышимости контента, включая разделение переднего плана от фона</a></p></li></ul>",
  "_STEP_9_1_4_11_CLASSIFICATION_6_": "<h4 id=\"_success_criterion\">Критерий успеха</h4>",
  "_STEP_9_1_4_11_CLASSIFICATION_7_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#non-text-contrast\">1.4.11 Контрастность нон-текста</a> (Уровень AA)</p></li></ul>",
  "_STEP_9_1_4_11_CLASSIFICATION_8_": "<h4 id=\"_sufficient_techniques\">Достаточные методики</h4>",
  "_STEP_9_1_4_11_CLASSIFICATION_9_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G174\">G174: Обеспечение элемента управления с достаточным контрастным соотношением, которое позволяет пользователям переключаться на презентацию с достаточным контрастом</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G195\">G195: Использование авторского, хорошо видимого индикатора фокуса</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G207\">G207: Обеспечение соотношения контрастности 3:1 для иконок</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G209\">G209: Обеспечение достаточного контраста на границах между смежными цветами</a></p></li></ul>",
  "_STEP_9_1_4_11_CLASSIFICATION_10_": "<h4 id=\"_failures\">Ошибки</h4>",
  "_STEP_9_1_4_11_CLASSIFICATION_11_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F78\">F78: Нарушение критерия успеха 2.4.7 из-за стилизации контуров и границ элементов таким образом, что визуальный индикатор фокуса удаляется или становится невидимым</a></p></li></ul>"
}