{
  "_STEP_9_3_3_4_NAME_": "Fehlervermeidung wird unterstützt",
  "_STEP_9_3_3_4_NAME_MENU_": "9.3.3.4 Fehlervermeidung wird unterstützt",
  "_STEP_9_3_3_4_WHAT_CHECKED_1_": "<p>Bei wichtigen Dateneingaben (etwa bei finanziellen Transaktionen) gibt es die Möglichkeit, die Dateneingabe rückgängig zu machen oder sie vor dem Abschicken zu überprüfen und zu korrigieren. Erfolgreiche Eingaben werden bestätigt.</p>",
  "_STEP_9_3_3_4_WHY_CHECKED_1_": "<p>Bei jeder Dateneingabe können Fehler passieren. Gerade wenn sich der Prozess nicht rückgängig machen lässt, ist es wichtig, Benutzer dazu anzuhalten, die eingegebenen Daten vor dem Abschicken noch einmal zu überprüfen.</p>",
  "_STEP_9_3_3_4_WHY_CHECKED_2_": "<p>Dies ist für alle Benutzer wichtig. Für Benutzer mit Behinderungen ist jedoch in vielen Fällen das Risiko von Fehleingaben größer. Benutzer mit Legasthenie vertauschen häufiger Zahlen, Benutzer mit motorischen Einschränkungen drücken häufiger versehentlich falsche Tastaturtasten. Deshalb ist das Rückgängig-Machen oder Anzeigen, Überprüfen und gegebenenfalls Korrigieren eingegebener Daten für diese Benutzer besonders wichtig.</p>",
  "_STEP_9_3_3_4_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_3_3_4_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn die Seite Formulare für Transaktionen enthält, durch die Nutzer rechtlich bindende Verpflichtungen eingehen. Dazu gehören Online-Bestellvorgänge und andere finanzielle Transaktionen.</p>",
  "_STEP_9_3_3_4_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_3_3_4_HOW_CHECKED_4_": "<p>Formular mit Beispieldaten ausfüllen und Prozess fortsetzen. Eine der folgenden drei Optionen soll erfüllt sein:</p>",
  "_STEP_9_3_3_4_HOW_CHECKED_5_": "<ul><li><p>Datenanzeige mit Korrekturmöglichkeit: Die eingegebenen Daten werden dem Benutzer vor dem Abschicken noch einmal angezeigt, es gibt an dieser Stelle die Möglichkeit, die Daten zu korrigieren.</p></li><li><p>Bestätigung: Das Abschicken erfolgt erst nach Bestätigung eines Dialogs, der die Konsequenzen der Transaktion beschreibt.</p></li><li><p>Unmittelbare Rückabwicklung: Die Transaktion (etwa das Löschen von angelegten Datensätzen) kann unmittelbar rückgängig gemacht werden.</p></li></ul>",
  "_STEP_9_3_3_4_HOW_CHECKED_6_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_9_3_3_4_HOW_CHECKED_7_": "<p>Eine Checkbox oberhalb des \"Abschicken\"-Buttons zur Bestätigung der Richtigkeit von Benutzereingaben ist ein wesentlich schwächeres Instrument als die Anzeige der kompletten Eingabe auf einer neuen Seite vor dem endgültigen Abschicken des Formulars. Solche Checkboxen werden häufig für formalrechtlich relevante Funktionen genutzt, wie etwa die Bestätigung der Geschäftsbedingungen eines Anbieters. Sie werden deshalb von vielen Benutzern nicht richtig wahrgenommen und routinemäßig gesetzt. Für die Bestätigung wichtiger Eingaben sind sie deshalb weniger geeignet.</p>",
  "_STEP_9_3_3_4_HOW_CHECKED_8_": "<p>Erfolgreiche Eingaben sollten nach dem Abschicken bestätigt werden.</p>",
  "_STEP_9_3_3_4_HOW_CHECKED_9_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_9_3_3_4_HOW_CHECKED_10_": "<h4 id=\"_nicht_voll_erfüllt\">Nicht voll erfüllt</h4>",
  "_STEP_9_3_3_4_HOW_CHECKED_11_": "<ul><li><p>Daten werden vor dem Abschicken zum Überprüfen angezeigt, es gibt aber keinen expliziten Link zurück zum Formular, um Daten zu korrigieren oder zu ergänzen.</p></li><li><p>Es gibt weder eine Datenanzeige mit Korrekturmöglichkeit noch die Möglichkeit der unmittelbaren Rückabwicklung. Zum Bestätigen der Eingabe gibt es keinen Dialog, sondern lediglich eine Checkbox über dem \"Abschicken\"-Button.</p></li><li><p>Nach dem erfolgreichen Abschicken gibt es keine Bestätigung.</p></li></ul>",
  "_STEP_9_3_3_4_HOW_CHECKED_12_": "<h4 id=\"_nicht_erfüllt\">Nicht erfüllt</h4>",
  "_STEP_9_3_3_4_HOW_CHECKED_13_": "<ul><li><p>Wichtige Daten werden ohne vorherige Datenanzeige, Dialog zur Bestätigung, oder Möglichkeit der sofortigen Rückabwicklung abgeschickt.</p></li><li><p>Bei Neuanzeige des Formulars sind bereits gemachte Eingaben gelöscht, die Felder sind wieder leer und müssen erneut ausgefüllt werden.</p></li></ul>",
  "_STEP_9_3_3_4_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_3_3_4_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Guideline</h4>",
  "_STEP_9_3_3_4_CLASSIFICATION_3_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#input-assistance\"> Guideline 3.3 Input Assistance: Help users avoid and correct mistakes.</a></p></li></ul>",
  "_STEP_9_3_3_4_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Success criterion</h4>",
  "_STEP_9_3_3_4_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#error-prevention-legal-financial-data\"> 3.3.4 Error prevention (Legal, Financial, Data)</a> (Level AA)</p></li></ul>",
  "_STEP_9_3_3_4_CLASSIFICATION_6_": "<h4 id=\"_techniques\">Techniques</h4>",
  "_STEP_9_3_3_4_CLASSIFICATION_7_": "<h5 id=\"_general_techniques\">General Techniques</h5>",
  "_STEP_9_3_3_4_CLASSIFICATION_8_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G98.html\"> G98: Providing the ability for the user to review and correct answers before submitting</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G99\"> G99: Providing the ability to recover deleted information</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G155\"> G155: Providing a checkbox in addition to a submit button</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G164\"> G164: Providing a stated time within which an online request (or transaction) may be amended or canceled by the user after making the request</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G168\"> G168: Requesting confirmation to continue with selected action</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G199\"> G199: Providing success feedback when data is submitted successfully</a></p></li></ul>"
}