{
  "_STEP_9_3_3_4_NAME_": "Поддержка предотвращения ошибок",
  "_STEP_9_3_3_4_WHAT_CHECKED_1_": "<p>Для важных вводов данных (например, финансовые транзакции) есть возможность отменить ввод данных или проверить и исправить их перед отправкой. Успешный ввод данных подтверждается.</p>",
  "_STEP_9_3_3_4_WHY_CHECKED_1_": "<p>При вводе данных ошибки неизбежны. Особенно когда процесс необратим, важно заставить пользователей проверить введенные данные перед их отправкой.</p>",
  "_STEP_9_3_3_4_WHY_CHECKED_2_": "<p>Это важно для всех пользователей. Однако для пользователей с ограниченными возможностями риск допустить ошибку часто выше. Например, пользователи с дислексией чаще путают цифры, а пользователи с ограниченными двигательными функциями чаще случайно нажимают неправильные клавиши. Поэтому возможность отмены или отображения, проверки и при необходимости корректировки введенных данных особенно важна для этих пользователей.</p>",
  "_STEP_9_3_3_4_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_9_3_3_4_HOW_CHECKED_2_": "<p>Этап проверки применим, если на странице присутствуют формы для транзакций, влекущие за собой юридические обязательства. К ним относятся онлайн-заказы и другие финансовые транзакции.</p>",
  "_STEP_9_3_3_4_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_3_3_4_HOW_CHECKED_4_": "<p>Заполнить форму тестовыми данными и продолжить процесс. Должен быть выполнен один из следующих вариантов:</p>",
  "_STEP_9_3_3_4_HOW_CHECKED_5_": "<ul><li><p>Отображение данных с возможностью корректировки: перед отправкой данные еще раз показываются пользователю, и на этом этапе можно их исправить.</p></li><li><p>Подтверждение: отправка происходит только после подтверждения диалогового окна, описывающего последствия транзакции.</p></li><li><p>Немедленное отменение: транзакция (например, удаление созданных записей данных) может быть немедленно отменена.</p></li></ul>",
  "_STEP_9_3_3_4_HOW_CHECKED_6_": "<h3 id=\"_3_hinweise\">3. Примечания</h3>",
  "_STEP_9_3_3_4_HOW_CHECKED_7_": "<p>Флажок над кнопкой «Отправить» для подтверждения правильности ввода пользователем данных является значительно слабым инструментом по сравнению с отображением полных данных на новой странице перед окончательной отправкой формы. Такие флажки часто используются для юридически значимых функций, например для подтверждения условий обслуживания поставщика. Поэтому многие пользователи не воспринимают их должным образом и устанавливают их автоматически. Для подтверждения важных вводов они менее подходят.</p>",
  "_STEP_9_3_3_4_HOW_CHECKED_8_": "<p>Успешные вводы должны подтверждаться после отправки.</p>",
  "_STEP_9_3_3_4_HOW_CHECKED_9_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_3_3_4_HOW_CHECKED_10_": "<h4 id=\"_nicht_voll_erfüllt\">Частично выполнено</h4>",
  "_STEP_9_3_3_4_HOW_CHECKED_11_": "<ul><li><p>Данные показаны для проверки перед отправкой, но нет явной ссылки назад к форме для исправления или дополнения данных.</p></li><li><p>Отсутствует отображение данных с возможностью корректировки или возможность немедленной отмены. Для подтверждения ввода нет диалога, только флажок над кнопкой «Отправить».</p></li><li><p>Отсутствует подтверждение после успешной отправки.</p></li></ul>",
  "_STEP_9_3_3_4_HOW_CHECKED_12_": "<h4 id=\"_nicht_erfüllt\">Не выполнено</h4>",
  "_STEP_9_3_3_4_HOW_CHECKED_13_": "<ul><li><p>Важные данные отправляются без предварительного отображения данных, диалога подтверждения или возможности немедленной отмены.</p></li><li><p>При новом отображении формы уже сделанные вводы удаляются, поля очищаются и должны быть заполнены заново.</p></li></ul>",
  "_STEP_9_3_3_4_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация шага проверки по WCAG 2.1</h3>",
  "_STEP_9_3_3_4_CLASSIFICATION_2_": "<h4 id=\"_guideline\">Руководство</h4>",
  "_STEP_9_3_3_4_CLASSIFICATION_3_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#input-assistance\"> Руководство 3.3 Помощь пользователям в избежание и исправлении ошибок.</a></p></li></ul>",
  "_STEP_9_3_3_4_CLASSIFICATION_4_": "<h4 id=\"_success_criterion\">Критерий успеха</h4>",
  "_STEP_9_3_3_4_CLASSIFICATION_5_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#error-prevention-legal-financial-data\"> 3.3.4 Предотвращение ошибок (юридические, финансовые данные)</a> (Уровень AA)</p></li></ul>",
  "_STEP_9_3_3_4_CLASSIFICATION_6_": "<h4 id=\"_techniques\">Техники</h4>",
  "_STEP_9_3_3_4_CLASSIFICATION_7_": "<h5 id=\"_general_techniques\">Общие техники</h5>",
  "_STEP_9_3_3_4_CLASSIFICATION_8_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G98.html\"> G98: Предоставление возможности пользователю просмотреть и исправить ответы перед их отправкой</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G99\"> G99: Предоставление возможности восстановить удаленную информацию</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G155\"> G155: Предоставление флажка в дополнение к кнопке отправки</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G164\"> G164: Обеспечение указанного времени, в течение которого пользователь может изменить или отменить онлайн-запрос (или транзакцию) после ее выполнения</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G168\"> G168: Запрос подтверждения для продолжения выбранного действия</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G199\"> G199: Предоставление обратной связи об успехе при успешной отправке данных</a></p></li></ul>"
}