{
  "_STEP_9_2_4_4_NAME_": "Aussagekräftige Linktexte",
  "_STEP_9_2_4_4_WHAT_CHECKED_1_": "<p>Ziel oder Zweck des Links sollen aus dem Linktext hervorgehen oder aus dem direkten Kontext des Links ermittelbar sein.</p>",
  "_STEP_9_2_4_4_WHAT_CHECKED_2_": "<p>Falls Links nicht auf HTML-Seiten verweisen, soll der Link über das Dateiformat des Zieldokuments informieren.</p>",
  "_STEP_9_2_4_4_WHY_CHECKED_1_": "<p>Blinde Nutzer, die von Link zu Link tabben, bekommen die Linktexte vorgelesen und können bei aussagekräftigen Linktexten leicht entscheiden, ob sie einem Link folgen möchten.</p>",
  "_STEP_9_2_4_4_WHY_CHECKED_2_": "<p>Falls der Linktext selbst nicht aussagekräftig ist, soll der unmittelbare Kontext für Screenreader-Nutzer wenigstens leicht ermittelbar sein.</p>",
  "_STEP_9_2_4_4_WHY_CHECKED_3_": "<p>Screenreader bieten die Möglichkeit der Auflistung sämtlicher Links der Seite und damit einen schnellen Überblick, selbst wenn die Seite ansonsten schlecht zugänglich ist. Diese Technik funktioniert allerdings nicht, wenn alle Linktexte gleich sind und nicht ausreichend Auskunft über das Linkziel geben.</p>",
  "_STEP_9_2_4_4_WHY_CHECKED_4_": "<p>Bei Links zu Angeboten in anderen Formaten als HTML (zum Beispiel PDF- oder Word-Dokumente) ist es für Nutzende sinnvoll zu wissen, in welchem Format Informationen angeboten werden, bevor sie einen Link aktivieren. Wenn Informationen zum Dateiformat visuell bereitgehalten werden (etwa über ein mittels CSS eingeblendetes PDF- oder Word-Icon) dann soll diese Information auch für blinde Nutzer verfügbar sein.</p>",
  "_STEP_9_2_4_4_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_2_4_4_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn die Seite Links enthält.</p>",
  "_STEP_9_2_4_4_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_2_4_4_HOW_CHECKED_4_": "<h4 id=\"_2_1_prüfung_von_linktexten\">2.1 Prüfung von Linktexten</h4>",
  "_STEP_9_2_4_4_HOW_CHECKED_5_": "<ol><li><p>Seite im Firefox aufrufen.</p></li><li><p>Prüfen, ob die Linktexte aussagekräftig sind, das heißt, im Linktext oder im Kontext eine Auskunft über Ziel oder Zweck des Links geben.</p></li><li><p>Für Links, deren sichtbarer Linktext allein nicht aussagekräftig ist (z. B. \"mehr\" oder \"weiterlesen\"), prüfen, ob der Linktext durch eine der folgenden Möglichkeiten im Kontext sinnvoll ergänzt wird:</p><ul><li><p>durch zusätzlichen, über CSS versteckten Linktext (hierfür ggf. in der Web Developer Toolbar die Option <em>CSS &gt; Disable All Styles</em> wählen und die betroffenen Links erneut prüfen)</p></li><li><p>durch den Alternativtext einer mit im selben <code>a</code>-Element verlinkten Grafik (hierfür die Option <em>Images &gt; Display Alt Attributes</em> wählen)</p></li><li><p>durch den Text im umschließenden Element (<code>p</code>, <code>li</code>). Das <code>div</code>-Element wird hier wie <code>p</code> behandelt</p></li><li><p>bei Links in untergeordneten Listen durch den Text des übergeordneten <code>li</code>-Elements</p></li><li><p>durch den Text der umschließenden Tabellenzelle und der dazugehörigen Überschriftenzellen (<code>td</code>, <code>th</code>)</p></li><li><p>durch den Text der vorangehenden Überschrift (<code>h1</code> - <code>h6</code>)</p></li><li><p>Mit Hilfe des <code>aria-label</code> oder <code>aria-labelledby</code>-Attributs (Achtung: <code>aria-label</code> überschreibt den Text des Links)</p></li><li><p>durch einen verständlichen Link am Seitenbeginn, der Linktexte auf der Seite erweitert.</p></li></ul></li></ol>",
  "_STEP_9_2_4_4_HOW_CHECKED_6_": "<h4 id=\"_2_2_prüfung_von_links_auf_andere_dateiformate\">2.2 Prüfung von Links auf andere Dateiformate</h4>",
  "_STEP_9_2_4_4_HOW_CHECKED_7_": "<ol><li><p>Seite im Browser aufrufen.</p></li><li><p>Prüfen, ob visuell, etwa über zusätzliche Icons oder in Custom-Tooltips, Auskunft über das Dateiformat gegeben wird.</p></li><li><p>Prüfen, ob visuelle Information zum Dateiformat auch programmatisch bereitgestellt wird (etwa über versteckten Linktext, Alternativtext, das <code>title</code>-Attribut oder geeignete ARIA-Attribute).</p></li><li><p>Falls weder über den Linktext noch über ein entsprechend eindeutiges Icon Auskunft über das Dateiformat gegeben wird, ist das Dateiformat des Links möglicherweise für alle Nutzenden unklar. Dies ist nicht als Mangel im Sinne dieses Prüfschritts zu bewerten (sollte jedoch ggf. als allgemeines Usability-Problem angemerkt werden).</p></li></ol>",
  "_STEP_9_2_4_4_HOW_CHECKED_8_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_9_2_4_4_HOW_CHECKED_9_": "<ul><li><p>Links, deren Ziel generell für alle Nutzer unklar ist, fallen nicht unter diesen Prüfschritt.</p></li><li><p>Verlinkte URLs und verlinkte E-Mail-Adressen vermitteln über ihr Format den Linkzweck (etwa, dass sie einen Email-Client öffnen oder auf ein externes Webangebot verlinken). URLs sind für alle Nutzer möglicherweise nicht aussagekräftig und werden deshalb hier nicht negativ bewertet.</p></li><li><p>Bei verlinkten Grafiken ist der Linktext der Wert des <code>alt</code>-Attributs des <code>img</code>-Elements. Der Linktext kann auch aus dem <code>alt</code>-Text einer oder mehrerer Grafiken und einfachem Text zusammengesetzt sein.</p></li><li><p>Nicht aussagekräftige Links wie \"mehr..\", \"weiter\", \"etc.\" im letzten <code>li</code>-Element einer Liste werden akzeptiert, wenn die Bedeutung aus dem programmatisch ermittelbaren Kontext hervorgeht. Dazu gehört der den Link einschließende Absatz oder Listenpunkt oder auch die vorangehende Überschrift.</p></li><li><p>Wenn zusätzlicher, per CSS unsichtbar gemachter Linktext mit <code>display:none</code> versteckt wird, ist er programmatisch nicht ermittelbar und verbessert nicht die Aussagekraft des Links: dieser Text wird von Screenreadern ignoriert.</p></li><li><p>Das <code>title</code>-Attribut eines Links ist potenziell programmatisch ermittelbar, wird aber in manchen Fällen (abhängig von Einstellungen) nicht von Screenreadern ausgewertet.</p></li></ul>",
  "_STEP_9_2_4_4_HOW_CHECKED_10_": "<h3 id=\"_4_bewertung\">4. Bewertung</h3>",
  "_STEP_9_2_4_4_HOW_CHECKED_11_": "<h4 id=\"_erfüllt\">Erfüllt</h4>",
  "_STEP_9_2_4_4_HOW_CHECKED_12_": "<ul><li><p>Alle Links benennen im Linktext oder im programmatisch ermittelbaren Kontext Linkziel oder Linkzweck.</p></li><li><p>Alle Links auf nicht-HTML-Angebote, die visuell über das Dateiformat informieren, stellen diese Information auch programmatisch ermittelbar zur Verfügung.</p></li></ul>",
  "_STEP_9_2_4_4_SOURCES_1_": "<h3 id=\"_zweck_der_kontextunabhängigkeit\">Zweck der Kontextunabhängigkeit</h3>",
  "_STEP_9_2_4_4_SOURCES_2_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>Assistive technology has the ability to provide users with a list of links that are on the Web page. Link text that is as meaningful as possible will aid users who want to choose from this list of links. Meaningful link text also helps those who wish to tab from link to link. Meaningful links help users choose which links to follow without requiring complicated strategies to understand the page.</p></blockquote></div>",
  "_STEP_9_2_4_4_SOURCES_3_": "<p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/link-purpose-in-context.html\"> WCAG 2.1, Link Purpose (In Context): Understanding SC 2.4.4</a></p>",
  "_STEP_9_2_4_4_SOURCES_4_": "<h3 id=\"_gruppen_zusammengehöriger_links\">Gruppen zusammengehöriger Links</h3>",
  "_STEP_9_2_4_4_SOURCES_5_": "<p>Bei einer Gruppe zusammengehöriger Links kann im ersten Link Ziel oder Zweck genannt werden und in den folgenden Links unterscheidende Informationen. Die WCAG 2.1 geben folgendes Beispiel:</p>",
  "_STEP_9_2_4_4_SOURCES_6_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>A list of books is available in three formats: HTML, PDF, and mp3 (a recording of a person reading the book). To avoid hearing the title of each book three times (once for each format), the first link for each book is the title of the book, the second link says \"PDF\" and the third says, \"mp3.\"</p></blockquote></div>",
  "_STEP_9_2_4_4_SOURCES_7_": "<p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/link-purpose-in-context.html#examples\"> WCAG 2.1, Link Purpose (In Context): Understanding SC 2.4.4: Examples of Success Criterion 2.4.4</a></p>",
  "_STEP_9_2_4_4_SOURCES_8_": "<h3 id=\"_aussagekraft_über_den_kontext\">Aussagekraft über den Kontext</h3>",
  "_STEP_9_2_4_4_SOURCES_9_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><div class=\"openblock\"><div class=\"content\"><p>Whenever possible, provide link text that identifies the purpose of the link without needing additional context.</p><p>In some situations, authors may want to provide part of the description of the link in logically related text that provides the context for the link. In this case the user should be able to identify the purpose of the link without moving focus from the link. In other words, they can arrive on a link and find out more about it without losing their place. This can be achieved by putting the description of the link in the same sentence, paragraph, list item, the heading immediately preceding the link, or table cell as the link, or in the table header cell for a link in a data table, because these are directly associated with the link itself.</p></div></div></blockquote></div>",
  "_STEP_9_2_4_4_SOURCES_10_": "<p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/link-purpose-in-context.html\"> WCAG 2.1, Link Purpose (In Context): Understanding SC 2.4.4</a></p>",
  "_STEP_9_2_4_4_SOURCES_11_": "<h3 id=\"_grenzen_des_title_attributs_technik_h33_supplementing_link_text_with_the_title_attribute\">Grenzen des <code>title</code>-Attributs (Technik H33: Supplementing link text with the title attribute)</h3>",
  "_STEP_9_2_4_4_SOURCES_12_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><div class=\"openblock\"><div class=\"content\"><p>The <code>title</code> attribute is used to provide additional information to help clarify or further describe the purpose of a link. If the supplementary information provided through the <code>title</code> attribute is something the user should know before following the link, such as a warning, then it should be provided in the link text rather than in the title attribute.</p><p>Because of the extensive user agent limitations in supporting access to the <code>title</code> attribute, authors should use caution in applying this technique. For this reason, it is preferred that the author use technique <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/css/C7.html\"> C7: Using CSS to hide a portion of the link text</a> (CSS) or <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H30.html\"> H30: Providing link text that describes the purpose of a link for anchor elements</a> (HTML).</p></div></div></blockquote></div>",
  "_STEP_9_2_4_4_SOURCES_13_": "<p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H33.html\"> WCAG 2.1 Technik, H33: Supplementing link text with the title attribute</a></p>",
  "_STEP_9_2_4_4_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Abgrenzung zu anderen Prüfschritten</h3>",
  "_STEP_9_2_4_4_CLASSIFICATION_2_": "<p>In diesem Prüfschritt wird nur geprüft, ob die Information über das Dateiformat überhaupt vorhanden ist. Das ist der Fall, wenn das Dateiformat in einer Grafik, im Linktext oder im zugänglichen Namen des Elements angegeben wird.</p>",
  "_STEP_9_2_4_4_CLASSIFICATION_3_": "<p>Bei verlinkten Grafiken ist der Linktext der <code>alt</code>-Text des <code>img</code>-Elements. Die Zugänglichkeit und Aussagekraft des <code>alt</code>-Textes wird jedoch im Prüfschritt 9.1.1.1a \"Alternativtexte für Bedienelemente\" geprüft.</p>",
  "_STEP_9_2_4_4_CLASSIFICATION_4_": "<p>In diesem Prüfschritt wird nur geprüft, ob die Information über das Dateiformat überhaupt vorhanden ist. Das ist der Fall, wenn das Dateiformat in einer Grafik, im Linktext oder im title-Text des Links angegeben wird.</p>",
  "_STEP_9_2_4_4_CLASSIFICATION_5_": "<p>Ist die Grafik, die Auskunft über das Dateiformat gibt, nicht im Link eingebunden (z. B. unverlinkt dem Link vorangestellt), so wird dies in Prüfschritt 11.1.1.1b \"Alternativtexte für Grafiken und Objekte\" geprüft.</p>",
  "_STEP_9_2_4_4_CLASSIFICATION_6_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_2_4_4_CLASSIFICATION_7_": "<h4 id=\"_guideline\">Guideline</h4>",
  "_STEP_9_2_4_4_CLASSIFICATION_8_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#navigable\"> Guideline 2.4 Navigable: Provide ways to help users navigate, find content, and determine where they are</a></p></li></ul>",
  "_STEP_9_2_4_4_CLASSIFICATION_9_": "<h4 id=\"_success_criteria\">Success criteria</h4>",
  "_STEP_9_2_4_4_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#link-purpose-in-context\"> 2.4.4 Link Purpose (In Context)</a> (Level A)</p></li></ul>",
  "_STEP_9_2_4_4_CLASSIFICATION_11_": "<h4 id=\"_techniques\">Techniques</h4>",
  "_STEP_9_2_4_4_CLASSIFICATION_12_": "<h5 id=\"_general_techniques\">General Techniques</h5>",
  "_STEP_9_2_4_4_CLASSIFICATION_13_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G53.html\"> G53: Identifying the purpose of a link using link text combined with the text of the enclosing sentence</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G91.html\"> G91: Providing link text that describes the purpose of a link</a></p></li></ul>",
  "_STEP_9_2_4_4_CLASSIFICATION_14_": "<h5 id=\"_html_techniques\">HTML Techniques</h5>",
  "_STEP_9_2_4_4_CLASSIFICATION_15_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H24.html\"> H24: Providing text alternatives for the area elements of image maps</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H30.html\"> H30: Providing link text that describes the purpose of a link for anchor elements</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H33.html\"> H33: Supplementing link text with the title attribute</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H77.html\"> H77: Identifying the purpose of a link using link text combined with its enclosing list item</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H78.html\"> H78: Identifying the purpose of a link using link text combined with its enclosing paragraph</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H79.html\"> H79: Identifying the purpose of a link using link text combined with its enclosing table cell and associated table headings</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H80.html\"> H80: Identifying the purpose of a link using link text combined with the preceding heading element</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H81.html\"> H81: Identifying the purpose of a link in a nested list using link text combined with the parent list item under which the list is nested</a></p></li></ul>",
  "_STEP_9_2_4_4_CLASSIFICATION_16_": "<h5 id=\"_css_techniques\">CSS Techniques</h5>",
  "_STEP_9_2_4_4_CLASSIFICATION_17_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/css/C7.html\"> C7: Using CSS to hide a portion of the link text (CSS)</a></p></li></ul>",
  "_STEP_9_2_4_4_CLASSIFICATION_18_": "<h5 id=\"_aria_techniques\">ARIA Techniques</h5>",
  "_STEP_9_2_4_4_CLASSIFICATION_19_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA7\"> ARIA7: Using aria-labelledby for link purpose</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA8\"> ARIA8: Using aria-label for link purpose</a></p></li></ul>",
  "_STEP_9_2_4_4_CLASSIFICATION_20_": "<h4 id=\"_failures\">Failures</h4>",
  "_STEP_9_2_4_4_CLASSIFICATION_21_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F63.html\"> F63: Failure of Success Criterion 2.4.4 due to providing link context only in content that is not related to the link</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F89.html\"> F89: Failure of 2.4.4, 2.4.9 and 4.1.2 due to using null alt on an image where the image is the only content in a link</a></p></li></ul>"
}
