{
  "_STEP_9_2_4_4_NAME_": "Информативные тексты ссылок",
  "_STEP_9_2_4_4_NAME_MENU_": "9.2.4.4 Информативные тексты ссылок",
  "_STEP_9_2_4_4_WHAT_CHECKED_1_": "<p>Цель или назначение ссылки должны быть понятны из текста ссылки или из непосредственного контекста ссылки.</p>",
  "_STEP_9_2_4_4_WHAT_CHECKED_2_": "<p>Если ссылки не ведут на HTML-страницы, текст ссылки должен информировать о формате целевого документа.</p>",
  "_STEP_9_2_4_4_WHY_CHECKED_1_": "<p>Слепые пользователи, которые переходят от одной ссылки к другой с помощью клавиатуры, слышат тексты ссылок и могут легко решить, следовать ли по ссылке, если тексты ссылок информативны.</p>",
  "_STEP_9_2_4_4_WHY_CHECKED_2_": "<p>Если текст самой ссылки не является информативным, непосредственный контекст должен быть легко определим для пользователей считывающих устройств.</p>",
  "_STEP_9_2_4_4_WHY_CHECKED_3_": "<p>Считывающие устройства предлагают возможность вывода списка всех ссылок на странице, что позволяет быстро ориентироваться, даже если страница в остальном плохо доступна. Однако эта техника не работает, если все тексты ссылок одинаковы и не дают достаточной информации о цели ссылки.</p>",
  "_STEP_9_2_4_4_WHY_CHECKED_4_": "<p>Для ссылок на ресурсы в форматах, отличных от HTML (например, документы PDF или Word), полезно знать формат информации перед активацией ссылки. Если информация о формате файла визуально доступна (например, через иконку PDF или Word, добавленную с помощью CSS), эта информация также должна быть доступна для слепых пользователей.</p>",
  "_STEP_9_2_4_4_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_9_2_4_4_HOW_CHECKED_2_": "<p>Этап проверки применим, если страница содержит ссылки.</p>",
  "_STEP_9_2_4_4_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_2_4_4_HOW_CHECKED_4_": "<h4 id=\"_2_1_prüfung_von_linktexten\">2.1 Проверка текстов ссылок</h4>",
  "_STEP_9_2_4_4_HOW_CHECKED_5_": "<ol><li><p>Открыть страницу в Firefox.</p></li><li><p>Проверить, информативны ли тексты ссылок, то есть дают ли текст ссылки или контекст информацию о цели или назначении ссылки.</p></li><li><p>Для ссылок, текст которых сам по себе не информативен (например, \"подробнее\" или \"читать далее\"), проверить, дополняется ли текст ссылки одним из следующих способов:</p><ul><li><p>дополнительным текстом ссылки, скрытым через CSS (возможно, нужно в Web Developer Toolbar выбрать опцию <em>CSS &gt; Disable All Styles</em> и проверить затронутые ссылки заново)</p></li><li><p>альтернативным текстом изображения, связанного с тем же элементом <code>a</code> (выбрать опцию <em>Images &gt; Display Alt Attributes</em>)</p></li><li><p>текстом в охватывающем элементе (<code>p</code>, <code>li</code>), элемент <code>div</code> обрабатывается как <code>p</code></p></li><li><p>для ссылок во вложенных списках – текстом элемента <code>li</code> выше уровнем</p></li><li><p>текстом охватывающей ячейки таблицы и соответствующих ячеек заголовков (<code>td</code>, <code>th</code>)</p></li><li><p>текстом предшествующего заголовка (<code>h1</code> - <code>h6</code>)</p></li><li><p>с помощью <code>aria-label</code> или <code>aria-labelledby</code> (внимание: <code>aria-label</code> переопределяет текст ссылки)</p></li><li><p>с помощью понятной ссылки в начале страницы, расширяющей тексты ссылок на странице.</p></li></ul></li></ol>",
  "_STEP_9_2_4_4_HOW_CHECKED_6_": "<h4 id=\"_2_2_prüfung_von_links_auf_andere_dateiformate\">2.2 Проверка ссылок на другие форматы файлов</h4>",
  "_STEP_9_2_4_4_HOW_CHECKED_7_": "<ol><li><p>Открыть страницу в браузере.</p></li><li><p>Проверить, предоставляется ли визуально, например, через дополнительные значки или пользовательские всплывающие подсказки, информация о формате файла.</p></li><li><p>Проверить, предоставляется ли визуальная информация о формате файла также программно (например, через скрытый текст ссылки, альтернативный текст, атрибут <code>title</code> или подходящие атрибуты ARIA).</p></li><li><p>Если информация о формате файла не предоставляется ни через текст ссылки, ни через четко определенный значок, формат файла ссылки может быть неясен для всех пользователей. Это не считается недостатком в рамках этого этапа проверки (хотя это может быть отмечено как общая проблема удобства использования).</p></li></ol>",
  "_STEP_9_2_4_4_HOW_CHECKED_8_": "<h3 id=\"_3_hinweise\">3. Советы</h3>",
  "_STEP_9_2_4_4_HOW_CHECKED_9_": "<ul><li><p>Ссылки, цель которых неясна для всех пользователей, не подпадают под данный этап проверки.</p></li><li><p>Ссылки на URL-адреса и электронные почты передают свое назначение через их формат (например, они открывают почтовый клиент или ведут на внешний веб-ресурс). URL-адреса могут быть неинформативными для всех пользователей, поэтому здесь они не оцениваются отрицательно.</p></li><li><p>Для связанных изображений текст ссылки является значением атрибута <code>alt</code> элемента <code>img</code>. Текст ссылки также может состоять из <code>alt</code>-текста одной или нескольких изображений и простого текста.</p></li><li><p>Невыразительные ссылки, такие как \"еще..\", \"далее\", \"и т.д.\" в последнем элементе <code>li</code> списка принимаются, если значение можно определить из программно доступного контекста. Это может включать охватывающий абзац или пункт списка или предшествующий заголовок.</p></li><li><p>Если дополнительный текст ссылки, сделанный невидимым с помощью <code>display:none</code>, скрыт, он не улучшает информативность ссылки: этот текст игнорируется считывающими устройствами.</p></li><li><p>Атрибут <code>title</code> ссылки потенциально программно доступен, но в некоторых случаях (в зависимости от настроек) считывающие устройства его не обрабатывают.</p></li></ul>",
  "_STEP_9_2_4_4_HOW_CHECKED_10_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_2_4_4_HOW_CHECKED_11_": "<h4 id=\"_erfüllt\">Выполнено</h4>",
  "_STEP_9_2_4_4_HOW_CHECKED_12_": "<ul><li><p>Все ссылки называют в тексте ссылки или в программно доступном контексте цель или назначение ссылки.</p></li><li><p>Все ссылки на не-HTML предложения, которые визуально информируют о формате файла, также предоставляют эту информацию в программно доступной форме.</p></li></ul>",
  "_STEP_9_2_4_4_SOURCES_1_": "<h3 id=\"_zweck_der_kontextunabhängigkeit\">Цель независимости контекста</h3>",
  "_STEP_9_2_4_4_SOURCES_2_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>Assistive technology has the ability to provide users with a list of links that are on the Web page. Link text that is as meaningful as possible will aid users who want to choose from this list of links. Meaningful link text also helps those who wish to tab from link to link. Meaningful links help users choose which links to follow without requiring complicated strategies to understand the page.</p></blockquote></div>",
  "_STEP_9_2_4_4_SOURCES_3_": "<p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/link-purpose-in-context.html\"> WCAG 2.1, Назначение ссылки (в контексте): Понимание SC 2.4.4</a></p>",
  "_STEP_9_2_4_4_SOURCES_4_": "<h3 id=\"_gruppen_zusammengehöriger_links\">Группы связанных ссылок</h3>",
  "_STEP_9_2_4_4_SOURCES_5_": "<p>Для группы связанных ссылок в первой ссылке можно указать цель или назначение, а в последующих ссылках - различающую информацию. WCAG 2.1 приводят следующий пример:</p>",
  "_STEP_9_2_4_4_SOURCES_6_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>A list of books is available in three formats: HTML, PDF, and mp3 (a recording of a person reading the book). To avoid hearing the title of each book three times (once for each format), the first link for each book is the title of the book, the second link says \"PDF\" and the third says, \"mp3.\"</p></blockquote></div>",
  "_STEP_9_2_4_4_SOURCES_7_": "<p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/link-purpose-in-context.html#examples\"> WCAG 2.1, Назначение ссылки (в контексте): Понимание SC 2.4.4: Примеры критерия успеха 2.4.4</a></p>",
  "_STEP_9_2_4_4_SOURCES_8_": "<h3 id=\"_aussagekraft_über_den_kontext\">Информативность через контекст</h3>",
  "_STEP_9_2_4_4_SOURCES_9_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><div class=\"openblock\"><div class=\"content\"><p>Whenever possible, provide link text that identifies the purpose of the link without needing additional context.</p><p>In some situations, authors may want to provide part of the description of the link in logically related text that provides the context for the link. In this case the user should be able to identify the purpose of the link without moving focus from the link. In other words, they can arrive on a link and find out more about it without losing their place. This can be achieved by putting the description of the link in the same sentence, paragraph, list item, the heading immediately preceding the link, or table cell as the link, or in the table header cell for a link in a data table, because these are directly associated with the link itself.</p></div></div></blockquote></div>",
  "_STEP_9_2_4_4_SOURCES_10_": "<p><a href=\"https://www.w3.org/WAI/WCAG21/Understanding/link-purpose-in-context.html\"> WCAG 2.1, Назначение ссылки (в контексте): Понимание SC 2.4.4</a></p>",
  "_STEP_9_2_4_4_SOURCES_11_": "<h3 id=\"_grenzen_des_title_attributs_technik_h33_supplementing_link_text_with_the_title_attribute\">Ограничения атрибута <code>title</code> (Техника H33: Дополнение текста ссылки атрибутом title)</h3>",
  "_STEP_9_2_4_4_SOURCES_12_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><div class=\"openblock\"><div class=\"content\"><p>The <code>title</code> attribute is used to provide additional information to help clarify or further describe the purpose of a link. If the supplementary information provided through the <code>title</code> attribute is something the user should know before following the link, such as a warning, then it should be provided in the link text rather than in the title attribute.</p><p>Because of the extensive user agent limitations in supporting access to the <code>title</code> attribute, authors should use caution in applying this technique. For this reason, it is preferred that the author use technique <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/css/C7.html\"> C7: Using CSS to hide a portion of the link text</a> (CSS) or <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H30.html\"> H30: Providing link text that describes the purpose of a link for anchor elements</a> (HTML).</p></div></div></blockquote></div>",
  "_STEP_9_2_4_4_SOURCES_13_": "<p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H33.html\"> WCAG 2.1 Техника, H33: Дополнение текста ссылки атрибутом title</a></p>",
  "_STEP_9_2_4_4_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Отличие от других этапов проверки</h3>",
  "_STEP_9_2_4_4_CLASSIFICATION_2_": "<p>На этом этапе проверяется наличие информации о формате файла. Это подтверждается, если формат файла указан в графике, тексте ссылки или доступном названии элемента.</p>",
  "_STEP_9_2_4_4_CLASSIFICATION_3_": "<p>Для связанных изображений текст ссылки является <code>alt</code>-текстом элемента <code>img</code>. Доступность и информативность <code>alt</code>-текста проверяется на этапе 9.1.1.1a \"Альтернативные тексты для элементов управления\".</p>",
  "_STEP_9_2_4_4_CLASSIFICATION_4_": "<p>На этом этапе проверяется только наличие информации о формате файла. Это подтверждается, если формат файла указан в графике, тексте ссылки или тексте заголовка ссылки.</p>",
  "_STEP_9_2_4_4_CLASSIFICATION_5_": "<p>Если графика, информирующая о формате файла, не включена в ссылку (например, размещена перед ссылкой без связи), это проверяется на этапе 11.1.1.1b \"Альтернативные тексты для график и объектов\".</p>",
  "_STEP_9_2_4_4_CLASSIFICATION_6_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация этапа проверки по WCAG 2.1</h3>",
  "_STEP_9_2_4_4_CLASSIFICATION_7_": "<h4 id=\"_guideline\">Руководство</h4>",
  "_STEP_9_2_4_4_CLASSIFICATION_8_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#navigable\"> Руководство 2.4 Навигация: Предоставлять способы помощи пользователям в навигации, поиске контента и определении их местоположения</a></p></li></ul>",
  "_STEP_9_2_4_4_CLASSIFICATION_9_": "<h4 id=\"_success_criteria\">Критерии успеха</h4>",
  "_STEP_9_2_4_4_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#link-purpose-in-context\"> 2.4.4 Цель ссылки (в контексте)</a> (Уровень A)</p></li></ul>",
  "_STEP_9_2_4_4_CLASSIFICATION_11_": "<h4 id=\"_techniques\">Техники</h4>",
  "_STEP_9_2_4_4_CLASSIFICATION_12_": "<h5 id=\"_general_techniques\">Общие техники</h5>",
  "_STEP_9_2_4_4_CLASSIFICATION_13_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G53.html\"> G53: Определение цели ссылки с использованием текста ссылки в сочетании с текстом окружающего предложения</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G91.html\"> G91: Предоставление текста ссылки, описывающего цель ссылки</a></p></li></ul>",
  "_STEP_9_2_4_4_CLASSIFICATION_14_": "<h5 id=\"_html_techniques\">HTML-техники</h5>",
  "_STEP_9_2_4_4_CLASSIFICATION_15_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H24.html\"> H24: Предоставление текстовых альтернатив для элементов области изображений-карт</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H30.html\"> H30: Предоставление текста ссылки, описывающего цель ссылки для элементов якоря</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H33.html\"> H33: Дополнение текста ссылки атрибутом title</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H77.html\"> H77: Определение цели ссылки с использованием текста ссылки в сочетании с окружающим ее элементом списка</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H78.html\"> H78: Определение цели ссылки с использованием текста ссылки в сочетании с окружающим абзацем</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H79.html\"> H79: Определение цели ссылки с использованием текста ссылки в сочетании с ячейкой таблицы и связанными заголовками таблицы</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H80.html\"> H80: Определение цели ссылки с использованием текста ссылки в сочетании с предшествующим элементом заголовка</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H81.html\"> H81: Определение цели ссылки во вложенном списке с использованием текста ссылки в сочетании с родительским элементом списка, под которым список вложен</a></p></li></ul>",
  "_STEP_9_2_4_4_CLASSIFICATION_16_": "<h5 id=\"_css_techniques\">Техники CSS</h5>",
  "_STEP_9_2_4_4_CLASSIFICATION_17_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/css/C7.html\"> C7: Использование CSS для скрытия части текста ссылки (CSS)</a></p></li></ul>",
  "_STEP_9_2_4_4_CLASSIFICATION_18_": "<h5 id=\"_aria_techniques\">Техники ARIA</h5>",
  "_STEP_9_2_4_4_CLASSIFICATION_19_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA7\"> ARIA7: Использование aria-labelledby для определения цели ссылки</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA8\"> ARIA8: Использование aria-label для определения цели ссылки</a></p></li></ul>",
  "_STEP_9_2_4_4_CLASSIFICATION_20_": "<h4 id=\"_failures\">Неудачи</h4>",
  "_STEP_9_2_4_4_CLASSIFICATION_21_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F63.html\"> F63: Неудача критерия успеха 2.4.4 из-за предоставления контекста ссылки только в содержимом, не связанном с ссылкой</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F89.html\"> F89: Неудача 2.4.4, 2.4.9 и 4.1.2 из-за использования пустого alt в изображении, где изображение является единственным содержимым ссылки</a></p></li></ul>"
}