{
  "_STEP_9_1_1_1B_NAME_": "Alternativtexte für Grafiken und Objekte",
  "_STEP_9_1_1_1B_NAME_MENU_": "9.1.1.1b Alternativtexte für Grafiken und Objekte",
  "_STEP_9_1_1_1B_WHAT_CHECKED_1_": "<p>Nicht verlinkte informationsorientierte Grafiken und Bilder müssen mit Alternativtexten versehen werden (verlinkte Grafiken werden in Prüfschritt 9.1.1.1a \"Alternativtexte für Bedienelemente\" geprüft). Die Alternativtexte ersetzen das Bild, sie sollen also (wenn möglich) dieselbe Aufgabe erfüllen wie das Bild.</p>",
  "_STEP_9_1_1_1B_WHAT_CHECKED_2_": "<p>Bei eingebundenen Multimedia-Objekten, Video- beziehungsweise Audio-Dateien oder Applets soll der Alternativtext zumindest eine beschreibende Identifizierung des Inhalts ermöglichen.</p>",
  "_STEP_9_1_1_1B_WHAT_CHECKED_3_": "<p>Thema dieses Prüfschritts sind auch Textalternativen für Hintergrundbilder, Icon Fonts und SVGs, sofern diese nicht verlinkt sind.</p>",
  "_STEP_9_1_1_1B_WHY_CHECKED_1_": "<p>Für blinde Benutzer oder für Benutzer von einfachen Textbrowsern sind Grafiken und Bilder nicht zugänglich. Die Textalternative tritt dann an die Stelle der Grafik, sie soll die Grafik ersetzen.</p>",
  "_STEP_9_1_1_1B_WHY_CHECKED_2_": "<p>Wenn Objekte (etwa Video-Dateien, Audio-Dateien oder Applets) nicht angezeigt werden können, sollen kurze beschreibende Alternativtexte dem Nutzer eine Identifikation der Inhalte ermöglichen.</p>",
  "_STEP_9_1_1_1B_WHY_CHECKED_3_": "<p>Icon Fonts sind Schriftarten, die Symbole statt Buchstaben beinhalten. Sie werden per CSS eingebunden und werden entweder von assistiven Technologien nicht ausgegeben oder es wird ein Unicode-Äquivalent wiedergegeben, was die Bedeutung im Kontext nicht vermittelt.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Anwendbarkeit des Prüfschritts</h3>",
  "_STEP_9_1_1_1B_HOW_CHECKED_2_": "<p>Der Prüfschritt ist anwendbar, wenn unverlinkte informative Grafiken oder Bilder, Video- oder Audio-Dateien, oder Multimedia-Objekte vorhanden sind.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_3_": "<p>Als informative Grafiken gelten:</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_4_": "<ul><li><p>grafische Schriften</p></li><li><p>Symbole</p></li><li><p>Abbildungen, die zeigen sollen, wie ein Objekt oder eine Person aussieht</p></li><li><p>Illustrationen, die eine Aussage vorstellen, verdeutlichen oder veranschaulichen sollen</p></li></ul>",
  "_STEP_9_1_1_1B_HOW_CHECKED_5_": "<p>Dekorative Grafiken und Bilder sind Grenzfälle. Sie stellen (im Unterschied zu Layoutgrafiken) etwas dar, der dargestellte Gegenstand hat auch meist einen Bezug zum Thema der Seite. Ihr Informationsgehalt und ihr Nutzen für das Verständnis der Seite ist aber nicht klar. Dekorative Grafiken können daher mit leerem <code>alt</code>-Attribut versehen werden, der Prüfschritt ist dann nicht anwendbar. Anders, wenn Alternativtexte vorhanden sind. Dann ist der Prüfschritt anwendbar, er ist zum Beispiel nicht erfüllt, wenn im <code>alt</code>-Attribut von dekorativen Grafiken Bilddateinamen eingetragen sind.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_6_": "<p>Logo-artige Elemente in denen Grafik und Schrift verbunden sind, sind fast nie als bloße Schmuckgrafik anzusehen und brauchen deshalb Alternativtext. Wenn sie verlinkt ist, ist das natürlich ohnehin so. Dies ermöglicht blinden und sehenden Nutzern, sich gemeinsam auf diese Elemente zu beziehen. Der Alternativtext muss aber nicht expliziter sein als das, was für den sehenden Nutzer erkenntlich ist.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_7_": "<p>Darüber hinaus ist der Prüfschritt anwendbar, wenn informative Audio-Elemente vorhanden sind.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_8_": "<h3 id=\"_2_prüfung\">2. Prüfung</h3>",
  "_STEP_9_1_1_1B_HOW_CHECKED_9_": "<h4 id=\"_2_1_anzeige_der_alternativtexte_von_grafiken\">2.1 Anzeige der Alternativtexte von Grafiken</h4>",
  "_STEP_9_1_1_1B_HOW_CHECKED_10_": "<p>In der <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#webdeveloper\">   Web Developer Toolbar</a> das Menü <em>Images &gt; Display Alt Attributes</em> aufrufen und prüfen, ob das <code>alt</code>-Attribut vorhanden ist und der dort hinterlegte Alternativtext das Bild in angemessener Weise ersetzt (siehe <a href=\"#2.6 Angemessene Alternativtexte\">[2.6 Angemessene Alternativtexte]</a>). Alternativ kann auch das <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#imagesbm\"> Images bookmarklet</a> eingesetzt werden.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_11_": "<h4 id=\"_2_2_anzeige_der_alternativtexte_von_objekten\">2.2 Anzeige der Alternativtexte von Objekten</h4>",
  "_STEP_9_1_1_1B_HOW_CHECKED_12_": "<ol><li><p>Prüfen, ob die Seite Objekte enthält.   Dazu kann folgende Methode genutzt werden:   In der <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#webdeveloper\">   Web Developer Toolbar</a> <em>CSS &gt; Disable All Styles</em> und <em>Images &gt;   Hide Images</em> wählen. Werden jetzt noch Elemente angezeigt, bei denen es sich offensichtlich nicht um   einfachen Text handelt?</p></li><li><p>Im Quelltext prüfen, ob eine Alternative vorhanden ist, die das Objekt in angemessener Weise ersetzt (siehe <a href=\"#2.6 Angemessene Alternativtexte\">[2.6 Angemessene Alternativtexte]</a>).</p></li><li><p>Falls es sich bei der Alternative für das Objekt um ein <code>img</code>-Element handelt: Den Alternativtext des Bildes wie unter <a href=\"#2.6 Angemessene Alternativtexte\">[2.6 Angemessene Alternativtexte]</a> beschrieben prüfen.</p></li></ol>",
  "_STEP_9_1_1_1B_HOW_CHECKED_13_": "<h4 id=\"_2_3_textalternativen_für_hintergrundgrafiken\">2.3 Textalternativen für Hintergrundgrafiken</h4>",
  "_STEP_9_1_1_1B_HOW_CHECKED_14_": "<p>(entspricht dem Abschnitt 2.3 des Verfahrens von Prüfschritt 9.1.1.1a \"Alternativtexte für Bedienelemente\")</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_15_": "<p>Hintergrundgrafiken haben kein <code>alt</code>-Attribut, auf diese Weise kann also keine Textalternative hinterlegt werden.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_16_": "<p>Falls eine Hintergrundgrafik aber einen im HTML-Dokument tatsächlich vorhandenen Text, zum Beispiel eine Überschrift ersetzt (CSS-Bildersetzungsverfahren), gilt dieser Text als Textalternative für die Hintergrundgrafik. Voraussetzung ist allerdings, dass ein geeignetes Verfahren verwendet wurde (nicht <code>display:none</code>).</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_17_": "<h5 id=\"_grundeinstellung_in_firefox\">Grundeinstellung in Firefox</h5>",
  "_STEP_9_1_1_1B_HOW_CHECKED_18_": "<ol><li><p><a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\"> Firefox</a> aufrufen und im Menü <em>Extras &gt; Einstellungen &gt; Allgemein &gt; Schriftarten &amp; Farben</em> wählen.</p></li><li><p>Im Bereich \"Text und Hintergrund\" als Hintergrundfarbe eine Farbe wählen, die normalerweise eher selten für die Seitengestaltung verwendet wird (gut geeignet sind zum Beispiel helle Rosa- oder Grüntöne).</p></li><li><p>Im Select <em>Ausgewählte Farben anstatt Farben der Seite verwenden</em> die Option <em>Immer</em> wählen.</p></li><li><p>Die Dialogfenster mit \"OK\" schließen.</p></li></ol>",
  "_STEP_9_1_1_1B_HOW_CHECKED_19_": "<h5 id=\"_prüfung\">Prüfung</h5>",
  "_STEP_9_1_1_1B_HOW_CHECKED_20_": "<ol><li><p>Seite in <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\"> Firefox</a> aufrufen.</p></li><li><p>Prüfen, ob informative Grafiken oder Bilder verschwinden. Das passiert, wenn sie als Hintergrundbilder eingebunden sind.</p></li><li><p>Falls informative Grafiken oder Bilder als Hintergrundbilder eingebunden sind: Prüfen, ob das Hintergrundbild einen tatsächlich im HTML-Dokument vorhandenen Text ersetzt. Falls nicht, ist dies wie ein fehlendes <code>alt</code>-Attribut zu werten.</p></li><li><p>Falls Texte durch Hintergrundbilder ersetzt werden: Prüfen, welches Verfahren für die Bildersetzung verwendet wurde. Wenn <code>display:none</code> verwendet wird, ist dies wie ein fehlendes <code>alt</code>-Attribut zu werten.</p></li><li><p>Falls ein geeignetes Bildersetzungsverfahren verwendet wurde: Prüfen, ob der Text eine äquivalente Textalternative für das Hintergrundbild darstellt (siehe <a href=\"#2.6 Angemessene Alternativtexte\">[2.6 Angemessene Alternativtexte]</a>).</p></li></ol>",
  "_STEP_9_1_1_1B_HOW_CHECKED_21_": "<h4 id=\"_2_4_textalternativen_für_icon_fonts\">2.4 Textalternativen für Icon Fonts:</h4>",
  "_STEP_9_1_1_1B_HOW_CHECKED_22_": "<p>Beim Einsatz von Icon Fonts ist es nicht möglich, mittels <code>alt</code>-Attribut eine Textalternative zu hinterlegen.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_23_": "<p>Handelt es sich dabei um ein informationstragendes Icon ohne visuell sichtbaren Text (Stand-alone-Icon), sollte eine Textalternative vorhanden sein. Dies kann beispielsweise Text sein, der mit einem geeigneten Verfahren versteckt ist (nicht <code>display:none</code>) oder der über ein <code>aria-label</code> bereitgestellt wird. Es ist sinnvoll, das Icon selbst mit einer geeigneten Technik für Screenreader zu verstecken (z. B. <code>aria-hidden=\"true\"</code>).</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_24_": "<h5 id=\"_prüfung_2\">Prüfung</h5>",
  "_STEP_9_1_1_1B_HOW_CHECKED_25_": "<ol><li><p>Seite in <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\"> Firefox</a> aufrufen.</p></li><li><p>Mit den Web Developer Tools des Browsers prüfen, ob mit der CSS-Eigenschaft <code>content</code> für die Pseudoelemente <code>:before</code> oder <code>:after</code> Inhalt (Font Icons) eingebunden wird.</p></li><li><p>Prüfen, ob das Icon mit einer geeigneten Technik für Screenreader versteckt wird (z. B. <code>aria-hidden=\"true\"</code>).</p></li><li><p>Für informationstragende Icons prüfen, ob eine HTML-Textalternative vorhanden ist, die per CSS unsichtbar gemacht wird.</p></li><li><p>Falls HTML-Textalternativen vorhanden sind, die nicht am Bildschirm sichtbar sind: Prüfen, welches Verfahren verwendet wurde, um diese zu verstecken. Wenn <code>display:none</code> verwendet wird, ist dies wie ein nicht vorhandenes oder leeres <code>alt</code>-Attribut zu werten.</p></li><li><p>Falls eine geeignete CSS-Technik verwendet wurde: Prüfen, ob der Textlink eine äquivalente Textalternative für das Icon darstellt (siehe <a href=\"#2.6 Angemessene Alternativtexte\">[2.6 Angemessene Alternativtexte]</a>).</p></li><li><p>Falls kein Alternativtext über zugänglich versteckten oder mitverlinkten Text vorhanden ist, prüfen, ob die Textalternative über ein <code>title</code>-Attribut oder <code>aria-label</code> bereitgestellt wird.</p></li><li><p>Falls für diese Icons Text ausgegeben wird (z. B. <code>content: \"k\"</code>), prüfen, ob das Icon mit einer geeigneten Technik für Screenreader versteckt wird (z.B. <code>aria-hidden=\"true\"</code>).</p></li></ol>",
  "_STEP_9_1_1_1B_HOW_CHECKED_26_": "<h4 id=\"_2_5_textalternativen_für_inline_svgs\">2.5 Textalternativen für Inline SVGs</h4>",
  "_STEP_9_1_1_1B_HOW_CHECKED_27_": "<h5 id=\"_prüfung_3\">Prüfung</h5>",
  "_STEP_9_1_1_1B_HOW_CHECKED_28_": "<ol><li><p>Seite in <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\"> Firefox</a> aufrufen.</p></li><li><p>Mit den Web Developer Tools des Browsers prüfen, ob es sich um eine direkt in HTML eingebundene SVG handelt (Inline SVG).</p></li><li><p>Prüfen, ob ein <code>title</code>-Element (bei längeren Beschreibungen ein <code>desc</code>-Element) vorhanden ist und die dort hinterlegte Textalternative das Bild in angemessener Weise ersetzt (siehe <a href=\"#2.6 Angemessene Alternativtexte\">[2.6 Angemessene Alternativtexte]</a>). Das <code>title-</code> bzw. `desc-`Element sollte das erste Kindelement des Elternelements sein.</p></li><li><p>Da SVG noch nicht ausreichend in allen Screenreader-Browser-Kombinationen unterstützt werden, prüfen, ob die Zugänglichkeit über WAI ARIA gewährleistet ist:</p><ul><li><p>SVG-Grafiken sollten <code>role=\"img\"</code> tragen, sonst wird ggf. ihr <code>title</code>-Element nicht ausgegeben.</p></li><li><p>Wird das SVG <code>title</code>-Element als zugänglicher Name genutzt, sollte das <code>svg</code>-Element mittels <code>aria-labelledby</code> auf das <code>title</code>-Element verweisen.</p></li><li><p>Wenn kein <code>title</code>- oder <code>desc</code>-Element eingesetzt wird, prüfen, ob über <code>aria-label</code> auf dem umschließenden Link eine Textalternative bereitgestellt wird.</p></li></ul></li></ol>",
  "_STEP_9_1_1_1B_HOW_CHECKED_29_": "<p>Als Rolle für SVGs kommt auch <code>role=\"graphics-document\"</code> für in sich gegliederte, komplexere SVG-Grafiken in Frage (das Ausmaß der Unterstützung durch Screenreader ist zur Zeit unklar).</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_30_": "<h4 id=\"_2_6_textalternativen_für_videos\">2.6 Textalternativen für Videos</h4>",
  "_STEP_9_1_1_1B_HOW_CHECKED_31_": "<ol><li><p>Seite in <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\"> Firefox</a> aufrufen.</p></li><li><p>Mit den Web Developer Tools des Browsers prüfen, ob das Video im  HTML-Code über ein <code>video</code>-Element oder über ein <code>iframe</code>-Element eingebunden wurde.</p></li><li><p>Bei Nutzung des Video-Elements kann die Textaltenative mittels der ARIA Attribute <code>aria-label</code> oder <code>aria-labelledby</code> angegeben werden, falls auch das <code>controls</code>-Attribut vorhanden ist. Wird das Video innerhalb eines <code>figure</code>-Elements eingebunden, kann auch ein <code>figcaption</code>-Element genutzt werden.</p></li><li><p>Bei einer Einbindung über <code>iframe</code> (z.B. von Youtube-Videos) erfolgt die Angabe einer Textalternative mittels <code>title</code>-Attribut.</p></li></ol>",
  "_STEP_9_1_1_1B_HOW_CHECKED_32_": "<h4 id=\"_2_7_angemessene_alternativtexte\">2.7 Angemessene Alternativtexte</h4>",
  "_STEP_9_1_1_1B_HOW_CHECKED_33_": "<p>Entscheidend ist: Die Seite soll benutzbar sein, wenn Grafiken oder Bilder durch die entsprechenden Alternativtexte oder andere geeignete Textalternativen ersetzt sind.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_34_": "<p>In der Regel bedeutet das:</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_35_": "<ul><li><p>Bei <strong>Schriftgrafiken</strong> soll der Alternativtext den Text der Schriftgrafik wiederholen.</p></li><li><p>Bei <strong>Symbolen</strong> oder <strong>Zeichen</strong> (Logos) soll der Alternativtext sagen, dass ein Symbol, Zeichen oder Logo abgebildet ist und die Bedeutung des Symbols oder Zeichens wiedergeben.</p></li><li><p>Bei <strong>Gruppen von zusammengehörigen Bildern</strong> kann auch eines der Bilder die Bedeutung der Gruppe wiedergeben, die anderen haben ein leeres <code>alt</code>-Attribut.</p></li><li><p>Bei <strong>Fotos</strong>, Reproduktionen von Gemälden oder anderen Nicht-Text-Elementen, die eine spezifische Sinneserfahrung vermitteln, genügt in der Regel eine knappe Bezeichnung des abgebildeten Gegenstandes.</p></li><li><p>Bei <strong>Diagrammen</strong> oder <strong>technischen Zeichnungen</strong> sind unter Umständen ausführlichere Erläuterungen erforderlich. Alternativtexte sind dafür nicht geeignet, sie sollen 80 Zeichen nicht überschreiten. Im Alternativtext steht dann nur, was dargestellt ist und wo (etwa: \"Details im anschließenden Text\"), die Erläuterung steht in Kontext des Bildes.</p></li><li><p>Bei <strong>Objekten</strong>, die nicht angezeigt werden können, sollen der Alternativtext (ganz gleich ob Fallback-Text des Objekts oder skriptgeneriert) oder Text im unmittelbaren Kontext des Objekts (etwa eine vorangehende Überschrift oder nachfolgende Legende) eine kurze Beschreibung oder Identifizierung bieten und, falls vorhanden, auf eine Medienalternative verweisen. Zusätzlich ist es sinnvoll, dass ein Skript auswertet, ob das Objekt wegen deaktiviertem JavaScript und/oder deaktiviertem Plugin nicht angezeigt werden kann, und eine entsprechende Meldung generiert. Wenn solche Meldungen erzeugt werden, müssen sie den tatsächlichen Browser-Einstellungen entsprechen. Wenn also etwa das Flash-Plugin ausgeschaltet ist, aber JavaScript an, darf nicht die (irreführende) Meldung kommen, dass JavaScript aktiviert werden muss.</p></li></ul>",
  "_STEP_9_1_1_1B_HOW_CHECKED_36_": "<p>Generell gilt: Alternativtexte sollen kurz sein. Ausführliche Beschreibungen von Abbildungen sollen nicht im Alternativtext, sondern im Kontext der Abbildung zur Verfügung gestellt werden (siehe <a href=\"#_2_5_textalternativen_für_inline_svgs\">2.5 Textalternativen für Inline SVGs</a>).</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_37_": "<h4 id=\"_2_6_angemessenheit_von_textalternativen_im_kontext\">2.6 Angemessenheit von Textalternativen im Kontext</h4>",
  "_STEP_9_1_1_1B_HOW_CHECKED_38_": "<p>Wenn der Alternativtext kein angemessener Ersatz für die Grafik oder das Bild sein kann, muss geprüft werden, ob die über das Bild vermittelte Information im Kontext als Text zur Verfügung steht.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_39_": "<p>Das betrifft zum Beispiel</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_40_": "<ul><li><p>Diagramme</p></li><li><p>technische Zeichnungen</p></li><li><p>Anfahrtspläne</p></li><li><p>Videos</p></li></ul>",
  "_STEP_9_1_1_1B_HOW_CHECKED_41_": "<p>Zum Kontext einer Grafik oder eines Bildes gehört:</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_42_": "<ul><li><p>der dazugehörige (vorangehende, folgende) Text sowie</p></li><li><p>eine im unmittelbaren Kontext des Bildes angebotene verlinkte und klar benannte Textalternative (normaler Link und/oder <code>longdesc</code>).</p></li></ul>",
  "_STEP_9_1_1_1B_HOW_CHECKED_43_": "<p>Ein kurzer Alternativtext mit Bezeichnung des Bildes ist auch bei Nutzung von Textalternativen im Kontext erforderlich. Der Alternativtext sagt, dass an dieser Stelle etwas Bestimmtes abgebildet ist, er macht klar, worauf sich die Erläuterung im Kontext bezieht.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_44_": "<p>Zum Kontext eines Videos gehört:</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_45_": "<ul><li><p>der dazugehörige (vorangehende, folgende) Text oder die Überschrift</p></li><li><p>entsprechend beschriftete Schaltfläche, z.B. <code>aria-label=\"Video [Titel des Videos] abspielen\"</code></p></li></ul>",
  "_STEP_9_1_1_1B_HOW_CHECKED_46_": "<h3 id=\"_3_hinweise\">3. Hinweise</h3>",
  "_STEP_9_1_1_1B_HOW_CHECKED_47_": "<p>Um die Angemessenheit des Alternativtextes einschätzen zu können, muss der Alternativtext auf die Grafik beziehungsweise das Objekt bezogen werden, zu dem er gehört. Erforderlich ist also die parallele oder wechselnde Darstellung von Grafik/Objekt und zugehörigem Alternativtext.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_48_": "<p>Da SVG noch nicht ausreichend in allen Screenreader-Browser-Kombinationen unterstützt werden, sollte derzeit die Rolle über WAI-ARIA vermittelt werden (siehe Prüfschritt 9.4.1.2 Name, Rolle, Wert verfügbar).</p>",
  "_STEP_9_1_1_1B_SOURCES_1_": "<h3 id=\"_anleitungen_zm_erstellen_von_alternativtexten\">Anleitungen zm Erstellen von Alternativtexten</h3>",
  "_STEP_9_1_1_1B_SOURCES_2_": "<ul><li><p>W3C Web Accessibility Tutorials: <a href=\"https://www.w3.org/WAI/tutorials/images/\"> Images Concepts</a></p></li><li><p>WebAIM: <a href=\"https://webaim.org/techniques/alttext/\">Alternative Text</a></p></li><li><p>HTML 5.1 Spezifikation: <a href=\"https://www.w3.org/TR/html51/semantics-embedded-content.html#alt-text\"> Requirements for providing text to act as an alternative for images</a></p></li></ul>",
  "_STEP_9_1_1_1B_SOURCES_3_": "<h3 id=\"_w3c_scalable_vector_graphics_svg_1_1\">W3C - Scalable Vector Graphics (SVG) 1.1</h3>",
  "_STEP_9_1_1_1B_SOURCES_4_": "<ul><li><p><a href=\"https://www.w3.org/TR/SVG11/struct.html#DescriptionAndTitleElements\"> The 'desc' and the 'title' elements</a></p></li><li><p>Zu Rollen wie <code>role=\"graphics-document\"</code> für komplexere SVG-Grafiken: <a href=\"https://www.w3.org/TR/graphics-aria-1.0/\"> WAI-ARIA Graphics Module</a> (W3C Recommendation 02 October 2018)</p></li></ul>",
  "_STEP_9_1_1_1B_SOURCES_5_": "<h3 id=\"_svgs_zugänglich_einbinden\">SVGs zugänglich einbinden</h3>",
  "_STEP_9_1_1_1B_SOURCES_6_": "<ul><li><p><a href=\"https://www.scottohara.me/blog/2019/05/22/contextual-images-svgs-and-a11y.html\"> Contextually marking up accessible images and SVGs</a> (Scott O’Hara, May 2019)</p></li><li><p><a href=\"https://www.deque.com/blog/creating-accessible-svgs/\"> Creating accessible SVGs</a> (Deque blog, January 2019)</p></li><li><p><a href=\"https://simplyaccessible.com/article/7-solutions-svgs/\"> 7 solutions for creating more accessible SVGs</a> (Simply Accessible, March 2017)</p></li><li><p><a href=\"https://css-tricks.com/accessible-svgs/\"> Accessible SVGs</a> (CSS-Tricks, updated August 2016)</p></li></ul>",
  "_STEP_9_1_1_1B_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Abgrenzung zu anderen Prüfschritten</h3>",
  "_STEP_9_1_1_1B_CLASSIFICATION_2_": "<ul><li><p>Alternativtexte für verlinkte Grafiken (z. B. Bedienelemente oder   Teaser-Bilder) werden in Prüfschritt 9.1.1.1a \"Alternativtexte für Bedienelemente\"   geprüft.</p></li><li><p>Einfache Animationen oder Videos <em>ohne synchronisierungsbedürftige Tonspur</em>   werden in Prüfschritt 9.1.2.1 \"Alternativen für Audiodateien und stumme Videos\"   geprüft.</p></li><li><p>Layoutgrafiken oder dekorative Grafiken mit leeren <code>alt</code>-Attributen werden   in Prüfschritt 9.1.1.1c \"Leere alt-Attribute für Layoutgrafiken\"   geprüft.</p></li><li><p>CAPTCHAs werden in Prüfschritt 9.1.1.1d \"Alternativen für CAPTCHAs\"   geprüft.</p></li><li><p>Die Ausgabe der entsprechenden Rolle von SVGs wird im Prüfschritt 9.4.1.2 \"Name, Rolle, Wert verfügbar\"   geprüft (s. o. <a href=\"#_3_hinweise\">3. Hinweise</a>).</p></li></ul>",
  "_STEP_9_1_1_1B_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Einordnung des Prüfschritts nach WCAG 2.1</h3>",
  "_STEP_9_1_1_1B_CLASSIFICATION_4_": "<h4 id=\"_guideline\">Guideline</h4>",
  "_STEP_9_1_1_1B_CLASSIFICATION_5_": "<ul><li><p><a href=\"http://www.w3.org/TR/WCAG21/#text-alternatives\"> Guideline 1.1 Text Alternatives: Provide text alternatives for any non-text content so that it can be changed into other forms people need, such as large print, braille, speech, symbols or simpler language</a></p></li></ul>",
  "_STEP_9_1_1_1B_CLASSIFICATION_6_": "<h4 id=\"_success_criterion\">Success criterion</h4>",
  "_STEP_9_1_1_1B_CLASSIFICATION_7_": "<ul><li><p><a href=\"http://www.w3.org/TR/WCAG21/#x1-1-1-non-text-content\"> 1.1.1 Non-text Content</a> (Level A)</p></li></ul>",
  "_STEP_9_1_1_1B_CLASSIFICATION_8_": "<h4 id=\"_techniques\">Techniques</h4>",
  "_STEP_9_1_1_1B_CLASSIFICATION_9_": "<h5 id=\"_general_techniques\">General Techniques</h5>",
  "_STEP_9_1_1_1B_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G73\"> G73: Providing a long description in another location with a link to it that is immediately adjacent to the non-text content</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G74\"> G74: Providing a long description in text near the non-text content, with a reference to the location of the long description in the short description</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G82\"> G82: Providing a text alternative that identifies the purpose of the non-text content</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G92\"> G92: Providing long description for non-text content that serves the same purpose and presents the same information</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G94\"> G94: Providing short text alternative for non-text content that serves the same purpose and presents the same information as the non-text content</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G95\"> G95: Providing short text alternatives that provide a brief description of the non-text content</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G100\"> G100: Providing the accepted name or a descriptive name of the non-text content</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G196\"> G196: Using a text alternative on one item within a group of images that describes all items in the group</a></p></li></ul>",
  "_STEP_9_1_1_1B_CLASSIFICATION_11_": "<h5 id=\"_html_techniques\">HTML Techniques</h5>",
  "_STEP_9_1_1_1B_CLASSIFICATION_12_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H37\"> H37: Using <code>alt</code> attributes on <code>img</code> elements</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H45\"> H45: Using <code>longdesc</code></a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H46\"> H46: Using <code>noembed</code> with <code>embed</code></a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H53\"> H53: Using the body of the <code>object</code> element</a></p></li></ul>",
  "_STEP_9_1_1_1B_CLASSIFICATION_13_": "<h5 id=\"_aria_techniques\">ARIA Techniques</h5>",
  "_STEP_9_1_1_1B_CLASSIFICATION_14_": "<ul><li><p>ARIA6 Using <code>aria-label</code> to provide labels for objects</p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA10\"> ARIA10: Using <code>aria-labelledby</code> to provide a text alternative for non-text content</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA15\"> ARIA15: Using aria-describedby to provide descriptions of images</a></p></li></ul>",
  "_STEP_9_1_1_1B_CLASSIFICATION_15_": "<h5 id=\"_failures\">Failures</h5>",
  "_STEP_9_1_1_1B_CLASSIFICATION_16_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F3\"> F3: Failure of Success Criterion 1.1.1 due to using CSS to include images that convey important information</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F20\"> F20: Failure of Success Criterion 1.1.1 and 4.1.2 due to not updating text alternatives when changes to non-text content occur</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F30\"> F30: Failure of Success Criterion 1.1.1 and 1.2.1 due to using text alternatives that are not alternatives</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F65\"> F65: Failure of Success Criterion 1.1.1 due to omitting the <code>alt</code> attribute on <code>img</code> elements, <code>area</code> elements, and <code>input</code> elements of type 'image'</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F67\"> F67: Failure of Success Criterion 1.1.1 and 1.2.1 due to providing long description for non-text content that does not serve the same purpose or does not present the same information</a></p></li></ul>",
  "_STEP_9_1_1_1B_QUESTIONS_1_": "<h3 id=\"_was_kann_der_alternativtext_leisten\">Was kann der Alternativtext leisten?</h3>",
  "_STEP_9_1_1_1B_QUESTIONS_2_": "<p>Zum Beispiel die Explosionszeichnung eines Motors: Sollte der gesamte Aufbau des Motors im Alternativtext beschrieben werden?</p>",
  "_STEP_9_1_1_1B_QUESTIONS_3_": "<p>Die Explosionszeichnung zeigt die Lage verschiedener Teile im Motor. Alternative Vermittlungsformen sind denkbar und möglich. Zum Beispiel könnte die Lage der Teile an einem tastbaren Modell gezeigt werden. Klar ist aber, dass bei einigermaßen komplexen Gebilden die Textform nicht geeignet ist. Die Frage ist daher, was im Alternativtext sinnvoll vermittelt werden kann. Auf jeden Fall kann der Alternativtext darüber informieren, dass eine Explosionszeichnung des Motors dargestellt wird. Der blinde Benutzer weiß dann zumindest, welche Informationen ihm nicht zugänglich sind. Darüber hinaus kann es sein, dass nur ein bestimmtes Detail der gesamten Zeichnung relevant ist. Das geht aus dem Kontext hervor. Das betreffende Detail kann dann in Textform erläutert werden.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_4_": "<p>Für die Bewertung im BITV-Test gilt: wenn der Prüfer selbst nicht sagen kann, ob oder wie der Informationsgehalt des Bildes in Textform vermittelt werden könnte, muss die Bezeichnung des dargestellten Gegenstandes im Alternativtext als hinreichend bewertet werden.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_5_": "<h3 id=\"_firmenlogos\">Firmenlogos</h3>",
  "_STEP_9_1_1_1B_QUESTIONS_6_": "<p>Auf der Website ist das Firmenlogo abgebildet. Reicht es aus, wenn im Alternativtext steht, dass da das Firmenlogo abgebildet ist oder sollte es auch beschrieben werden?</p>",
  "_STEP_9_1_1_1B_QUESTIONS_7_": "<p>Auch für einen blinden Besucher kann das Aussehen des Logos interessant sein. Er unterhält sich mit Sehenden und weiß dann, wovon die Rede ist. Allerdings sollte der Alternativtext kurz sein, der Besucher möchte nicht immer wieder diese Beschreibung hören, wenn er die Seite besucht. Sie kann also in einer separaten, ausführlichen Beschreibung bereitgestellt werden.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_8_": "<p>Im BITV-Test wird eine solche ausführliche Beschreibung des Firmenlogos allerdings nicht gefordert.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_9_": "<h3 id=\"_abbildungen_mit_text\">Abbildungen mit Text</h3>",
  "_STEP_9_1_1_1B_QUESTIONS_10_": "<p>Eine Abbildung enthält Text. Muss dieser Text in jedem Fall im Alternativtext bereitgestellt werden?</p>",
  "_STEP_9_1_1_1B_QUESTIONS_11_": "<p>Nein, entscheidend ist die Funktion der Abbildung. Wenn es sich um eine Schriftgrafik handelt, dann ist die Sache meistens klar, die Abbildung ist für die Anzeige des Textes da.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_12_": "<p>Anders verhält es sich, wenn ein Motiv mit Text abgebildet ist. Dann muss (wie bei allen Bildern) überlegt werden, was die Leistung des Bildes ist, ob der abgebildete Text wesentlich ist. Nur dann muss der Text im Alternativtext beachtet werden.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_13_": "<h3 id=\"_kann_für_längere_erläuterungen_auch_das_title_attribut_verwendet_werden\">Kann für längere Erläuterungen auch das <code>title</code>-Attribut verwendet werden?</h3>",
  "_STEP_9_1_1_1B_QUESTIONS_14_": "<p>Das <code>title</code>-Attribut hat eine andere Aufgabe, es soll nicht für das Bild stehen, sondern ergänzende Informationen zum Bild liefern. Zum Beispiel kann es verwendet werden, um die Quelle eines Bildes anzugeben. Die Verwendung des <code>title</code>-Attributs von Bildern ist leider nicht einheitlich geregelt.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_15_": "<p>Auf manchen Webauftritten wird der Inhalt des <code>alt</code>-Attributs durchgängig zusätzlich im <code>title</code>-Attribut wiederholt. Das ist keine gute Lösung, denn es führt dazu, daß blinde Nutzer die Ausgabe des <code>title</code>-Attributs abschalten, um das Vorlesen überflüssiger Informationen zu vermeiden.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_16_": "<p>Auf keinen Fall kann das <code>title</code>-Attribut als Ersatz für die Bereitstellung des Alternativtextes im <code>alt</code>-Attribut akzeptiert werden.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_17_": "<p>Für längere Erläuterungen ist das <code>title</code>-Attribut nicht vorgesehen und auch nicht gut geeignet. Es enthält nur einfachen Fließtext, Änderungen der Schriftgröße haben bei den meisten Browsern keine Auswirkungen auf die Darstellung des <code>title</code>-Attributs.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_18_": "<h3 id=\"_rolle_im_alternativtext\">Rolle im Alternativtext</h3>",
  "_STEP_9_1_1_1B_QUESTIONS_19_": "<p>Soll im Alternativtext stehen, dass es sich um ein grafisches Element handelt?</p>",
  "_STEP_9_1_1_1B_QUESTIONS_20_": "<p>Nein, das ist nicht erforderlich. Denn Screenreader stellen anhand des Markups fest, auf was für ein Element sich der Alternativtext bezieht. Im BITV-Test wird ein entsprechender Vorsatz im Alternativtext jedoch nicht negativ bewertet, er ist für die Bewertung nicht relevant.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_21_": "<h3 id=\"_kann_die_bedeutung_eines_bildes_auch_im_kontext_beschrieben_werden\">Kann die Bedeutung eines Bildes auch im Kontext beschrieben werden?</h3>",
  "_STEP_9_1_1_1B_QUESTIONS_22_": "<p>Das ist in vielen Fällen sinnvoll und eine gute Alternative zur Nutzung des <code>longdesc</code>-Attributs. Wichtig ist, dass die Beschreibung dem Bild eindeutig zugeordnet werden kann. Dafür kann (und soll) dann der Alternativtext des Bildes genutzt werden. Er enthält eine kurze Bezeichnung des abgebildeten, im Kontext beschriebenen Gegenstandes.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_23_": "<h3 id=\"_was_sollte_im_alternativtext_für_landkarten_stehen\">Was sollte im Alternativtext für Landkarten stehen?</h3>",
  "_STEP_9_1_1_1B_QUESTIONS_24_": "<p>Der Alternativtext für Landkarten kann kein Äquivalent sein, eine Beschreibung in Textform kann die Karte nicht ersetzen. Nicht-visuelle Äquivalente könnten Routenbeschreibungen sein, wie sie häufig von Reiseplanern angeboten werden. Das geht aber über die Möglichkeiten des Alternativtextes hinaus. Der Alternativtext für Karten muss sich also darauf beschränken, anzugeben, welches Gebiet auf der Karte dargestellt ist.</p>"
}
