{
  "_STEP_9_1_1_1B_NAME_": "Альтернативные тексты для графики и объектов",
  "_STEP_9_1_1_1B_WHAT_CHECKED_1_": "<p>Не связанные с ссылками информационные графики и изображения должны быть снабжены альтернативными текстами (связанные графики проверяются в шаге проверки 9.1.1.1a «Альтернативные тексты для элементов управления»). Альтернативные тексты заменяют изображение, поэтому они должны (по возможности) выполнять ту же функцию, что и изображение.</p>",
  "_STEP_9_1_1_1B_WHAT_CHECKED_2_": "<p>Для встроенных мультимедийных объектов, видео- или аудиофайлов или апплетов альтернативный текст должен хотя бы позволять описательную идентификацию содержимого.</p>",
  "_STEP_9_1_1_1B_WHAT_CHECKED_3_": "<p>Этот шаг проверки также касается текстовых альтернатив для фоновых изображений, иконок шрифтов и SVG, если они не связаны с ссылками.</p>",
  "_STEP_9_1_1_1B_WHY_CHECKED_1_": "<p>Для слепых пользователей или пользователей простых текстовых браузеров графика и изображения недоступны. Текстовая альтернатива заменяет графику, она должна заменять графику.</p>",
  "_STEP_9_1_1_1B_WHY_CHECKED_2_": "<p>Если объекты (например, видеофайлы, аудиофайлы или апплеты) не могут быть отображены, короткие описательные альтернативные тексты должны позволить пользователю идентифицировать содержимое.</p>",
  "_STEP_9_1_1_1B_WHY_CHECKED_3_": "<p>Иконки шрифтов - это шрифты, содержащие символы вместо букв. Они включены через CSS и либо не выводятся ассистивными технологиями, либо выводится их Unicode-эквивалент, что не передает значение в контексте.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость шага проверки</h3>",
  "_STEP_9_1_1_1B_HOW_CHECKED_2_": "<p>Шаг проверки применим, если есть не связанные ссылками информативные графики или изображения, видео- или аудиофайлы или мультимедийные объекты.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_3_": "<p>Информативными графиками считаются:</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_4_": "<ul><li><p>графические шрифты</p></li><li><p>символы</p></li><li><p>изображения, показывающие, как выглядит объект или человек</p></li><li><p>иллюстрации, представляющие, разъясняющие или иллюстрирующие утверждение</p></li></ul>",
  "_STEP_9_1_1_1B_HOW_CHECKED_5_": "<p>Декоративные графики и изображения - это граничные случаи. Они что-то изображают (в отличие от график для макета), и изображенный объект обычно имеет отношение к теме страницы. Их информационное содержание и польза для понимания страницы не ясны. Декоративные графики могут быть снабжены пустым <code>alt</code> атрибутом, и тогда шаг проверки не применим. Иначе, если альтернативные тексты присутствуют, шаг проверки применим, например, если в <code>alt</code> атрибуте декоративных график указаны имена файлов изображений.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_6_": "<p>Элементы, похожие на логотипы, в которых графика и текст соединены, почти никогда не рассматриваются как чисто декоративная графика и, следовательно, требуют альтернативного текста. Если они связаны ссылкой, то это, конечно, так и есть. Это позволяет слепым и зрячим пользователям обращаться к этим элементам. Альтернативный текст, однако, не должен быть более подробным, чем то, что видно зрячему пользователю.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_7_": "<p>Кроме того, шаг проверки применим, если присутствуют информативные аудио-элементы.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_8_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_1_1_1B_HOW_CHECKED_9_": "<h4 id=\"_2_1_anzeige_der_alternativtexte_von_grafiken\">2.1 Показ альтернативных текстов график</h4>",
  "_STEP_9_1_1_1B_HOW_CHECKED_10_": "<p>В <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#webdeveloper\">Web Developer Toolbar</a> вызвать меню <em>Images &gt; Display Alt Attributes</em> и проверить, присутствует ли атрибут <code>alt</code> и альтернативный текст адекватно заменяет изображение (см. <a href=\"#2.6 Angemessene Alternativtexte\">[2.6 Адекватные альтернативные тексты]</a>). В качестве альтернативы можно использовать <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#imagesbm\">закладку Images</a>.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_11_": "<h4 id=\"_2_2_anzeige_der_alternativtexte_von_objekten\">2.2 Показ альтернативных текстов объектов</h4>",
  "_STEP_9_1_1_1B_HOW_CHECKED_12_": "<ol><li><p>Проверьте, содержит ли страница объекты. Для этого можно использовать следующий метод: В <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#webdeveloper\">Web Developer Toolbar</a> выбрать <em>CSS &gt; Disable All Styles</em> и <em>Images &gt; Hide Images</em>. Отображаются ли теперь элементы, которые явно не являются простым текстом?</p></li><li><p>Проверить в исходном коде, существует ли альтернатива, которая адекватно заменяет объект (см. <a href=\"#2.6 Angemessene Alternativtexte\">[2.6 Адекватные альтернативные тексты]</a>).</p></li><li><p>Если альтернатива для объекта представлена элементом <code>img</code>: Проверить альтернативный текст изображения, как описано в <a href=\"#2.6 Angemessene Alternativtexte\">[2.6 Адекватные альтернативные тексты]</a>.</p></li></ol>",
  "_STEP_9_1_1_1B_HOW_CHECKED_13_": "<h4 id=\"_2_3_textalternativen_für_hintergrundgrafiken\">2.3 Текстовые альтернативы для фоновых изображений</h4>",
  "_STEP_9_1_1_1B_HOW_CHECKED_14_": "<p>(соответствует разделу 2.3 процедуры из шага проверки 9.1.1.1a \"Альтернативные тексты для элементов управления\")</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_15_": "<p>У фоновых изображений нет атрибута <code>alt</code>, поэтому текстовую альтернативу таким образом предоставить нельзя.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_16_": "<p>Однако, если фоновое изображение заменяет текст, действительно присутствующий в HTML-документе, например, заголовок (метод замены изображений CSS), этот текст считается текстовой альтернативой для фонового изображения. Предпосылкой является использование подходящего метода (не <code>display:none</code>).</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_17_": "<h5 id=\"_grundeinstellung_in_firefox\">Базовые настройки в Firefox</h5>",
  "_STEP_9_1_1_1B_HOW_CHECKED_18_": "<ol><li><p>Запустить <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\">Firefox</a> и в меню выбрать <em>Инструменты &gt; Настройки &gt; Общие &gt; Шрифты и цвета</em>.</p></li><li><p>В разделе \"Текст и фон\" выбрать цвет фона, который обычно редко используется для оформления страницы (хорошо подходят, например, светлые розовые или зеленые оттенки).</p></li><li><p>В селекторе <em>Использовать выбранные цвета вместо цветов страницы</em> выбрать опцию <em>Всегда</em>.</p></li><li><p>Закрыть диалоговые окна, нажав \"ОК\".</p></li></ol>",
  "_STEP_9_1_1_1B_HOW_CHECKED_19_": "<h5 id=\"_prüfung\">Проверка</h5>",
  "_STEP_9_1_1_1B_HOW_CHECKED_20_": "<ol><li><p>Открыть страницу в <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\">Firefox</a>.</p></li><li><p>Проверить, исчезают ли информативные графики или изображения. Это происходит, если они встроены как фоновые изображения.</p></li><li><p>Если информативные графики или изображения встроены как фоновые изображения: Проверить, заменяет ли фоновое изображение текст, действительно присутствующий в HTML-документе. Если нет, это оценивается как отсутствие атрибута <code>alt</code>.</p></li><li><p>Если тексты заменяются фоновыми изображениями: Проверить, какой метод замены изображений был использован. Если использован <code>display:none</code>, это оценивается как отсутствие атрибута <code>alt</code>.</p></li><li><p>Если использован подходящий метод замены изображений: Проверить, является ли текст адекватной текстовой альтернативой для фонового изображения (см. <a href=\"#2.6 Angemessene Alternativtexte\">[2.6 Адекватные альтернативные тексты]</a>).</p></li></ol>",
  "_STEP_9_1_1_1B_HOW_CHECKED_21_": "<h4 id=\"_2_4_textalternativen_für_icon_fonts\">2.4 Текстовые альтернативы для иконок шрифтов:</h4>",
  "_STEP_9_1_1_1B_HOW_CHECKED_22_": "<p>При использовании иконок шрифтов невозможно предоставить текстовую альтернативу с помощью атрибута <code>alt</code>.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_23_": "<p>Если иконка шрифта несет информацию и не имеет визуально видимого текста (отдельно стоящая иконка), должна быть предоставлена текстовая альтернатива. Это может быть текст, скрытый подходящим методом (не <code>display:none</code>), или предоставленный через <code>aria-label</code>. Желательно также скрыть саму иконку для программ чтения с экрана с помощью подходящей техники (например, <code>aria-hidden=\"true\"</code>).</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_24_": "<h5 id=\"_prüfung_2\">Проверка</h5>",
  "_STEP_9_1_1_1B_HOW_CHECKED_25_": "<ol><li><p>Открыть страницу в <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\">Firefox</a>.</p></li><li><p>С помощью инструментов разработчика браузера проверить, используется ли CSS-свойство <code>content</code> для псевдоэлементов <code>:before</code> или <code>:after</code> для вставки содержимого (иконок шрифтов).</p></li><li><p>Проверить, скрыта ли иконка подходящим образом для программ чтения с экрана (например, <code>aria-hidden=\"true\"</code>).</p></li><li><p>Для информационных иконок проверить наличие текстовой альтернативы в HTML, которая сделана невидимой с помощью CSS.</p></li><li><p>Если текстовые альтернативы существуют, но не видны на экране: проверить, какой метод использовался для их скрытия. Если использовался <code>display:none</code>, это оценивается как отсутствие или пустое значение атрибута <code>alt</code>.</p></li><li><p>Если использовалась подходящая техника CSS: проверить, является ли текстовая ссылка эквивалентной текстовой альтернативой для иконки (см. <a href=\"#2.6 Angemessene Alternativtexte\">[2.6 Адекватные альтернативные тексты]</a>).</p></li><li><p>Если альтернативный текст не предоставлен через невидимый или связанный текст: проверить, предоставляется ли текстовая альтернатива через атрибут <code>title</code> или <code>aria-label</code>.</p></li><li><p>Если для иконок выводится текст (например, <code>content: \"k\"</code>): проверить, скрыта ли иконка подходящим образом для программ чтения с экрана (например, <code>aria-hidden=\"true\"</code>).</p></li></ol>",
  "_STEP_9_1_1_1B_HOW_CHECKED_26_": "<h4 id=\"_2_5_textalternativen_für_inline_svgs\">2.5 Текстовые альтернативы для встроенных SVG</h4>",
  "_STEP_9_1_1_1B_HOW_CHECKED_27_": "<h5 id=\"_prüfung_3\">Проверка</h5>",
  "_STEP_9_1_1_1B_HOW_CHECKED_28_": "<ol><li><p>Открыть страницу в <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\">Firefox</a>.</p></li><li><p>С помощью инструментов разработчика браузера проверить, является ли SVG встроенным непосредственно в HTML (Inline SVG).</p></li><li><p>Проверить, есть ли элемент <code>title</code> (для более длинных описаний элемент <code>desc</code>) и заменяет ли там размещенная текстовая альтернатива изображение адекватным образом (см. <a href=\"#2.6 Angemessene Alternativtexte\">[2.6 Адекватные альтернативные тексты]</a>). Элементы <code>title</code> или `desc` должны быть первыми дочерними элементами родительского элемента.</p></li><li><p>Поскольку поддержка SVG еще не достаточно хороша во всех комбинациях браузеров и программ чтения с экрана, проверить, обеспечена ли доступность через WAI ARIA:</p><ul><li><p>У SVG-графики должна быть роль <code>role=\"img\"</code>, иначе ее элемент <code>title</code> может не выводиться.</p></li><li><p>Если элемент <code>title</code> SVG используется как доступное название, то элемент <code>svg</code> должен ссылаться на элемент <code>title</code> с помощью <code>aria-labelledby</code>.</p></li><li><p>Если элементы <code>title</code> или <code>desc</code> не используются, проверить, предоставляется ли текстовая альтернатива через <code>aria-label</code> на окружающей ссылке.</p></li></ul></li></ol>",
  "_STEP_9_1_1_1B_HOW_CHECKED_29_": "<p>Для SVG также может использоваться роль <code>role=\"graphics-document\"</code> для структурированных, более сложных SVG-график (на данный момент неясно, насколько хорошо это поддерживается программами чтения с экрана).</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_30_": "<h4 id=\"_2_6_textalternativen_für_videos\">2.6 Текстовые альтернативы для видео</h4>",
  "_STEP_9_1_1_1B_HOW_CHECKED_31_": "<ol><li><p>Открыть страницу в <a href=\"https://www.bitvtest.de/bitv_test/das_testverfahren_im_detail/werkzeugliste.html#firefox\">Firefox</a>.</p></li><li><p>С помощью инструментов разработчика браузера проверить, встроено ли видео в HTML-код через элемент <code>video</code> или через элемент <code>iframe</code>.</p></li><li><p>При использовании элемента видео текстовая альтернатива может быть указана с помощью атрибутов ARIA <code>aria-label</code> или <code>aria-labelledby</code>, если присутствует атрибут <code>controls</code>. Если видео встроено в элемент <code>figure</code>, можно использовать элемент <code>figcaption</code>.</p></li><li><p>При встраивании через <code>iframe</code> (например, видео с YouTube) текстовая альтернатива указывается с помощью атрибута <code>title</code>.</p></li></ol>",
  "_STEP_9_1_1_1B_HOW_CHECKED_32_": "<h4 id=\"_2_7_angemessene_alternativtexte\">2.7 Адекватные альтернативные тексты</h4>",
  "_STEP_9_1_1_1B_HOW_CHECKED_33_": "<p>Решающим является: страница должна быть использована, когда графика или изображения заменены соответствующими альтернативными текстами или другими подходящими текстовыми альтернативами.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_34_": "<p>Как правило, это означает:</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_35_": "<ul><li><p>Для <strong>графических шрифтов</strong> альтернативный текст должен повторять текст графического шрифта.</p></li><li><p>Для <strong>символов</strong> или <strong>знаков</strong> (логотипов) альтернативный текст должен сообщать, что изображен символ, знак или логотип, и передавать значение символа или знака.</p></li><li><p>Для <strong>группы связанных изображений</strong> одно из изображений может передавать значение группы, у других может быть пустой атрибут <code>alt</code>.</p></li><li><p>Для <strong>фотографий</strong>, репродукций картин или других не текстовых элементов, передающих специфический сенсорный опыт, обычно достаточно краткого наименования изображенного объекта.</p></li><li><p>Для <strong>диаграмм</strong> или <strong>технических чертежей</strong> могут потребоваться более подробные пояснения. Альтернативные тексты для этого не подходят, они не должны превышать 80 символов. В альтернативном тексте указывается только, что изображено и где (например: \"Подробности в следующем тексте\"), пояснение находится в контексте изображения.</p></li><li><p>Для <strong>объектов</strong>, которые не могут быть отображены, альтернативный текст (будь то текст запасного объекта или сгенерированный скриптом) или текст в непосредственном контексте объекта (например, предшествующий заголовок или последующая легенда) должны предоставлять краткое описание или идентификацию и, если возможно, указывать на альтернативу медиа. Кроме того, полезно, чтобы скрипт анализировал, не отображается ли объект из-за отключенного JavaScript и/или плагина и генерировал соответствующее сообщение. Если такие сообщения генерируются, они должны соответствовать фактическим настройкам браузера. Так, если плагин Flash выключен, но JavaScript включен, не должно появляться (вводящее в заблуждение) сообщение о том, что необходимо включить JavaScript.</p></li></ul>",
  "_STEP_9_1_1_1B_HOW_CHECKED_36_": "<p>В общем, альтернативные тексты должны быть краткими. Подробные описания изображений не должны находиться в альтернативном тексте, а должны быть предоставлены в контексте изображения (см. <a href=\"#_2_5_textalternativen_für_inline_svgs\">2.5 Текстовые альтернативы для встроенных SVG</a>).</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_37_": "<h4 id=\"_2_6_angemessenheit_von_textalternativen_im_kontext\">2.6 Адекватность текстовых альтернатив в контексте</h4>",
  "_STEP_9_1_1_1B_HOW_CHECKED_38_": "<p>Если альтернативный текст не может адекватно заменить графику или изображение, необходимо проверить, предоставляется ли информация, передаваемая через изображение, в текстовом контексте.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_39_": "<p>Это касается, например</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_40_": "<ul><li><p>Диаграмм</p></li><li><p>Технических чертежей</p></li><li><p>Схем проезда</p></li><li><p>Видео</p></li></ul>",
  "_STEP_9_1_1_1B_HOW_CHECKED_41_": "<p>К контексту графики или изображения относится:</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_42_": "<ul><li><p>соответствующий (предшествующий, следующий) текст, а также</p></li><li><p>текстовая альтернатива, предложенная в непосредственном контексте изображения, ясно обозначенная и связанная (обычная ссылка и/или <code>longdesc</code>).</p></li></ul>",
  "_STEP_9_1_1_1B_HOW_CHECKED_43_": "<p>Краткий альтернативный текст с обозначением изображения также необходим при использовании текстовых альтернатив в контексте. Альтернативный текст указывает, что на данном месте изображено что-то конкретное, он делает понятным, на что именно относится пояснение в контексте.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_44_": "<p>К контексту видео относится:</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_45_": "<ul><li><p>соответствующий (предшествующий, следующий) текст или заголовок,</p></li><li><p>соответственно подписанная кнопка, например, <code>aria-label=\"Воспроизвести видео [название видео]\"</code></p></li></ul>",
  "_STEP_9_1_1_1B_HOW_CHECKED_46_": "<h3 id=\"_3_hinweise\">3. Советы</h3>",
  "_STEP_9_1_1_1B_HOW_CHECKED_47_": "<p>Чтобы оценить адекватность альтернативного текста, необходимо связать альтернативный текст с графикой или объектом, к которому он относится. Требуется, таким образом, параллельное или чередующееся отображение графики/объекта и соответствующего альтернативного текста.</p>",
  "_STEP_9_1_1_1B_HOW_CHECKED_48_": "<p>Поскольку SVG еще недостаточно поддерживается во всех комбинациях браузеров и программ чтения с экрана, на данный момент роль должна передаваться через WAI-ARIA (см. шаг проверки 9.4.1.2 Название, Роль, Значение доступны).</p>",
  "_STEP_9_1_1_1B_SOURCES_1_": "<h3 id=\"_anleitungen_zm_erstellen_von_alternativtexten\">Инструкции по созданию альтернативных текстов</h3>",
  "_STEP_9_1_1_1B_SOURCES_2_": "<ul><li><p>Учебные пособия W3C по доступности веба: <a href=\"https://www.w3.org/WAI/tutorials/images/\">Концепции изображений</a></p></li><li><p>WebAIM: <a href=\"https://webaim.org/techniques/alttext/\">Альтернативный текст</a></p></li><li><p>Спецификация HTML 5.1: <a href=\"https://www.w3.org/TR/html51/semantics-embedded-content.html#alt-text\">Требования к предоставлению текста в качестве альтернативы для изображений</a></p></li></ul>",
  "_STEP_9_1_1_1B_SOURCES_3_": "<h3 id=\"_w3c_scalable_vector_graphics_svg_1_1\">W3C - Масштабируемая векторная графика (SVG) 1.1</h3>",
  "_STEP_9_1_1_1B_SOURCES_4_": "<ul><li><p>Элементы 'desc' и 'title': <a href=\"https://www.w3.org/TR/SVG11/struct.html#DescriptionAndTitleElements\">Описание и заголовок</a></p></li><li><p>О ролях, таких как <code>role=\"graphics-document\"</code> для более сложных SVG-график: <a href=\"https://www.w3.org/TR/graphics-aria-1.0/\">Модуль графики WAI-ARIA</a> (Рекомендация W3C от 02 октября 2018 года)</p></li></ul>",
  "_STEP_9_1_1_1B_SOURCES_5_": "<h3 id=\"_svgs_zugänglich_einbinden\">Доступное включение SVG</h3>",
  "_STEP_9_1_1_1B_SOURCES_6_": "<ul><li><p>Scott O’Hara, май 2019: <a href=\"https://www.scottohara.me/blog/2019/05/22/contextual-images-svgs-and-a11y.html\">Контекстуальное оформление доступных изображений и SVG</a></p></li><li><p>Блог Deque, январь 2019: <a href=\"https://www.deque.com/blog/creating-accessible-svgs/\">Создание доступных SVG</a></p></li><li><p>Simply Accessible, март 2017: <a href=\"https://simplyaccessible.com/article/7-solutions-svgs/\">7 решений для создания более доступных SVG</a></p></li><li><p>CSS-Tricks, обновлено в августе 2016: <a href=\"https://css-tricks.com/accessible-svgs/\">Доступные SVG</a></p></li></ul>",
  "_STEP_9_1_1_1B_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Различия с другими этапами проверки</h3>",
  "_STEP_9_1_1_1B_CLASSIFICATION_2_": "<ul><li><p>Альтернативные тексты для связанных график (например, элементы управления или тизерные изображения) проверяются на этапе 9.1.1.1a \"Альтернативные тексты для элементов управления\".</p></li><li><p>Простые анимации или видео <em>без необходимости синхронизации звуковой дорожки</em> проверяются на этапе 9.1.2.1 \"Альтернативы для аудиофайлов и немых видео\".</p></li><li><p>Графика макета или декоративные графики с пустыми атрибутами <code>alt</code> проверяются на этапе 9.1.1.1c \"Пустые alt-атрибуты для графики макета\".</p></li><li><p>CAPTCHA проверяются на этапе 9.1.1.1d \"Альтернативы для CAPTCHA\".</p></li><li><p>Отображение соответствующей роли SVG проверяется на этапе 9.4.1.2 \"Имя, Роль, Значение доступны\" (см. выше <a href=\"#_3_hinweise\">3. Советы</a>).</p></li></ul>",
  "_STEP_9_1_1_1B_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация этапа проверки по WCAG 2.1</h3>",
  "_STEP_9_1_1_1B_CLASSIFICATION_4_": "<h4 id=\"_guideline\">Руководство</h4>",
  "_STEP_9_1_1_1B_CLASSIFICATION_5_": "<ul><li><p><a href=\"http://www.w3.org/TR/WCAG21/#text-alternatives\">Руководство 1.1 Текстовые альтернативы: Предоставление текстовых альтернатив для любого нон-текстового контента, так чтобы его можно было преобразовать в другие формы, необходимые людям, такие как крупный шрифт, брайль, речь, символы или более простой язык</a></p></li></ul>",
  "_STEP_9_1_1_1B_CLASSIFICATION_6_": "<h4 id=\"_success_criterion\">Критерий успеха</h4>",
  "_STEP_9_1_1_1B_CLASSIFICATION_7_": "<ul><li><p><a href=\"http://www.w3.org/TR/WCAG21/#x1-1-1-non-text-content\">1.1.1 Нон-текстовый контент</a> (Уровень A)</p></li></ul>",
  "_STEP_9_1_1_1B_CLASSIFICATION_8_": "<h4 id=\"_techniques\">Техники</h4>",
  "_STEP_9_1_1_1B_CLASSIFICATION_9_": "<h5 id=\"_general_techniques\">Общие техники</h5>",
  "_STEP_9_1_1_1B_CLASSIFICATION_10_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G73\">G73: Предоставление длинного описания в другом месте с ссылкой на него, которая находится сразу рядом с нон-текстовым контентом</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G74\">G74: Предоставление длинного описания в тексте рядом с нон-текстовым контентом, с ссылкой на место длинного описания в коротком описании</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G82\">G82: Предоставление текстовой альтернативы, которая идентифицирует назначение нон-текстового контента</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G92\">G92: Предоставление длинного описания для нон-текстового контента, которое служит той же цели и представляет ту же информацию</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G94\">G94: Предоставление короткого текстового альтернатива для нон-текстового контента, которое служит той же цели и представляет ту же информацию, что и нон-текстовый контент</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G95\">G95: Предоставление коротких текстовых альтернатив, которые дают краткое описание нон-текстового контента</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G100\">G100: Предоставление принятого или описательного названия нон-текстового контента</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G196\">G196: Использование текстовой альтернативы на одном элементе в группе изображений, которая описывает все элементы в группе</a></p></li></ul>",
  "_STEP_9_1_1_1B_CLASSIFICATION_11_": "<h5 id=\"_html_techniques\">HTML Техники</h5>",
  "_STEP_9_1_1_1B_CLASSIFICATION_12_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H37\">H37: Использование атрибутов <code>alt</code> на элементах <code>img</code></a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H45\">H45: Использование <code>longdesc</code></a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H46\">H46: Использование <code>noembed</code> с <code>embed</code></a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H53\">H53: Использование тела элемента <code>object</code></a></p></li></ul>",
  "_STEP_9_1_1_1B_CLASSIFICATION_13_": "<h5 id=\"_aria_techniques\">ARIA Техники</h5>",
  "_STEP_9_1_1_1B_CLASSIFICATION_14_": "<ul><li><p>ARIA6 Использование <code>aria-label</code> для предоставления меток объектам</p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA10\">ARIA10: Использование <code>aria-labelledby</code> для предоставления текстовой альтернативы нон-текстовому контенту</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/aria/ARIA15\">ARIA15: Использование aria-describedby для предоставления описаний изображений</a></p></li></ul>",
  "_STEP_9_1_1_1B_CLASSIFICATION_15_": "<h5 id=\"_failures\">Неудачи</h5>",
  "_STEP_9_1_1_1B_CLASSIFICATION_16_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F3\">F3: Неудача критерия успеха 1.1.1 из-за использования CSS для включения изображений, которые передают важную информацию</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F20\">F20: Неудача критериев успеха 1.1.1 и 4.1.2 из-за необновления текстовых альтернатив при изменениях нон-текстового контента</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F30\">F30: Неудача критериев успеха 1.1.1 и 1.2.1 из-за использования текстовых альтернатив, которые не являются альтернативами</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F65\">F65: Неудача критерия успеха 1.1.1 из-за пропуска атрибута <code>alt</code> на элементах <code>img</code>, <code>area</code> и <code>input</code> типа 'image'</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F67\">F67: Неудача критериев успеха 1.1.1 и 1.2.1 из-за предоставления длинного описания нон-текстового контента, которое не выполняет ту же функцию или не представляет ту же информацию</a></p></li></ul>",
  "_STEP_9_1_1_1B_QUESTIONS_1_": "<h3 id=\"_was_kann_der_alternativtext_leisten\">Что может сделать альтернативный текст?</h3>",
  "_STEP_9_1_1_1B_QUESTIONS_2_": "<p>Например, взрывной чертеж двигателя: должна ли вся конструкция двигателя быть описана в альтернативном тексте?</p>",
  "_STEP_9_1_1_1B_QUESTIONS_3_": "<p>Взрывной чертеж показывает расположение различных частей в двигателе. Возможны альтернативные формы передачи, например, расположение частей может быть показано на осязаемой модели. Однако ясно, что для довольно сложных структур текстовая форма не подходит. Вопрос в том, что можно смыслово передать в альтернативном тексте. В любом случае, альтернативный текст может сообщить, что представлен взрывной чертеж двигателя. Таким образом, слепой пользователь хотя бы будет знать, какая информация ему недоступна. Кроме того, может быть, что только конкретная деталь всего чертежа имеет значение. Это определяется из контекста. Соответствующую деталь можно тогда объяснить в текстовой форме.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_4_": "<p>Для оценки в BITV-Test, если эксперт сам не может сказать, можно ли или как можно передать информационное содержание изображения в текстовой форме, наименование изображенного объекта в альтернативном тексте должно считаться достаточным.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_5_": "<h3 id=\"_firmenlogos\">Фирменные логотипы</h3>",
  "_STEP_9_1_1_1B_QUESTIONS_6_": "<p>На сайте представлен фирменный логотип. Достаточно ли в альтернативном тексте указать, что это изображение фирменного логотипа, или его также следует описать?</p>",
  "_STEP_9_1_1_1B_QUESTIONS_7_": "<p>Даже для слепого посетителя может быть интересно, как выглядит логотип. Он общается с видящими и будет знать, о чем идет речь. Однако альтернативный текст должен быть кратким; посетителю не хочется слышать это описание каждый раз при посещении страницы. Поэтому описание может быть предоставлено отдельно, в подробном описании.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_8_": "<p>В BITV-Test такое подробное описание фирменного логотипа, однако, не требуется.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_9_": "<h3 id=\"_abbildungen_mit_text\">Изображения с текстом</h3>",
  "_STEP_9_1_1_1B_QUESTIONS_10_": "<p>Изображение содержит текст. Должен ли этот текст в любом случае быть предоставлен в альтернативном тексте?</p>",
  "_STEP_9_1_1_1B_QUESTIONS_11_": "<p>Нет, решающим является функция изображения. Если это изображение с текстом, то дело обычно ясно: изображение предназначено для отображения текста.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_12_": "<p>Иная ситуация, если изображено мотив с текстом. Тогда, как и со всеми изображениями, необходимо рассмотреть, какую функцию выполняет изображение, является ли изображенный текст существенным. Только тогда текст должен учитываться в альтернативном тексте.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_13_": "<h3 id=\"_kann_für_längere_erläuterungen_auch_das_title_attribut_verwendet_werden\">Может ли атрибут <code>title</code> использоваться для более длинных пояснений?</h3>",
  "_STEP_9_1_1_1B_QUESTIONS_14_": "<p>Атрибут <code>title</code> предназначен для других целей, он не должен заменять изображение, а должен предоставлять дополнительную информацию о нём. Например, он может использоваться для указания источника изображения. Использование атрибута <code>title</code> для изображений, к сожалению, не унифицировано.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_15_": "<p>На некоторых веб-сайтах содержимое атрибута <code>alt</code> повторяется в атрибуте <code>title</code>. Это не лучшее решение, так как это приводит к тому, что слепые пользователи отключают вывод атрибута <code>title</code>, чтобы избежать прослушивания лишней информации.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_16_": "<p>В любом случае атрибут <code>title</code> не может быть принят в качестве замены для предоставления альтернативного текста в атрибуте <code>alt</code>.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_17_": "<p>Для более длинных пояснений атрибут <code>title</code> не предназначен и не очень подходит. Он содержит только простой текcт, и изменения размера шрифта в большинстве браузеров не влияют на отображение атрибута <code>title</code>.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_18_": "<h3 id=\"_rolle_im_alternativtext\">Роль в альтернативном тексте</h3>",
  "_STEP_9_1_1_1B_QUESTIONS_19_": "<p>Должно ли в альтернативном тексте указываться, что это графический элемент?</p>",
  "_STEP_9_1_1_1B_QUESTIONS_20_": "<p>Нет, это не требуется. Скринридеры определяют, к какому элементу относится альтернативный текст, на основе разметки. В BITV-Test соответствующее вступление в альтернативный текст не оценивается отрицательно, это не важно для оценки.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_21_": "<h3 id=\"_kann_die_bedeutung_eines_bildes_auch_im_kontext_beschrieben_werden\">Может ли значение изображения быть описано также в контексте?</h3>",
  "_STEP_9_1_1_1B_QUESTIONS_22_": "<p>Это часто имеет смысл и является хорошей альтернативой использованию атрибута <code>longdesc</code>. Важно, чтобы описание можно было однозначно связать с изображением. Для этого может (и должен) использоваться альтернативный текст изображения. Он содержит краткое название изображенного объекта, описанного в контексте.</p>",
  "_STEP_9_1_1_1B_QUESTIONS_23_": "<h3 id=\"_was_sollte_im_alternativtext_für_landkarten_stehen\">Что должно быть в альтернативном тексте для карт?</h3>",
  "_STEP_9_1_1_1B_QUESTIONS_24_": "<p>Альтернативный текст для карт не может быть эквивалентом; описание в текстовой форме не может заменить карту. Не визуальные эквиваленты могут быть маршрутными описаниями, как те, что часто предлагаются планировщиками путешествий. Однако это выходит за рамки возможностей альтернативного текста. Альтернативный текст для карт, таким образом, должен ограничиваться указанием, какая территория представлена на карте.</p>"
}
