{
  "_STEP_6_2_2_1_NAME_": "Визуально различимое отображение текстовых сообщений",
  "_STEP_6_2_2_1_NAME_MENU_": "6.2.2.1 Визуально различимое отображение текстовых сообщений",
  "_STEP_6_2_2_1_WHAT_CHECKED_1_": "<p>Если веб-приложение может отправлять и получать текстовую коммуникацию в реальном времени (RTT, Real-Time Text), отображение полученных и отправленных сообщений должно быть хорошо визуально различимо.</p>",
  "_STEP_6_2_2_1_WHY_CHECKED_1_": "<p>Люди, использующие текстовую коммуникацию в реальном времени, должны иметь возможность визуально различать уже полученные и отправленные сообщения. Это позволит им легче находить и идентифицировать собственные высказывания или высказывания других.</p>",
  "_STEP_6_2_2_1_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_6_2_2_1_HOW_CHECKED_2_": "<p>Этап проверки применим, если веб-приложение может отправлять и получать текстовую коммуникацию в реальном времени (RTT, Real-Time Text).</p>",
  "_STEP_6_2_2_1_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_6_2_2_1_HOW_CHECKED_4_": "<ol><li><p>Открыть веб-приложение.</p></li><li><p>Проверить, предлагает ли веб-приложение отправку и прием текстовой коммуникации в реальном времени.</p></li><li><p>Проверить, хорошо ли различимы отправленные и полученные текстовые сообщения, отображаются ли они отдельно, например:</p><ul><li><p>Рамка для текстовых сообщений (с хорошим контрастом снаружи).</p></li><li><p>Позиционирование собственных сообщений справа, а сообщений собеседника слева, или наоборот.</p></li><li><p>Имя перед началом сообщения.</p></li></ul></li></ol>",
  "_STEP_6_2_2_1_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Примечания</h3>",
  "_STEP_6_2_2_1_HOW_CHECKED_6_": "<ul><li><p>При текстовой коммуникации в реальном времени (RTT, Real-Time Text) текст появляется у получателя динамично уже во время ввода отправителем. RTT не то же самое, что, например, чат, где сообщения явно отправляются и появляются у получателя только после отправки.</p></li><li><p>Эта требование строго применяется только для текстовой коммуникации в реальном времени, но также важно для различения других форм текстовой коммуникации (например, текстовых чатов).</p></li><li><p>Если веб-приложение предоставляет дополнительные опции для отображения сообщений, которые возможно не соответствуют этим требованиям, это не должно оцениваться негативно. Другие способы отображения положительны, они могут удовлетворять определенные потребности пользователей. Так, отображение текучего текста как для полученных, так и для отправленных сообщений в одном текстовом контейнере может быть выгодным для пользователей Braille.</p></li><li><p>Различение сообщений от разных лиц не должно осуществляться исключительно по разным цветам текста - см. также раздел 4.2 Отграничение от других этапов проверки.</p></li><li><p>Этап проверки требует только различения отправленных (с точки зрения пользователя, своих) и полученных высказываний, а не различения разных полученных высказываний.</p></li></ul>",
  "_STEP_6_2_2_1_SOURCES_1_": "<ul><li><p><a href=\"https://labs.etsi.org/rep/HF/en301549/uploads/272bede3724c5c99efe777f778201f70/tr_103708v010101p.pdf\">Human Factors (HF); Real-Time Text (RTT) in Multiparty Conference Calling / ETSI TR 103 708 V1.1.1 (2022-08)</a></p></li></ul>",
  "_STEP_6_2_2_1_CLASSIFICATION_1_": "<h3 id=\"_abgrenzung_zu_anderen_prüfschritten\">Отграничение от других этапов проверки</h3>",
  "_STEP_6_2_2_1_CLASSIFICATION_2_": "<p>Если сообщения отправителя и получателя можно отличить только по цвету текста, и разница в контрастности обоих видов сообщений составляет менее 3:1, этот этап проверки, а также этап проверки 1.4.1a \"Использование без цвета\" считаются не выполненными. Другие требования (например, чтобы текст сам по себе или рамка или другие графические элементы для различения были достаточно контрастными) оцениваются в соответствующих этапах проверки.</p>",
  "_STEP_6_2_2_1_CLASSIFICATION_3_": "<h3 id=\"_einordnung_des_prüfschritts_nach_der_en_301_549_v3_2_1\">Классификация этапа проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_6_2_2_1_CLASSIFICATION_4_": "<h4 id=\"_6_2_2_1_visually_distinguishable_display\">6.2.2.1 Визуально различимое отображение</h4>",
  "_STEP_6_2_2_1_CLASSIFICATION_5_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where ICT has RTT send and receive capabilities, displayed sent text shall be visually differentiated from, and separated from, received text.</p><p>NOTE: The ability of the user to choose between having the send and receive text be displayed in-line or separately, and with options to select, allows users to display RTT in a form that works best for them. This would allow Braille users to use a single field and take turns and have text appear in the sequential way that they may need or prefer.</p></div></div>"
}