{
  "_STEP_9_2_4_7_NAME_": "Четко видимый фокус",
  "_STEP_9_2_4_7_NAME_MENU_": "9.2.4.7 Четко видимый фокус",
  "_STEP_9_2_4_7_WHAT_CHECKED_1_": "<p>Фокус клавиатуры должен быть явно выделен. Если авторы не реализуют собственное выделение фокуса, стандартное выделение браузера через CSS не должно быть подавлено. Контраст выделения фокуса (например, рамка вокруг элементов, подчеркивание, изменение цвета) по сравнению с нефокусированным состоянием должен быть не менее 3:1.</p>",
  "_STEP_9_2_4_7_WHAT_CHECKED_2_": "<p>Скрытые переходные ссылки должны отображаться при получении фокуса.</p>",
  "_STEP_9_2_4_7_WHY_CHECKED_1_": "<p>Для пользователей, использующих клавиатуру, важно видеть, где находится фокус клавиатуры, то есть какая ссылка или кнопка будет активирована при нажатии клавиши Enter, или какой элемент формы или другой элемент управления в данный момент находится в фокусе.</p>",
  "_STEP_9_2_4_7_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_9_2_4_7_HOW_CHECKED_2_": "<p>Этап проверки применим, если на странице присутствуют интерактивные элементы.</p>",
  "_STEP_9_2_4_7_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_9_2_4_7_HOW_CHECKED_4_": "<ol><li><p>Загрузить страницу в Firefox.</p></li><li><p>Пройти все элементы управления с помощью клавиши Tab и проверить, реагируют ли они на фокус графическими изменениями (например, изменением цвета, подчеркиванием или отображением символов). Скрытые переходные ссылки должны отображаться при получении фокуса.</p></li><li><p>Если выделение фокуса осуществляется исключительно с помощью изменения цвета, проверить, что контраст между фокусированным и нефокусированным состояниями составляет как минимум 3:1.</p></li><li><p>Для ссылок, которые не изменяются графически, проверить их реакцию на курсор мыши.</p></li><li><p>Если это так: прервать или продолжить с шага 6.</p></li><li><p>Если отображается только стандартный фокус клавиатуры браузера (системное выделение), проверить, хорошо ли он виден на фоне дизайна страницы (например, на CSS-окрашенных фонах).</p></li><li><p>В случае сомнений согласно этапу проверки <a href=\"9.1.4.11 Контрастность графики и графических элементов управления достаточна.html\">9.1.4.11 Контрастность графики и графических элементов управления достаточна</a> или <a href=\"9.1.4.3 Контрастность текстов достаточна.html\">9.1.4.3 Контрастность текстов достаточна</a> определить, достаточен ли контраст между системным фокусом и фоном (как минимум 3:1)</p></li><li><p>Загрузить страницу в Chrome и повторить шаги с 2 по 7.</p></li></ol>",
  "_STEP_9_2_4_7_HOW_CHECKED_5_": "<h3 id=\"_3_hinweise\">3. Замечания</h3>",
  "_STEP_9_2_4_7_HOW_CHECKED_6_": "<ul><li><p>Проверка должна проводиться с включенным JavaScript.</p></li><li><p>Этап проверки не считается выполненным, если вообще отсутствует фокус клавиатуры, то есть веб-сайт подавляет собственный фокус браузера (например, с помощью JavaScript <code>blur()</code> или CSS <code>outline:none</code>). В этом случае возможно также не выполнен этап проверки 9.2.1.1 \"Используемый без мыши\"!</p></li><li><p>В целом стандартное выделение фокуса клавиатуры в браузере улучшилось за последние годы при отсутствии дизайна от авторов. В зависимости от операционной системы и браузера, цвета фона и других аспектов дизайна стандартное выделение фокуса в браузерах в некоторых случаях может быть плохо видимо. Целенаправленное оформление в CSS, например, через псевдокласс <code>:focus</code>, гарантирует, что фокус клавиатуры всегда хорошо виден.</p></li></ul>",
  "_STEP_9_2_4_7_HOW_CHECKED_7_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_9_2_4_7_HOW_CHECKED_8_": "<h4 id=\"_erfüllt\">Выполнено</h4>",
  "_STEP_9_2_4_7_HOW_CHECKED_9_": "<p>Фокусировка интерактивных элементов визуально заметна:</p>",
  "_STEP_9_2_4_7_HOW_CHECKED_10_": "<ul><li><p>При фокусировке клавиатуры используются рамки, подчеркивания, изменения цвета, изменения формы или дополнительные маркеры.</p></li><li><p>Если фокусировка ссылок или кнопок передается только через изменение текста или цвета фона, их контрастное расстояние к нефокусированному состоянию составляет как минимум 3:1.</p></li><li><p>Если отображается только стандартный фокус клавиатуры браузера, он достаточно видим на фоне дизайна страницы, соответствует этапу проверки 9.1.4.11 \"Контрастность графики и графических элементов управления достаточна\".</p></li></ul>",
  "_STEP_9_2_4_7_HOW_CHECKED_11_": "<h4 id=\"_nicht_voll_erfüllt\">Не полностью выполнено</h4>",
  "_STEP_9_2_4_7_HOW_CHECKED_12_": "<ul><li><p>Переходные ссылки остаются скрытыми при получении фокуса.</p></li></ul>",
  "_STEP_9_2_4_7_HOW_CHECKED_13_": "<h4 id=\"_nicht_erfüllt\">Не выполнено</h4>",
  "_STEP_9_2_4_7_HOW_CHECKED_14_": "<p>Стандартный фокус браузера подавлен, при использовании клавиатуры фокус не отображается.</p>",
  "_STEP_9_2_4_7_CLASSIFICATION_1_": "<h3 id=\"_bezug_zu_1_4_11_non_text_contrast_sichtbarkeit_der_fokushervorhebung\">Отношение к 1.4.11 Неконтрастный текст (видимость выделения фокуса)</h3>",
  "_STEP_9_2_4_7_CLASSIFICATION_2_": "<p>Текст понимания к требованию WCAG 1.4.11 Неконтрастный текст в разделе \"Связь с использованием цвета и видимостью фокуса\" гласит:</p>",
  "_STEP_9_2_4_7_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><blockquote><p>In combination with 2.4.7 Focus Visible, the visual focus indicator for a component must have sufficient contrast against the adjacent background when the component is focused, except where the appearance of the component is determined by the user agent and not modified by the author. If the focus state relies on a change of color (e.g., changing only the background color of a button), then changing from one color to another that has at least a 3:1 contrast ratio with the previous state of the control is a method for meeting the Focus visible criteria.</p></blockquote></div>",
  "_STEP_9_2_4_7_CLASSIFICATION_4_": "<h3 id=\"_einordnung_des_prüfschritts_nach_wcag_2_1\">Классификация этапа проверки по WCAG 2.1</h3>",
  "_STEP_9_2_4_7_CLASSIFICATION_5_": "<h4 id=\"_guideline\">Руководство</h4>",
  "_STEP_9_2_4_7_CLASSIFICATION_6_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#navigable\"> Руководство 2.4 Навигационное: Предоставление способов помочь пользователям навигировать, находить контент и определять, где они находятся</a></p></li></ul>",
  "_STEP_9_2_4_7_CLASSIFICATION_7_": "<h4 id=\"_success_criterion\">Критерий успеха</h4>",
  "_STEP_9_2_4_7_CLASSIFICATION_8_": "<ul><li><p><a href=\"https://www.w3.org/TR/WCAG21/#focus-visible\"> 2.4.7 Видимый фокус</a> (Уровень AA)</p></li><li><p><a href=\"https://www.w3.org/TR/WCAG21/#non-text-contrast\"> 1.4.11 Неконтрастный текст</a> (Уровень AA)</p></li></ul>",
  "_STEP_9_2_4_7_CLASSIFICATION_9_": "<h4 id=\"_techniques\">Техники</h4>",
  "_STEP_9_2_4_7_CLASSIFICATION_10_": "<h5 id=\"_general_techniques\">Общие техники</h5>",
  "_STEP_9_2_4_7_CLASSIFICATION_11_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G149.html\"> G149: Использование компонентов пользовательского интерфейса, которые выделяются пользовательским агентом при получении фокуса</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G165.html\"> G165: Использование стандартного индикатора фокуса платформы, так что высоковидимые стандартные индикаторы фокуса сохраняются</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G195.html\"> G195: Использование специально предоставленного автором высоко видимого индикатора фокуса</a></p></li></ul>",
  "_STEP_9_2_4_7_CLASSIFICATION_12_": "<h5 id=\"_css_techniques\">Техники CSS</h5>",
  "_STEP_9_2_4_7_CLASSIFICATION_13_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/css/C15.html\"> C15: Использование CSS для изменения представления компонента пользовательского интерфейса, когда он получает фокус</a></p></li></ul>",
  "_STEP_9_2_4_7_CLASSIFICATION_14_": "<h5 id=\"_client_side_scripting_techniques\">Техники клиентских скриптов</h5>",
  "_STEP_9_2_4_7_CLASSIFICATION_15_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/client-side-script/SCR31.html\"> SCR31: Использование скриптов для изменения цвета фона или границы элемента при фокусе</a></p></li></ul>",
  "_STEP_9_2_4_7_CLASSIFICATION_16_": "<h5 id=\"_failures\">Ошибки</h5>",
  "_STEP_9_2_4_7_CLASSIFICATION_17_": "<ul><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F55.html\"> F55: Невыполнение критериев успеха 2.1.1, 2.4.7 и 3.2.1 из-за использования скрипта для удаления фокуса, когда фокус получен</a></p></li><li><p><a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F78.html\"> F78: Невыполнение критерия успеха 2.4.7 из-за стилизации контуров и границ элементов таким образом, чтобы убрать или сделать невидимым визуальный индикатор фокуса</a></p></li></ul>",
  "_STEP_9_2_4_7_QUESTIONS_1_": "<h3 id=\"_ist_die_anzeige_des_fokus_nicht_sache_des_browsers\">Не является ли отображение фокуса делом браузера?</h3>",
  "_STEP_9_2_4_7_QUESTIONS_2_": "<p>Все браузеры каким-то образом показывают пользователю клавиатуры, где находится фокус, если это отображение активно не подавлено.</p>",
  "_STEP_9_2_4_7_QUESTIONS_3_": "<p>Тем не менее, отображение фокуса не является исключительно делом браузера. Веб-сайт определяет, как он должен выглядеть в браузере. Он изменяет, например, цвета активных ссылок и фонов ссылок или использует другие элементы дизайна. В этой среде, определенной веб-сайтом, фокус для пользователей клавиатуры должен быть хорошо видим.</p>"
}
