{
  "_STEP_5_4_NAME_": "Сохранение информации о доступности при конвертации",
  "_STEP_5_4_NAME_MENU_": "5.4 Сохранение информации о доступности при конвертации",
  "_STEP_5_4_WHAT_CHECKED_1_": "<p>Если веб-сайт конвертирует документы в другие форматы, существующая информация о доступности должна быть перенесена в целевой формат, если целевой формат в принципе поддерживает эту информацию.</p>",
  "_STEP_5_4_WHY_CHECKED_1_": "<p>Если веб-сайт предлагает функции конвертации, информация о доступности в исходном формате не должна теряться в целевом формате без необходимости. Потеря информации о доступности считается ненужной, если целевой формат в принципе поддерживает включение информации о доступности, но функция конвертации её не использует. Например, HTML и PDF поддерживают форматирование заголовков, поэтому функция конвертации может легко адаптировать форматирование заголовков из HTML-исходника для PDF.</p>",
  "_STEP_5_4_WHY_CHECKED_2_": "<p>Потерю информации о доступности можно принять только в том случае, если целевой формат не поддерживает тип информации, используемый в исходном формате.</p>",
  "_STEP_5_4_HOW_CHECKED_1_": "<h3 id=\"_1_anwendbarkeit_des_prüfschritts\">1. Применимость этапа проверки</h3>",
  "_STEP_5_4_HOW_CHECKED_2_": "<p>Этот этап проверки применим, если веб-сайт конвертирует цифровые форматы, такие как текст, аудио и видео. Однако если исходный или целевой формат конвертации не является HTML, этот этап проверки не может быть полностью проверен в рамках этой процедуры, так как потребуется дополнительная проверка отличающегося формата. Смотрите '3. Примечания' для оценки.</p>",
  "_STEP_5_4_HOW_CHECKED_3_": "<h3 id=\"_2_prüfung\">2. Проверка</h3>",
  "_STEP_5_4_HOW_CHECKED_4_": "<p>Проверка очень индивидуальна и зависит от используемых исходных и целевых форматов. Дополнительная проверка отличного формата не может быть проведена в рамках этой процедуры проверки.</p>",
  "_STEP_5_4_HOW_CHECKED_5_": "<ol><li><p>При необходимости конвертировать образцы документов с информацией о доступности в целевой формат.</p></li><li><p>Сохранилась ли поддерживаемая форматом информация о доступности после конвертации в целевом формате?</p></li></ol>",
  "_STEP_5_4_HOW_CHECKED_6_": "<h3 id=\"_3_hinweise\">3. Примечания</h3>",
  "_STEP_5_4_HOW_CHECKED_7_": "<p>Поскольку проверка формата, не являющегося HTML, не может быть выполнена с помощью этой процедуры проверки, этот этап должен быть оценен как 'не применим'. Однако в комментариях следует указать, что информация о доступности (например, семантические заголовки, ссылки или субтитры) в целевом формате должна сохраняться.</p>",
  "_STEP_5_4_HOW_CHECKED_8_": "<h3 id=\"_4_bewertung\">4. Оценка</h3>",
  "_STEP_5_4_HOW_CHECKED_9_": "<h4 id=\"_erfüllt\">Выполнено</h4>",
  "_STEP_5_4_HOW_CHECKED_10_": "<p>Целевой формат содержит всю информацию о доступности из исходного HTML-формата, которую он в принципе поддерживает.</p>",
  "_STEP_5_4_HOW_CHECKED_11_": "<h4 id=\"_nicht_voll_erfüllt\">Не полностью выполнено</h4>",
  "_STEP_5_4_HOW_CHECKED_12_": "<p>Информация о доступности, которую в принципе поддерживает целевой формат из исходного HTML-формата, теряется при конвертации.</p>",
  "_STEP_5_4_SOURCES_1_": "<ul><li><p>В настоящее время нет источников.</p></li></ul>",
  "_STEP_5_4_CLASSIFICATION_1_": "<h3 id=\"_einordnung_des_prüfschritts_nach_en_301_549_v3_2_1\">Классификация этапа проверки по EN 301 549 V3.2.1</h3>",
  "_STEP_5_4_CLASSIFICATION_2_": "<h4 id=\"_5_4_preservation_of_accessibility_information_during_conversion\">5.4 Сохранение информации о доступности при конвертации</h4>",
  "_STEP_5_4_CLASSIFICATION_3_": "<div lang=\"en\" class=\"a_ml_5\"><div class=\"content\"><p>Where ICT converts information or communication it shall preserve all documented non-proprietary information that is provided for accessibility, to the extent that such information can be contained in or supported by the destination format.</p></div></div>"
}